-module(data_broadcast).
-include("../include/comm.hrl").

-export([get/1]).

% 游戏广播;
% broadcast;
% 区      对应 0(综合频道), 6（世界频道）,4（社团频道）, 9（私聊频道）,12（超级公告）,13（综合频道+超级公告）;
% 提示ID  XXYY0
get(1010)->13;
get(1020)->13;
get(2010)->0;
get(3010)->12;
get(3020)->12;
get(3030)->12;
get(3040)->12;
get(3050)->12;
get(3060)->12;
get(3070)->12;
get(4010)->0;
get(5010)->0;
get(5020)->13;
get(5030)->13;
get(5040)->13;
get(5050)->13;
get(6010)->0;
get(6020)->0;
get(6030)->13;
get(6040)->13;
get(7010)->0;
get(7020)->13;
get(7030)->0;
get(_)->?null.
