-module(data_scene).
-include("../include/comm.hrl").

-export([scene/1,material/1]).

%% scene(场影ID) -> 场影数据 
scene(10100)->
	#d_scene{
		scene_id		= 10100,			% 场景ID
		material_id	= 10002,			% 素材ID
		copy_id			= 0,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 1,			% 地图类型
		pass_type		= 0,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [{0,10100,10,160}],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,60,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 0, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 1, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [{50101,2400,60},{50002,2400,230}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [{10101,192,260},{10106,592,260},{10111,992,260},{10116,1392,260},{10121,1792,260},{10126,2192,260}],   % NPC列表  [{npc_id,x,y}]
		monsters		= []    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(10200)->
	#d_scene{
		scene_id		= 10200,			% 场景ID
		material_id	= 10001,			% 素材ID
		copy_id			= 0,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 1,			% 地图类型
		pass_type		= 0,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [{0,10100,10,160}],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,60,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 0, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 1, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [{50101,2400,60},{50001,2400,230}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [{10131,192,300},{10136,442,300},{10141,692,300},{10146,942,300},{10151,1192,300},{10156,1422,300},{10161,1692,300},{10171,1942,300},{10176,2192,300}],   % NPC列表  [{npc_id,x,y}]
		monsters		= []    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20010)->
	#d_scene{
		scene_id		= 20010,			% 场景ID
		material_id	= 10102,			% 素材ID
		copy_id			= 20010,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 60,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{101,0,1,842,145},{101,0,1,816,79},{105,0,1,761,210},{105,0,1,703,206}],[]},{424,1624,434,[{109,0,1,1134,112},{109,0,1,1297,214},{113,0,1,1199,260},{113,0,1,1299,16}],[]},{848,2048,858,[{117,0,1,1653,208},{117,0,1,1559,160},{117,0,1,1642,81},{117,0,1,1673,175}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20020)->
	#d_scene{
		scene_id		= 20020,			% 场景ID
		material_id	= 10102,			% 素材ID
		copy_id			= 20020,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 60,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{121,0,1,866,223},{121,0,1,818,267},{125,0,1,883,62},{125,0,1,840,265},{125,0,1,749,145}],[]},{424,1624,434,[{129,0,1,1260,5},{129,0,1,1240,28},{133,0,1,1145,216},{133,0,1,1181,13},{133,0,1,1184,104}],[]},{848,2048,858,[{137,0,1,1744,109},{137,0,1,1604,44},{137,0,1,1581,175},{137,0,1,1631,112}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20030)->
	#d_scene{
		scene_id		= 20030,			% 场景ID
		material_id	= 10102,			% 素材ID
		copy_id			= 20030,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 120,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 60,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{141,0,1,827,57},{141,0,1,738,158},{141,0,1,717,125},{141,0,1,882,72},{145,0,1,858,103},{145,0,1,758,249}],[]},{424,1624,434,[{149,0,1,1210,28},{149,0,1,1237,188},{149,0,1,1307,226},{149,0,1,1129,148},{153,0,1,1308,117},{153,0,1,1260,137}],[]},{848,2048,858,[{157,0,1,1619,110},{157,0,1,1602,16},{157,0,1,1597,265},{161,0,1,1561,106}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20040)->
	#d_scene{
		scene_id		= 20040,			% 场景ID
		material_id	= 10129,			% 素材ID
		copy_id			= 20040,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 120,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 60,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{165,0,1,732,129},{165,0,1,752,170},{165,0,1,809,43},{165,0,1,888,177},{169,0,1,802,106},{169,0,1,722,212}],[]},{424,1624,434,[{173,0,1,1244,225},{173,0,1,1128,57},{173,0,1,1139,29},{173,0,1,1191,35},{177,0,1,1125,145},{177,0,1,1256,147}],[]},{848,2048,858,[{181,0,1,1587,184},{181,0,1,1639,97},{185,0,1,1578,191}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20050)->
	#d_scene{
		scene_id		= 20050,			% 场景ID
		material_id	= 10129,			% 素材ID
		copy_id			= 20050,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 5,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 60,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{189,0,1,718,205},{189,0,1,781,125},{189,0,1,799,57},{189,0,1,766,26},{193,0,1,818,46},{193,0,1,886,27}],[]},{424,1624,434,[{197,0,1,1299,203},{197,0,1,1179,182},{197,0,1,1176,25},{197,0,1,1131,88},{201,0,1,1283,81},{201,0,1,1172,130}],[]},{848,2048,858,[{205,0,1,1557,131},{205,0,1,1590,234},{209,0,1,1666,204}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20060)->
	#d_scene{
		scene_id		= 20060,			% 场景ID
		material_id	= 10105,			% 素材ID
		copy_id			= 20060,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 5,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 60,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{213,0,1,809,21},{213,0,1,827,107},{213,0,1,893,30},{213,0,1,885,162},{213,0,1,770,39},{213,0,1,796,58}],[]},{424,1624,434,[{217,0,1,1130,90},{217,0,1,1234,240},{217,0,1,1232,106},{221,0,1,1294,215},{221,0,1,1259,188},{221,0,1,1324,89}],[]},{848,2048,858,[{225,0,1,1688,47},{225,0,1,1633,142},{229,0,1,1711,141},{229,0,1,1634,133}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20070)->
	#d_scene{
		scene_id		= 20070,			% 场景ID
		material_id	= 10105,			% 素材ID
		copy_id			= 20070,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 180,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 60,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{233,0,1,798,178},{233,0,1,878,97},{233,0,1,761,77},{233,0,1,731,138},{237,0,1,745,152},{237,0,1,773,228}],[]},{424,1624,434,[{241,0,1,1261,195},{241,0,1,1247,204},{241,0,1,1157,211},{241,0,1,1165,249},{245,0,1,1138,16},{245,0,1,1283,99}],[]},{848,2048,858,[{249,0,1,1572,46},{249,0,1,1558,186},{253,0,1,1655,146},{253,0,1,1592,122},{257,0,1,1698,196},{257,0,1,1628,235}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20080)->
	#d_scene{
		scene_id		= 20080,			% 场景ID
		material_id	= 10105,			% 素材ID
		copy_id			= 20080,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 180,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 60,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{261,0,1,827,186},{261,0,1,704,113},{265,0,1,781,72},{265,0,1,898,209},{265,0,1,840,109},{265,0,1,847,73}],[]},{424,1624,434,[{269,0,1,1313,32},{269,0,1,1254,91},{269,0,1,1145,49},{273,0,1,1140,113},{273,0,1,1316,141},{273,0,1,1223,253}],[]},{848,2048,858,[{277,0,1,1628,74},{277,0,1,1649,37},{281,0,1,1652,251},{281,0,1,1660,237},{285,0,1,1680,115}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20090)->
	#d_scene{
		scene_id		= 20090,			% 场景ID
		material_id	= 10113,			% 素材ID
		copy_id			= 20090,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{289,0,1,852,197},{289,0,1,800,44},{289,0,1,745,92},{293,0,1,857,15},{293,0,1,804,212},{293,0,1,861,92}],[]},{424,1624,434,[{297,0,1,1259,254},{297,0,1,1300,117},{297,0,1,1149,268},{301,0,1,1284,195},{301,0,1,1205,5},{301,0,1,1158,46}],[]},{848,2048,858,[{305,0,1,1570,78},{305,0,1,1677,238},{309,0,1,1648,53}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20100)->
	#d_scene{
		scene_id		= 20100,			% 场景ID
		material_id	= 10113,			% 素材ID
		copy_id			= 20100,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{313,0,1,765,216},{313,0,1,744,126},{313,0,1,748,246},{317,0,1,823,105},{317,0,1,778,241},{317,0,1,818,261}],[]},{424,1624,434,[{321,0,1,1298,73},{321,0,1,1176,51},{321,0,1,1194,1},{325,0,1,1273,236},{325,0,1,1180,197},{325,0,1,1205,228}],[]},{848,2048,858,[{329,0,1,1564,115},{329,0,1,1616,199},{333,0,1,1611,224}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20110)->
	#d_scene{
		scene_id		= 20110,			% 场景ID
		material_id	= 10113,			% 素材ID
		copy_id			= 20110,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{337,0,1,892,69},{337,0,1,888,33},{337,0,1,897,178},{337,0,1,820,253},{341,0,1,815,69},{341,0,1,873,21}],[]},{424,1624,434,[{345,0,1,1174,107},{345,0,1,1204,148},{345,0,1,1179,163},{349,0,1,1166,23},{349,0,1,1304,32},{349,0,1,1255,253}],[]},{848,2048,858,[{353,0,1,1718,124},{353,0,1,1647,216},{353,0,1,1715,108},{357,0,1,1588,92}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20120)->
	#d_scene{
		scene_id		= 20120,			% 场景ID
		material_id	= 10107,			% 素材ID
		copy_id			= 20120,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{361,0,1,824,26},{361,0,1,742,177},{361,0,1,801,47},{365,0,1,899,121},{365,0,1,701,109},{365,0,1,758,192}],[]},{424,1624,434,[{369,0,1,1160,28},{369,0,1,1127,39},{369,0,1,1200,48},{373,0,1,1320,223},{373,0,1,1241,186},{373,0,1,1154,66}],[]},{848,2048,858,[{377,0,1,1705,202},{377,0,1,1615,115},{381,0,1,1660,205}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20130)->
	#d_scene{
		scene_id		= 20130,			% 场景ID
		material_id	= 10107,			% 素材ID
		copy_id			= 20130,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{385,0,1,742,93},{385,0,1,815,88},{385,0,1,806,109},{389,0,1,815,13},{389,0,1,810,53},{389,0,1,893,238}],[]},{424,1624,434,[{393,0,1,1206,206},{393,0,1,1322,66},{393,0,1,1159,178},{397,0,1,1128,87},{397,0,1,1263,29},{397,0,1,1146,75}],[]},{848,2048,858,[{401,0,1,1611,76},{401,0,1,1710,79},{405,0,1,1624,103}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20140)->
	#d_scene{
		scene_id		= 20140,			% 场景ID
		material_id	= 10107,			% 素材ID
		copy_id			= 20140,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{409,0,1,845,168},{409,0,1,782,243},{413,0,1,830,132},{413,0,1,745,149},{413,0,1,850,117},{413,0,1,881,73}],[]},{424,1624,434,[{417,0,1,1181,94},{417,0,1,1127,76},{421,0,1,1321,195},{421,0,1,1241,155},{421,0,1,1178,130},{421,0,1,1283,219}],[]},{848,2048,858,[{425,0,1,1632,19},{425,0,1,1639,179},{429,0,1,1648,104}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20150)->
	#d_scene{
		scene_id		= 20150,			% 场景ID
		material_id	= 10123,			% 素材ID
		copy_id			= 20150,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{433,0,1,819,155},{433,0,1,824,26},{437,0,1,737,83},{437,0,1,704,45},{437,0,1,785,160},{437,0,1,812,227}],[]},{424,1624,434,[{441,0,1,1136,91},{441,0,1,1245,151},{441,0,1,1244,96},{445,0,1,1306,224},{445,0,1,1240,126},{445,0,1,1271,48}],[]},{848,2048,858,[{449,0,1,1700,276},{449,0,1,1618,199},{453,0,1,1707,11},{453,0,1,1707,141},{453,0,1,1590,175},{453,0,1,1730,275}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20160)->
	#d_scene{
		scene_id		= 20160,			% 场景ID
		material_id	= 10123,			% 素材ID
		copy_id			= 20160,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{457,0,1,833,280},{457,0,1,702,277},{457,0,1,715,86},{461,0,1,817,235},{461,0,1,709,16},{461,0,1,813,92}],[]},{424,1624,434,[{465,0,1,1271,131},{465,0,1,1189,22},{465,0,1,1206,167},{469,0,1,1277,169},{469,0,1,1255,235},{469,0,1,1208,232}],[]},{848,2048,858,[{473,0,1,1695,56},{473,0,1,1703,21},{473,0,1,1598,276},{473,0,1,1712,64},{477,0,1,1585,69},{477,0,1,1734,75}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20170)->
	#d_scene{
		scene_id		= 20170,			% 场景ID
		material_id	= 10123,			% 素材ID
		copy_id			= 20170,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{481,0,1,833,225},{481,0,1,852,90},{481,0,1,865,209},{481,0,1,880,65},{485,0,1,772,161},{485,0,1,772,60}],[]},{424,1624,434,[{489,0,1,1152,18},{489,0,1,1251,244},{489,0,1,1253,124},{493,0,1,1162,144},{493,0,1,1319,224},{493,0,1,1201,141}],[]},{848,2048,858,[{497,0,1,1556,188},{497,0,1,1728,99},{501,0,1,1572,124}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20171)->
	#d_scene{
		scene_id		= 20171,			% 场景ID
		material_id	= 10123,			% 素材ID
		copy_id			= 20171,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{505,0,1,783,210},{505,0,1,788,202},{505,0,1,802,49},{509,0,1,756,25},{509,0,1,896,80},{509,0,1,824,86}],[]},{424,1624,434,[{513,0,1,1284,49},{513,0,1,1185,21},{513,0,1,1223,127},{517,0,1,1244,9},{517,0,1,1188,38},{517,0,1,1190,213}],[]},{848,2048,858,[{521,0,1,1714,156},{521,0,1,1670,54},{521,0,1,1729,90},{521,0,1,1669,168},{525,0,1,1702,201},{525,0,1,1686,213}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20172)->
	#d_scene{
		scene_id		= 20172,			% 场景ID
		material_id	= 10123,			% 素材ID
		copy_id			= 20172,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{529,0,1,802,159},{529,0,1,757,117},{529,0,1,771,273},{529,0,1,804,164},{529,0,1,794,9},{529,0,1,776,39}],[]},{424,1624,434,[{533,0,1,1164,106},{533,0,1,1144,173},{533,0,1,1265,124},{537,0,1,1209,95},{537,0,1,1265,60},{537,0,1,1133,249}],[]},{848,2048,858,[{541,0,1,1696,212},{541,0,1,1713,59}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20180)->
	#d_scene{
		scene_id		= 20180,			% 场景ID
		material_id	= 10130,			% 素材ID
		copy_id			= 20180,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{545,0,1,866,115},{545,0,1,793,98},{545,0,1,750,226},{549,0,1,809,151},{549,0,1,826,25},{549,0,1,843,73}],[]},{424,1624,434,[{553,0,1,1317,92},{553,0,1,1254,102},{553,0,1,1198,92},{553,0,1,1167,60},{557,0,1,1209,173},{557,0,1,1173,193}],[]},{848,2048,858,[{561,0,1,1564,13},{561,0,1,1579,69},{565,0,1,1628,164}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20190)->
	#d_scene{
		scene_id		= 20190,			% 场景ID
		material_id	= 10130,			% 素材ID
		copy_id			= 20190,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{569,0,1,880,153},{569,0,1,778,1},{569,0,1,751,48},{569,0,1,830,285},{573,0,1,763,70},{573,0,1,876,38}],[]},{424,1624,434,[{577,0,1,1247,202},{577,0,1,1295,29},{577,0,1,1203,239},{577,0,1,1178,197},{581,0,1,1204,242},{581,0,1,1211,243}],[]},{848,2048,858,[{585,0,1,1728,64},{585,0,1,1745,281},{585,0,1,1723,152},{585,0,1,1679,133},{589,0,1,1580,187}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20200)->
	#d_scene{
		scene_id		= 20200,			% 场景ID
		material_id	= 10130,			% 素材ID
		copy_id			= 20200,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{593,0,1,774,16},{593,0,1,802,16},{597,0,1,775,131},{597,0,1,760,281},{597,0,1,703,189},{597,0,1,823,155}],[]},{424,1624,434,[{601,0,1,1187,285},{601,0,1,1183,106},{601,0,1,1189,103},{601,0,1,1172,172},{605,0,1,1265,78},{605,0,1,1240,168}],[]},{848,2048,858,[{609,0,1,1598,235},{609,0,1,1702,119},{613,0,1,1674,144}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20210)->
	#d_scene{
		scene_id		= 20210,			% 场景ID
		material_id	= 10116,			% 素材ID
		copy_id			= 20210,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{617,0,1,894,52},{617,0,1,818,198},{617,0,1,722,189},{621,0,1,848,227},{621,0,1,787,24},{621,0,1,800,167}],[]},{424,1624,434,[{625,0,1,1148,43},{625,0,1,1187,288},{629,0,1,1245,80},{629,0,1,1208,137},{629,0,1,1137,133},{629,0,1,1212,275}],[]},{848,2048,858,[{633,0,1,1650,100},{633,0,1,1651,115},{633,0,1,1600,20},{633,0,1,1677,106},{637,0,1,1658,256}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20220)->
	#d_scene{
		scene_id		= 20220,			% 场景ID
		material_id	= 10116,			% 素材ID
		copy_id			= 20220,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{641,0,1,777,15},{641,0,1,722,38},{641,0,1,729,198},{641,0,1,753,37},{641,0,1,709,181},{641,0,1,869,135}],[]},{424,1624,434,[{645,0,1,1229,18},{645,0,1,1250,86},{645,0,1,1180,178},{645,0,1,1205,100},{649,0,1,1166,228},{649,0,1,1155,105}],[]},{848,2048,858,[{653,0,1,1694,33},{653,0,1,1613,3},{657,0,1,1705,240}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20230)->
	#d_scene{
		scene_id		= 20230,			% 场景ID
		material_id	= 10116,			% 素材ID
		copy_id			= 20230,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{661,0,1,891,50},{661,0,1,784,95},{665,0,1,765,255},{665,0,1,816,137},{665,0,1,727,234},{665,0,1,707,207}],[]},{424,1624,434,[{669,0,1,1313,122},{669,0,1,1269,104},{669,0,1,1171,157},{673,0,1,1235,121},{673,0,1,1254,200},{673,0,1,1138,41}],[]},{848,2048,858,[{677,0,1,1658,249},{677,0,1,1594,91},{681,0,1,1727,125}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20240)->
	#d_scene{
		scene_id		= 20240,			% 场景ID
		material_id	= 10119,			% 素材ID
		copy_id			= 20240,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{685,0,1,714,35},{685,0,1,893,217},{685,0,1,865,260},{689,0,1,748,173},{689,0,1,826,253},{689,0,1,785,15}],[]},{424,1624,434,[{693,0,1,1174,159},{693,0,1,1198,138},{697,0,1,1308,143},{697,0,1,1316,199},{697,0,1,1205,197},{697,0,1,1239,116}],[]},{848,2048,858,[{701,0,1,1621,109},{701,0,1,1622,165},{705,0,1,1584,113}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20250)->
	#d_scene{
		scene_id		= 20250,			% 场景ID
		material_id	= 10119,			% 素材ID
		copy_id			= 20250,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{709,0,1,755,19},{709,0,1,861,221},{709,0,1,751,245},{713,0,1,875,305},{713,0,1,755,144},{713,0,1,883,287}],[]},{424,1624,434,[{717,0,1,1239,131},{717,0,1,1288,226},{717,0,1,1304,48},{721,0,1,1279,207},{721,0,1,1307,259},{721,0,1,1280,241}],[]},{848,2048,858,[{725,0,1,1661,51},{725,0,1,1611,146},{725,0,1,1727,269},{729,0,1,1625,300}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20260)->
	#d_scene{
		scene_id		= 20260,			% 场景ID
		material_id	= 10119,			% 素材ID
		copy_id			= 20260,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{733,0,1,790,242},{733,0,1,762,25},{733,0,1,876,180},{737,0,1,873,251},{737,0,1,854,287},{737,0,1,711,256}],[]},{424,1624,434,[{741,0,1,1135,280},{741,0,1,1322,82},{741,0,1,1232,107},{745,0,1,1167,63},{745,0,1,1150,188},{745,0,1,1242,266}],[]},{848,2048,858,[{749,0,1,1675,143},{749,0,1,1606,259},{753,0,1,1610,303}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20270)->
	#d_scene{
		scene_id		= 20270,			% 场景ID
		material_id	= 10110,			% 素材ID
		copy_id			= 20270,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{757,0,1,862,189},{757,0,1,772,182},{757,0,1,833,181},{761,0,1,712,261}],[]},{424,1624,434,[{765,0,1,1188,136},{765,0,1,1209,266},{765,0,1,1136,279},{769,0,1,1172,17}],[]},{848,2048,858,[{773,0,1,1576,208},{773,0,1,1601,262},{777,0,1,1591,71}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20280)->
	#d_scene{
		scene_id		= 20280,			% 场景ID
		material_id	= 10110,			% 素材ID
		copy_id			= 20280,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{781,0,1,822,28},{781,0,1,889,104},{781,0,1,770,11},{785,0,1,879,134}],[]},{424,1624,434,[{789,0,1,1175,150},{789,0,1,1133,220},{789,0,1,1218,148},{793,0,1,1200,40}],[]},{848,2048,858,[{797,0,1,1591,88},{797,0,1,1633,201},{801,0,1,1572,118}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20290)->
	#d_scene{
		scene_id		= 20290,			% 场景ID
		material_id	= 10110,			% 素材ID
		copy_id			= 20290,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{805,0,1,854,80},{805,0,1,715,169},{805,0,1,801,186},{809,0,1,771,171},{809,0,1,733,245},{809,0,1,774,221}],[]},{424,1624,434,[{813,0,1,1131,202},{813,0,1,1293,80},{813,0,1,1209,139},{813,0,1,1125,180},{813,0,1,1320,26},{813,0,1,1281,12}],[]},{848,2048,858,[{817,0,1,1686,186},{817,0,1,1584,48},{821,0,1,1742,188},{821,0,1,1726,35},{825,0,1,1579,73}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20300)->
	#d_scene{
		scene_id		= 20300,			% 场景ID
		material_id	= 10131,			% 素材ID
		copy_id			= 20300,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{829,0,1,881,65},{829,0,1,841,225},{829,0,1,718,221},{833,0,1,863,55}],[]},{424,1624,434,[{837,0,1,1140,169},{837,0,1,1217,255},{837,0,1,1163,81},{841,0,1,1246,67}],[]},{848,2048,858,[{845,0,1,1549,259},{845,0,1,1695,116},{849,0,1,1640,125}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20310)->
	#d_scene{
		scene_id		= 20310,			% 场景ID
		material_id	= 10131,			% 素材ID
		copy_id			= 20310,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{853,0,1,842,98},{857,0,1,778,62},{857,0,1,746,19},{857,0,1,859,214}],[]},{424,1624,434,[{861,0,1,1323,182},{865,0,1,1223,217},{865,0,1,1192,40},{865,0,1,1306,133}],[]},{848,2048,858,[{869,0,1,1618,251},{869,0,1,1623,79},{869,0,1,1592,202},{873,0,1,1727,30}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20320)->
	#d_scene{
		scene_id		= 20320,			% 场景ID
		material_id	= 10131,			% 素材ID
		copy_id			= 20320,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{877,0,1,879,197},{877,0,1,766,140},{877,0,1,865,40},{881,0,1,859,112},{881,0,1,809,19}],[]},{424,1624,434,[{885,0,1,1321,6},{885,0,1,1256,249},{885,0,1,1149,100},{889,0,1,1223,235},{889,0,1,1158,215}],[]},{848,2048,858,[{893,0,1,1558,237},{893,0,1,1647,175},{893,0,1,1562,4},{893,0,1,1740,55},{897,0,1,1727,116}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20330)->
	#d_scene{
		scene_id		= 20330,			% 场景ID
		material_id	= 10132,			% 素材ID
		copy_id			= 20330,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{901,0,1,851,223},{901,0,1,752,91},{905,0,1,874,224},{905,0,1,784,155},{905,0,1,738,246},{905,0,1,752,5}],[]},{424,1624,434,[{909,0,1,1200,167},{909,0,1,1273,185},{913,0,1,1161,15},{913,0,1,1174,52},{913,0,1,1320,47},{913,0,1,1256,237}],[]},{848,2048,858,[{917,0,1,1703,198},{921,0,1,1626,41}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20340)->
	#d_scene{
		scene_id		= 20340,			% 场景ID
		material_id	= 10132,			% 素材ID
		copy_id			= 20340,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{925,0,1,755,240},{929,0,1,834,131},{929,0,1,814,66},{929,0,1,704,72},{929,0,1,891,16}],[]},{424,1624,434,[{933,0,1,1269,76},{933,0,1,1307,15},{933,0,1,1244,140},{933,0,1,1300,125}],[]},{848,2048,858,[{937,0,1,1563,163},{937,0,1,1650,222},{941,0,1,1635,274}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20350)->
	#d_scene{
		scene_id		= 20350,			% 场景ID
		material_id	= 10132,			% 素材ID
		copy_id			= 20350,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{945,0,1,839,206},{945,0,1,800,277},{945,0,1,871,49},{949,0,1,833,78},{949,0,1,875,206},{949,0,1,779,28}],[]},{424,1624,434,[{953,0,1,1259,87},{953,0,1,1142,178},{953,0,1,1234,163},{953,0,1,1293,262}],[]},{848,2048,858,[{957,0,1,1692,228},{957,0,1,1613,238},{961,0,1,1704,108}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20360)->
	#d_scene{
		scene_id		= 20360,			% 场景ID
		material_id	= 10113,			% 素材ID
		copy_id			= 20360,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{965,0,1,805,133},{965,0,1,818,217},{965,0,1,766,74},{969,0,1,874,73},{969,0,1,732,45},{969,0,1,749,50}],[]},{424,1624,434,[{973,0,1,1203,84},{973,0,1,1259,65},{977,0,1,1263,92},{977,0,1,1134,265},{977,0,1,1179,189}],[]},{848,2048,858,[{981,0,1,1622,129},{981,0,1,1692,72},{981,0,1,1723,219},{985,0,1,1641,36}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20370)->
	#d_scene{
		scene_id		= 20370,			% 场景ID
		material_id	= 10113,			% 素材ID
		copy_id			= 20370,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{989,0,1,900,5},{989,0,1,766,221},{993,0,1,758,99},{993,0,1,730,101},{993,0,1,796,287},{993,0,1,708,237}],[]},{424,1624,434,[{997,0,1,1262,242},{997,0,1,1206,236},{997,0,1,1159,291},{997,0,1,1189,22}],[]},{848,2048,858,[{1001,0,1,1581,273},{1005,0,1,1581,135}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20380)->
	#d_scene{
		scene_id		= 20380,			% 场景ID
		material_id	= 10113,			% 素材ID
		copy_id			= 20380,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1009,0,1,898,134},{1013,0,1,854,222},{1013,0,1,742,52},{1013,0,1,833,306}],[]},{424,1624,434,[{1017,0,1,1201,86},{1021,0,1,1277,74},{1021,0,1,1264,189},{1021,0,1,1162,298}],[]},{848,2048,858,[{1025,0,1,1562,145},{1029,0,1,1568,205}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20390)->
	#d_scene{
		scene_id		= 20390,			% 场景ID
		material_id	= 10141,			% 素材ID
		copy_id			= 20390,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1033,0,1,702,165},{1037,0,1,823,268},{1037,0,1,763,87}],[]},{424,1624,434,[{1041,0,1,1233,198},{1045,0,1,1256,48},{1045,0,1,1262,293}],[]},{848,2048,858,[{1049,0,1,1578,94},{1053,0,1,1694,79},{1053,0,1,1739,296}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20400)->
	#d_scene{
		scene_id		= 20400,			% 场景ID
		material_id	= 10141,			% 素材ID
		copy_id			= 20400,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1057,0,1,738,242},{1061,0,1,723,206},{1061,0,1,846,243}],[]},{424,1624,434,[{1065,0,1,1158,129},{1069,0,1,1200,156},{1069,0,1,1132,91}],[]},{848,2048,858,[{1073,0,1,1596,18},{1077,0,1,1716,53},{1077,0,1,1703,255}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20410)->
	#d_scene{
		scene_id		= 20410,			% 场景ID
		material_id	= 10141,			% 素材ID
		copy_id			= 20410,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1081,0,1,837,73},{1085,0,1,717,89},{1085,0,1,749,114},{1085,0,1,767,167}],[]},{424,1624,434,[{1089,0,1,1218,117},{1093,0,1,1249,175},{1093,0,1,1324,10},{1093,0,1,1234,15}],[]},{848,2048,858,[{1097,0,1,1647,117},{1101,0,1,1746,156}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20420)->
	#d_scene{
		scene_id		= 20420,			% 场景ID
		material_id	= 10133,			% 素材ID
		copy_id			= 20420,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1105,0,1,880,221},{1109,0,1,766,225}],[]},{424,1624,434,[{1113,0,1,1302,127},{1117,0,1,1321,8}],[]},{848,2048,858,[{1121,0,1,1606,54},{1121,0,1,1637,179},{1125,0,1,1605,251},{1125,0,1,1585,171},{1125,0,1,1558,228}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20430)->
	#d_scene{
		scene_id		= 20430,			% 场景ID
		material_id	= 10133,			% 素材ID
		copy_id			= 20430,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1129,0,1,795,30},{1133,0,1,720,99},{1133,0,1,711,260}],[]},{424,1624,434,[{1137,0,1,1126,168},{1141,0,1,1274,105},{1141,0,1,1238,45}],[]},{848,2048,858,[{1145,0,1,1667,231},{1145,0,1,1659,261},{1145,0,1,1623,169},{1149,0,1,1576,200},{1149,0,1,1692,236}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20440)->
	#d_scene{
		scene_id		= 20440,			% 场景ID
		material_id	= 10133,			% 素材ID
		copy_id			= 20440,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1153,0,1,755,123},{1153,0,1,819,20},{1153,0,1,724,257},{1153,0,1,751,238}],[]},{424,1624,434,[{1157,0,1,1298,58},{1157,0,1,1186,13},{1157,0,1,1214,90},{1161,0,1,1249,101},{1161,0,1,1312,198}],[]},{848,2048,858,[{1165,0,1,1625,155},{1169,0,1,1598,253}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20450)->
	#d_scene{
		scene_id		= 20450,			% 场景ID
		material_id	= 10134,			% 素材ID
		copy_id			= 20450,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1173,0,1,886,198},{1177,0,1,887,136}],[]},{424,1624,434,[{1181,0,1,1138,28},{1181,0,1,1265,62},{1181,0,1,1198,216},{1185,0,1,1168,95},{1185,0,1,1180,136},{1185,0,1,1317,187}],[]},{848,2048,858,[{1189,0,1,1614,243},{1193,0,1,1667,93},{1193,0,1,1659,8},{1193,0,1,1724,125},{1193,0,1,1662,46}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20460)->
	#d_scene{
		scene_id		= 20460,			% 场景ID
		material_id	= 10134,			% 素材ID
		copy_id			= 20460,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1197,0,1,714,278},{1201,0,1,888,249},{1201,0,1,871,266},{1201,0,1,777,236}],[]},{424,1624,434,[{1205,0,1,1293,230},{1209,0,1,1250,116},{1209,0,1,1152,188},{1209,0,1,1151,1}],[]},{848,2048,858,[{1213,0,1,1618,191},{1217,0,1,1658,81},{1217,0,1,1591,123},{1217,0,1,1636,104}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20470)->
	#d_scene{
		scene_id		= 20470,			% 场景ID
		material_id	= 10134,			% 素材ID
		copy_id			= 20470,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1221,0,1,773,273},{1221,0,1,760,74},{1225,0,1,747,187},{1225,0,1,805,262},{1225,0,1,791,164},{1225,0,1,764,50}],[]},{424,1624,434,[{1229,0,1,1218,127},{1229,0,1,1194,14},{1233,0,1,1317,166},{1233,0,1,1180,132},{1233,0,1,1191,236},{1233,0,1,1266,248}],[]},{848,2048,858,[{1237,0,1,1642,35},{1241,0,1,1580,140},{1241,0,1,1716,191}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20480)->
	#d_scene{
		scene_id		= 20480,			% 场景ID
		material_id	= 10135,			% 素材ID
		copy_id			= 20480,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1245,0,1,747,167},{1249,0,1,898,219},{1249,0,1,736,170},{1249,0,1,832,261}],[]},{424,1624,434,[{1253,0,1,1202,137},{1257,0,1,1288,254},{1257,0,1,1249,270},{1257,0,1,1154,250}],[]},{848,2048,858,[{1261,0,1,1744,113},{1265,0,1,1686,161},{1265,0,1,1625,138},{1265,0,1,1697,189}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20490)->
	#d_scene{
		scene_id		= 20490,			% 场景ID
		material_id	= 10135,			% 素材ID
		copy_id			= 20490,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1269,0,1,830,249},{1269,0,1,767,128},{1269,0,1,882,147},{1273,0,1,793,53},{1273,0,1,813,67},{1273,0,1,803,209}],[]},{424,1624,434,[{1277,0,1,1214,145},{1277,0,1,1175,182},{1277,0,1,1191,179},{1281,0,1,1291,94},{1281,0,1,1176,35},{1281,0,1,1286,101}],[]},{848,2048,858,[{1285,0,1,1628,249},{1285,0,1,1614,63},{1285,0,1,1565,86},{1289,0,1,1737,10},{1289,0,1,1734,55},{1289,0,1,1593,173}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20500)->
	#d_scene{
		scene_id		= 20500,			% 场景ID
		material_id	= 10135,			% 素材ID
		copy_id			= 20500,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1293,0,1,802,69},{1293,0,1,723,191},{1293,0,1,731,47},{1297,0,1,705,50},{1297,0,1,746,137},{1297,0,1,832,205}],[]},{424,1624,434,[{1301,0,1,1271,279},{1301,0,1,1218,54},{1305,0,1,1280,51},{1305,0,1,1156,176},{1305,0,1,1170,233}],[]},{848,2048,858,[{1309,0,1,1692,231},{1309,0,1,1619,47},{1313,0,1,1688,180}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20510)->
	#d_scene{
		scene_id		= 20510,			% 场景ID
		material_id	= 10130,			% 素材ID
		copy_id			= 20510,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1317,0,1,746,252},{1317,0,1,867,39},{1321,0,1,717,24},{1321,0,1,749,64}],[]},{424,1624,434,[{1325,0,1,1224,83},{1325,0,1,1246,5},{1325,0,1,1215,24},{1325,0,1,1232,163}],[]},{848,2048,858,[{1329,0,1,1597,280},{1329,0,1,1615,127},{1329,0,1,1734,124},{1329,0,1,1702,35}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20520)->
	#d_scene{
		scene_id		= 20520,			% 场景ID
		material_id	= 10130,			% 素材ID
		copy_id			= 20520,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1333,0,1,717,64},{1337,0,1,710,67},{1337,0,1,779,199},{1337,0,1,819,252}],[]},{424,1624,434,[{1341,0,1,1272,273},{1345,0,1,1178,87},{1345,0,1,1244,267},{1345,0,1,1314,200}],[]},{848,2048,858,[{1349,0,1,1650,25},{1353,0,1,1605,96},{1353,0,1,1732,241},{1353,0,1,1591,23}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20530)->
	#d_scene{
		scene_id		= 20530,			% 场景ID
		material_id	= 10130,			% 素材ID
		copy_id			= 20530,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1357,0,1,893,182},{1361,0,1,796,76},{1361,0,1,748,204},{1361,0,1,850,45}],[]},{424,1624,434,[{1365,0,1,1179,135},{1369,0,1,1186,248},{1369,0,1,1260,183},{1369,0,1,1295,94}],[]},{848,2048,858,[{1373,0,1,1714,231},{1373,0,1,1718,200},{1373,0,1,1649,109},{1377,0,1,1677,29}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20540)->
	#d_scene{
		scene_id		= 20540,			% 场景ID
		material_id	= 10105,			% 素材ID
		copy_id			= 20540,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1381,0,1,713,107},{1385,0,1,707,197},{1385,0,1,797,202},{1385,0,1,790,114}],[]},{424,1624,434,[{1389,0,1,1240,104},{1393,0,1,1142,159},{1393,0,1,1212,102},{1393,0,1,1252,170}],[]},{848,2048,858,[{1397,0,1,1562,88},{1397,0,1,1683,205},{1397,0,1,1715,180},{1401,0,1,1562,188}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20550)->
	#d_scene{
		scene_id		= 20550,			% 场景ID
		material_id	= 10105,			% 素材ID
		copy_id			= 20550,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1405,0,1,828,153},{1409,0,1,852,68},{1409,0,1,823,140},{1409,0,1,803,102}],[]},{424,1624,434,[{1413,0,1,1213,235},{1417,0,1,1197,27},{1417,0,1,1256,185},{1417,0,1,1281,124}],[]},{848,2048,858,[{1421,0,1,1707,158},{1421,0,1,1650,236},{1425,0,1,1652,244}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20560)->
	#d_scene{
		scene_id		= 20560,			% 场景ID
		material_id	= 10105,			% 素材ID
		copy_id			= 20560,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1429,0,1,724,201},{1433,0,1,726,66}],[]},{424,1624,434,[{1437,0,1,1197,177},{1441,0,1,1293,161}],[]},{848,2048,858,[{1445,0,1,1660,124},{1449,0,1,1669,175}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20570)->
	#d_scene{
		scene_id		= 20570,			% 场景ID
		material_id	= 10136,			% 素材ID
		copy_id			= 20570,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1453,0,1,775,153},{1457,0,1,702,42},{1457,0,1,864,129}],[]},{424,1624,434,[{1461,0,1,1140,66},{1465,0,1,1130,76},{1465,0,1,1199,150}],[]},{848,2048,858,[{1469,0,1,1688,192},{1473,0,1,1597,131},{1473,0,1,1704,234}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20580)->
	#d_scene{
		scene_id		= 20580,			% 场景ID
		material_id	= 10136,			% 素材ID
		copy_id			= 20580,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1477,0,1,752,97},{1477,0,1,854,241},{1477,0,1,735,117},{1477,0,1,763,48},{1477,0,1,831,1}],[]},{424,1624,434,[{1481,0,1,1295,259},{1481,0,1,1260,267},{1481,0,1,1161,77},{1481,0,1,1296,271},{1481,0,1,1273,18}],[]},{848,2048,858,[{1485,0,1,1555,28},{1485,0,1,1699,190},{1485,0,1,1730,37},{1485,0,1,1731,187},{1485,0,1,1705,69}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20590)->
	#d_scene{
		scene_id		= 20590,			% 场景ID
		material_id	= 10136,			% 素材ID
		copy_id			= 20590,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1489,0,1,714,140},{1493,0,1,858,164}],[]},{424,1624,434,[{1497,0,1,1263,163},{1497,0,1,1137,34},{1497,0,1,1248,151},{1501,0,1,1170,206},{1501,0,1,1257,276},{1501,0,1,1201,6}],[]},{848,2048,858,[{1505,0,1,1656,72},{1505,0,1,1604,28},{1505,0,1,1682,225},{1505,0,1,1560,211},{1509,0,1,1739,130}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(20600)->
	#d_scene{
		scene_id		= 20600,			% 场景ID
		material_id	= 10137,			% 素材ID
		copy_id			= 20600,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{1513,0,1,738,43},{1517,0,1,861,176},{1517,0,1,802,215},{1517,0,1,794,102}],[]},{424,1624,434,[{1521,0,1,1277,212},{1525,0,1,1249,113},{1525,0,1,1144,102},{1525,0,1,1166,192}],[]},{848,2048,858,[{1529,0,1,1671,264},{1533,0,1,1643,212}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30010)->
	#d_scene{
		scene_id		= 30010,			% 场景ID
		material_id	= 10103,			% 素材ID
		copy_id			= 30010,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6000,0,1,842,145},{6000,0,1,816,79},{6000,0,1,761,210},{6004,0,1,703,206},{6004,0,1,863,192},{6004,0,1,710,112}],[]},{453,1653,463,[{6008,0,1,1228,260},{6008,0,1,1328,16},{6008,0,1,1343,99},{6012,0,1,1258,208},{6012,0,1,1164,160},{6012,0,1,1247,81}],[]},{906,2106,916,[{6016,0,1,1659,76},{6016,0,1,1772,223},{6016,0,1,1724,267},{6020,0,1,1789,62},{6020,0,1,1746,265},{6020,0,1,1655,145}],[]},{1359,2559,1369,[{6024,0,1,2195,5},{6024,0,1,2175,28},{6024,0,1,2080,216},{6024,0,1,2116,13},{6028,0,1,2119,104}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30020)->
	#d_scene{
		scene_id		= 30020,			% 场景ID
		material_id	= 10104,			% 素材ID
		copy_id			= 30020,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6032,0,1,896,109},{6032,0,1,756,44},{6032,0,1,733,175},{6036,0,1,783,112},{6036,0,1,843,89},{6036,0,1,827,57}],[]},{453,1653,463,[{6040,0,1,1170,124},{6040,0,1,1335,71},{6040,0,1,1311,103},{6044,0,1,1211,249},{6044,0,1,1280,170},{6044,0,1,1239,27}],[]},{906,2106,916,[{6048,0,1,1789,226},{6048,0,1,1611,147},{6048,0,1,1790,117},{6052,0,1,1742,136},{6052,0,1,1709,126},{6052,0,1,1677,110}],[]},{1359,2559,1369,[{6056,0,1,2108,265},{6056,0,1,2072,106},{6056,0,1,2132,133},{6056,0,1,2091,129},{6060,0,1,2111,170}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30030)->
	#d_scene{
		scene_id		= 30030,			% 场景ID
		material_id	= 10115,			% 素材ID
		copy_id			= 30030,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6064,0,1,888,178},{6064,0,1,802,107},{6064,0,1,722,212},{6068,0,1,792,204},{6068,0,1,820,226},{6068,0,1,704,58}],[]},{453,1653,463,[{6072,0,1,1220,36},{6072,0,1,1154,146},{6072,0,1,1285,148},{6076,0,1,1319,24},{6076,0,1,1192,184},{6076,0,1,1244,98}],[]},{906,2106,916,[{6080,0,1,1792,144},{6080,0,1,1624,205},{6080,0,1,1687,126},{6084,0,1,1705,57},{6084,0,1,1672,27},{6084,0,1,1724,47},{6088,0,1,1792,28}],[]},{1359,2559,1369,[{6092,0,1,2234,203},{6092,0,1,2114,183},{6092,0,1,2111,26},{6092,0,1,2066,88},{6096,0,1,2218,81}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30040)->
	#d_scene{
		scene_id		= 30040,			% 场景ID
		material_id	= 10115,			% 素材ID
		copy_id			= 30040,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6100,0,1,751,92},{6100,0,1,709,131},{6100,0,1,742,234},{6104,0,1,818,204},{6104,0,1,886,90},{6104,0,1,809,22}],[]},{453,1653,463,[{6108,0,1,1346,31},{6108,0,1,1338,168},{6108,0,1,1223,41},{6112,0,1,1249,60},{6112,0,1,1352,36},{6112,0,1,1159,94},{6116,0,1,1263,250}],[]},{906,2106,916,[{6120,0,1,1776,224},{6120,0,1,1741,195},{6120,0,1,1806,92},{6124,0,1,1706,112},{6124,0,1,1746,49},{6124,0,1,1691,147},{6128,0,1,1769,147}],[]},{1359,2559,1369,[{6132,0,1,2105,168},{6132,0,1,2157,184},{6132,0,1,2237,101},{6132,0,1,2120,80},{6132,0,1,2090,144},{6136,0,1,2104,158}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30050)->
	#d_scene{
		scene_id		= 30050,			% 场景ID
		material_id	= 10115,			% 素材ID
		copy_id			= 30050,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6140,0,1,796,52},{6140,0,1,837,202},{6140,0,1,823,212},{6144,0,1,733,219},{6144,0,1,741,259},{6144,0,1,714,17},{6148,0,1,859,103}],[]},{453,1653,463,[{6152,0,1,1177,47},{6152,0,1,1163,194},{6152,0,1,1260,152},{6156,0,1,1197,127},{6156,0,1,1303,204},{6156,0,1,1233,244},{6160,0,1,1303,24}],[]},{906,2106,916,[{6164,0,1,1610,117},{6164,0,1,1687,75},{6164,0,1,1804,217},{6168,0,1,1746,113},{6168,0,1,1753,75},{6168,0,1,1678,118},{6172,0,1,1795,33}],[]},{1359,2559,1369,[{6176,0,1,2080,51},{6176,0,1,2075,117},{6176,0,1,2251,147},{6176,0,1,2158,263},{6176,0,1,2103,103},{6180,0,1,2139,77}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30060)->
	#d_scene{
		scene_id		= 30060,			% 场景ID
		material_id	= 10104,			% 素材ID
		copy_id			= 30060,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6184,0,1,804,251},{6184,0,1,812,237},{6184,0,1,832,115},{6188,0,1,839,17},{6188,0,1,852,183},{6188,0,1,800,41},{6192,0,1,745,85}],[]},{453,1653,463,[{6196,0,1,1257,197},{6196,0,1,1314,85},{6196,0,1,1348,210},{6200,0,1,1288,236},{6200,0,1,1329,109},{6200,0,1,1178,249},{6204,0,1,1313,182}],[]},{906,2106,916,[{6208,0,1,1640,43},{6208,0,1,1708,106},{6208,0,1,1628,72},{6212,0,1,1735,221},{6212,0,1,1706,49},{6212,0,1,1786,97},{6216,0,1,1671,201}],[]},{1359,2559,1369,[{6220,0,1,2107,229},{6220,0,1,2182,98},{6220,0,1,2137,224},{6220,0,1,2177,243},{6220,0,1,2163,86},{6224,0,1,2233,68}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30070)->
	#d_scene{
		scene_id		= 30070,			% 场景ID
		material_id	= 10109,			% 素材ID
		copy_id			= 30070,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6228,0,1,770,1},{6228,0,1,849,219},{6228,0,1,756,183},{6232,0,1,781,212},{6232,0,1,849,114},{6232,0,1,716,107},{6236,0,1,768,185}],[]},{453,1653,463,[{6240,0,1,1184,155},{6240,0,1,1345,64},{6240,0,1,1341,30},{6244,0,1,1350,165},{6244,0,1,1273,235},{6244,0,1,1268,64},{6248,0,1,1326,20}],[]},{906,2106,916,[{6252,0,1,1656,99},{6252,0,1,1686,137},{6252,0,1,1661,152},{6256,0,1,1648,21},{6256,0,1,1786,29},{6256,0,1,1737,235},{6260,0,1,1653,247}],[]},{1359,2559,1369,[{6264,0,1,2158,201},{6264,0,1,2226,100},{6264,0,1,2099,85},{6268,0,1,2142,40},{6268,0,1,2183,26},{6272,0,1,2101,181}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30080)->
	#d_scene{
		scene_id		= 30080,			% 场景ID
		material_id	= 10109,			% 素材ID
		copy_id			= 30080,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6276,0,1,899,123},{6276,0,1,701,111},{6276,0,1,758,196},{6280,0,1,879,214},{6280,0,1,736,29},{6280,0,1,703,40},{6284,0,1,776,49}],[]},{453,1653,463,[{6288,0,1,1270,190},{6288,0,1,1183,68},{6288,0,1,1159,216},{6292,0,1,1310,206},{6292,0,1,1220,118},{6292,0,1,1265,209},{6296,0,1,1266,53}],[]},{906,2106,916,[{6300,0,1,1721,90},{6300,0,1,1712,111},{6300,0,1,1721,14},{6304,0,1,1716,54},{6304,0,1,1799,243},{6304,0,1,1805,219},{6308,0,1,1688,210}],[]},{1359,2559,1369,[{6312,0,1,2094,181},{6312,0,1,2063,89},{6312,0,1,2198,29},{6312,0,1,2081,76},{6312,0,1,2139,146},{6316,0,1,2122,77}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30090)->
	#d_scene{
		scene_id		= 30090,			% 场景ID
		material_id	= 10109,			% 素材ID
		copy_id			= 30090,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6320,0,1,776,113},{6320,0,1,869,115},{6320,0,1,845,185},{6324,0,1,782,267},{6324,0,1,830,145},{6324,0,1,745,164},{6328,0,1,850,128}],[]},{453,1653,463,[{6332,0,1,1287,250},{6332,0,1,1210,104},{6332,0,1,1156,83},{6336,0,1,1350,214},{6336,0,1,1270,170},{6336,0,1,1207,143},{6340,0,1,1312,241}],[]},{906,2106,916,[{6344,0,1,1690,21},{6344,0,1,1697,196},{6344,0,1,1706,114},{6348,0,1,1796,276},{6348,0,1,1725,149},{6348,0,1,1730,25},{6352,0,1,1643,80}],[]},{1359,2559,1369,[{6356,0,1,2144,154},{6356,0,1,2171,219},{6360,0,1,2068,114},{6360,0,1,2071,88},{6360,0,1,2180,145},{6364,0,1,2179,93}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30100)->
	#d_scene{
		scene_id		= 30100,			% 场景ID
		material_id	= 10121,			% 素材ID
		copy_id			= 30100,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6368,0,1,816,121},{6368,0,1,847,46},{6368,0,1,712,69},{6372,0,1,852,267},{6372,0,1,770,192},{6372,0,1,859,10},{6376,0,1,859,136}],[]},{453,1653,463,[{6380,0,1,1335,265},{6380,0,1,1284,5},{6380,0,1,1286,271},{6384,0,1,1155,268},{6384,0,1,1168,83},{6384,0,1,1270,227},{6388,0,1,1162,16}],[]},{906,2106,916,[{6392,0,1,1689,143},{6392,0,1,1753,127},{6392,0,1,1671,21},{6396,0,1,1688,161},{6396,0,1,1759,163},{6396,0,1,1737,227},{6400,0,1,1690,224}],[]},{1359,2559,1369,[{6404,0,1,2206,54},{6404,0,1,2214,20},{6404,0,1,2109,267},{6408,0,1,2223,62},{6408,0,1,2096,67},{6412,0,1,2245,73}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30110)->
	#d_scene{
		scene_id		= 30110,			% 场景ID
		material_id	= 10143,			% 素材ID
		copy_id			= 30110,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6416,0,1,833,217},{6416,0,1,852,87},{6416,0,1,865,202},{6420,0,1,880,63},{6420,0,1,772,155},{6420,0,1,772,58},{6424,0,1,816,177}],[]},{453,1653,463,[{6428,0,1,1280,235},{6428,0,1,1282,119},{6428,0,1,1191,139},{6432,0,1,1348,216},{6432,0,1,1230,136},{6432,0,1,1263,189},{6436,0,1,1161,182}],[]},{906,2106,916,[{6440,0,1,1630,120},{6440,0,1,1761,101},{6440,0,1,1689,210},{6444,0,1,1694,202},{6444,0,1,1708,49},{6444,0,1,1662,25},{6448,0,1,1802,80}],[]},{1359,2559,1369,[{6452,0,1,2230,90},{6452,0,1,2219,49},{6452,0,1,2120,21},{6456,0,1,2158,127},{6456,0,1,2179,9},{6460,0,1,2123,38}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30120)->
	#d_scene{
		scene_id		= 30120,			% 场景ID
		material_id	= 10143,			% 素材ID
		copy_id			= 30120,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6464,0,1,826,246},{6464,0,1,866,142},{6464,0,1,822,49},{6468,0,1,881,82},{6468,0,1,821,153},{6468,0,1,854,183},{6472,0,1,838,194}],[]},{453,1653,463,[{6476,0,1,1255,145},{6476,0,1,1210,107},{6476,0,1,1224,248},{6480,0,1,1257,149},{6480,0,1,1247,9},{6480,0,1,1229,36},{6484,0,1,1284,40}],[]},{906,2106,916,[{6488,0,1,1626,157},{6488,0,1,1747,113},{6488,0,1,1691,86},{6492,0,1,1747,55},{6492,0,1,1615,226},{6492,0,1,1615,117},{6496,0,1,1754,193}],[]},{1359,2559,1369,[{6500,0,1,2153,222},{6500,0,1,2225,105},{6500,0,1,2152,89},{6504,0,1,2109,206},{6504,0,1,2168,138},{6508,0,1,2185,23}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30130)->
	#d_scene{
		scene_id		= 30130,			% 场景ID
		material_id	= 10143,			% 素材ID
		copy_id			= 30130,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6512,0,1,712,71},{6512,0,1,893,84},{6512,0,1,830,93},{6516,0,1,774,84},{6516,0,1,743,55},{6516,0,1,785,158},{6520,0,1,749,175}],[]},{453,1653,463,[{6524,0,1,1169,12},{6524,0,1,1184,63},{6524,0,1,1233,149},{6528,0,1,1211,214},{6528,0,1,1333,135},{6528,0,1,1231,1},{6532,0,1,1204,42}],[]},{906,2106,916,[{6536,0,1,1669,62},{6536,0,1,1782,34},{6536,0,1,1720,155},{6540,0,1,1729,177},{6540,0,1,1777,25},{6540,0,1,1685,210},{6544,0,1,1660,174}],[]},{1359,2559,1369,[{6548,0,1,2146,214},{6548,0,1,2103,187},{6548,0,1,2239,56},{6552,0,1,2256,247},{6552,0,1,2234,134},{6556,0,1,2190,117}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30140)->
	#d_scene{
		scene_id		= 30140,			% 场景ID
		material_id	= 10118,			% 素材ID
		copy_id			= 30140,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6560,0,1,823,218},{6560,0,1,774,14},{6560,0,1,802,14},{6564,0,1,775,116},{6564,0,1,760,247},{6564,0,1,703,166},{6568,0,1,823,136}],[]},{453,1653,463,[{6572,0,1,1216,251},{6572,0,1,1212,94},{6572,0,1,1218,91},{6576,0,1,1201,152},{6576,0,1,1294,69},{6576,0,1,1269,148},{6580,0,1,1352,238}],[]},{906,2106,916,[{6584,0,1,1760,104},{6584,0,1,1732,126},{6584,0,1,1706,34},{6588,0,1,1800,46},{6588,0,1,1724,174},{6588,0,1,1628,166},{6592,0,1,1754,199}],[]},{1359,2559,1369,[{6596,0,1,2159,147},{6596,0,1,2071,106},{6596,0,1,2083,38},{6600,0,1,2122,253},{6600,0,1,2180,71},{6604,0,1,2143,120}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30150)->
	#d_scene{
		scene_id		= 30150,			% 场景ID
		material_id	= 10118,			% 素材ID
		copy_id			= 30150,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6608,0,1,788,275},{6608,0,1,755,51},{6608,0,1,802,100},{6612,0,1,803,115},{6612,0,1,752,20},{6612,0,1,829,106},{6616,0,1,810,256}],[]},{453,1653,463,[{6620,0,1,1230,17},{6620,0,1,1175,43},{6620,0,1,1182,221},{6624,0,1,1206,41},{6624,0,1,1162,201},{6624,0,1,1322,151},{6628,0,1,1314,286}],[]},{906,2106,916,[{6632,0,1,1732,96},{6632,0,1,1662,199},{6632,0,1,1687,112},{6636,0,1,1648,255},{6636,0,1,1637,117},{6636,0,1,1728,160},{6640,0,1,1752,36}],[]},{1359,2559,1369,[{6644,0,1,2216,268},{6644,0,1,2119,66},{6644,0,1,2250,55},{6648,0,1,2143,106},{6648,0,1,2124,285},{6652,0,1,2175,153}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30160)->
	#d_scene{
		scene_id		= 30160,			% 场景ID
		material_id	= 10118,			% 素材ID
		copy_id			= 30160,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6656,0,1,707,230},{6656,0,1,844,71},{6656,0,1,889,136},{6660,0,1,845,116},{6660,0,1,747,175},{6660,0,1,811,134},{6664,0,1,830,223}],[]},{453,1653,463,[{6668,0,1,1174,15},{6668,0,1,1263,278},{6668,0,1,1199,101},{6672,0,1,1332,140},{6672,0,1,1200,247},{6672,0,1,1167,39},{6676,0,1,1346,242}],[]},{906,2106,916,[{6680,0,1,1654,193},{6680,0,1,1732,282},{6680,0,1,1691,17},{6684,0,1,1782,48},{6684,0,1,1656,177},{6684,0,1,1680,154},{6688,0,1,1790,159}],[]},{1359,2559,1369,[{6692,0,1,2140,220},{6692,0,1,2174,130},{6696,0,1,2069,12},{6696,0,1,2132,121},{6696,0,1,2133,184},{6700,0,1,2095,126}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30170)->
	#d_scene{
		scene_id		= 30170,			% 场景ID
		material_id	= 10112,			% 素材ID
		copy_id			= 30170,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6704,0,1,755,18},{6704,0,1,861,206},{6704,0,1,751,230},{6708,0,1,875,286},{6708,0,1,755,135},{6708,0,1,883,268},{6712,0,1,801,257}],[]},{453,1653,463,[{6716,0,1,1317,211},{6716,0,1,1333,45},{6716,0,1,1308,194},{6720,0,1,1336,242},{6720,0,1,1309,226},{6720,0,1,1248,214},{6724,0,1,1266,48}],[]},{906,2106,916,[{6728,0,1,1785,252},{6728,0,1,1683,280},{6728,0,1,1707,286},{6732,0,1,1696,226},{6732,0,1,1668,23},{6732,0,1,1782,168},{6736,0,1,1779,235}],[]},{1359,2559,1369,[{6740,0,1,2070,240},{6740,0,1,2105,80},{6744,0,1,2070,262},{6744,0,1,2257,77},{6744,0,1,2167,100},{6748,0,1,2102,59}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30180)->
	#d_scene{
		scene_id		= 30180,			% 场景ID
		material_id	= 10156,			% 素材ID
		copy_id			= 30180,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6752,0,1,818,240},{6752,0,1,718,57},{6752,0,1,827,129},{6756,0,1,758,234},{6756,0,1,762,273},{6756,0,1,780,222},{6760,0,1,862,171}],[]},{453,1653,463,[{6764,0,1,1286,164},{6764,0,1,1165,236},{6764,0,1,1165,43},{6768,0,1,1217,122},{6768,0,1,1238,240},{6768,0,1,1165,252},{6772,0,1,1201,15}],[]},{906,2106,916,[{6776,0,1,1634,188},{6776,0,1,1659,236},{6776,0,1,1649,64},{6780,0,1,1708,174},{6780,0,1,1728,29},{6780,0,1,1795,108},{6784,0,1,1676,12}],[]},{1359,2559,1369,[{6788,0,1,2141,261},{6788,0,1,2110,156},{6788,0,1,2068,228},{6792,0,1,2153,153},{6792,0,1,2135,42},{6796,0,1,2206,62}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30190)->
	#d_scene{
		scene_id		= 30190,			% 场景ID
		material_id	= 10157,			% 素材ID
		copy_id			= 30190,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6800,0,1,785,208},{6800,0,1,724,123},{6800,0,1,865,161},{6804,0,1,854,83},{6804,0,1,715,175},{6804,0,1,801,193},{6808,0,1,771,178}],[]},{453,1653,463,[{6812,0,1,1227,229},{6812,0,1,1186,140},{6812,0,1,1160,210},{6816,0,1,1322,83},{6816,0,1,1238,144},{6816,0,1,1154,187},{6820,0,1,1349,27}],[]},{906,2106,916,[{6824,0,1,1800,280},{6824,0,1,1744,193},{6824,0,1,1642,49},{6828,0,1,1800,195},{6828,0,1,1784,36},{6828,0,1,1637,76},{6832,0,1,1613,91}],[]},{1359,2559,1369,[{6836,0,1,2200,233},{6836,0,1,2077,230},{6836,0,1,2222,57},{6840,0,1,2080,175},{6840,0,1,2075,175},{6844,0,1,2152,265}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30200)->
	#d_scene{
		scene_id		= 30200,			% 场景ID
		material_id	= 10156,			% 素材ID
		copy_id			= 30200,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6848,0,1,822,70},{6848,0,1,763,27},{6848,0,1,701,268},{6852,0,1,847,120},{6852,0,1,792,129},{6852,0,1,872,116},{6856,0,1,842,106}],[]},{453,1653,463,[{6860,0,1,1199,20},{6860,0,1,1312,231},{6860,0,1,1220,118},{6864,0,1,1352,196},{6864,0,1,1252,234},{6864,0,1,1221,43},{6868,0,1,1335,144}],[]},{906,2106,916,[{6872,0,1,1676,270},{6872,0,1,1681,85},{6872,0,1,1650,217},{6876,0,1,1785,32},{6876,0,1,1787,175},{6876,0,1,1785,212},{6880,0,1,1672,151}],[]},{1359,2559,1369,[{6884,0,1,2218,121},{6884,0,1,2168,21},{6884,0,1,2071,234},{6888,0,1,2256,6},{6888,0,1,2191,268},{6892,0,1,2084,108}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30210)->
	#d_scene{
		scene_id		= 30210,			% 场景ID
		material_id	= 10157,			% 素材ID
		copy_id			= 30210,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6896,0,1,734,240},{6896,0,1,831,65},{6896,0,1,710,265},{6900,0,1,799,195},{6900,0,1,714,4},{6900,0,1,892,61},{6904,0,1,879,130}],[]},{453,1653,463,[{6908,0,1,1304,248},{6908,0,1,1205,101},{6908,0,1,1327,249},{6908,0,1,1237,173},{6908,0,1,1191,274},{6908,0,1,1205,6},{6912,0,1,1218,175}],[]},{906,2106,916,[{6916,0,1,1755,207},{6916,0,1,1643,17},{6916,0,1,1656,58},{6916,0,1,1802,52},{6916,0,1,1738,264},{6916,0,1,1661,75},{6920,0,1,1761,220}],[]},{1359,2559,1369,[{6924,0,1,2174,35},{6924,0,1,2114,249},{6928,0,1,2193,135},{6928,0,1,2173,68},{6928,0,1,2063,75},{6932,0,1,2250,16}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30220)->
	#d_scene{
		scene_id		= 30220,			% 场景ID
		material_id	= 10166,			% 素材ID
		copy_id			= 30220,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6936,0,1,845,78},{6936,0,1,883,16},{6936,0,1,820,145},{6940,0,1,876,130},{6940,0,1,867,240},{6940,0,1,715,169},{6944,0,1,802,230}],[]},{453,1653,463,[{6948,0,1,1182,196},{6948,0,1,1292,213},{6948,0,1,1253,287},{6952,0,1,1324,51},{6952,0,1,1286,81},{6952,0,1,1328,213},{6956,0,1,1232,29}],[]},{906,2106,916,[{6960,0,1,1741,90},{6960,0,1,1624,184},{6960,0,1,1716,169},{6964,0,1,1775,271},{6964,0,1,1649,44},{6964,0,1,1750,236},{6968,0,1,1671,247}],[]},{1359,2559,1369,[{6972,0,1,2176,108},{6972,0,1,2164,138},{6976,0,1,2177,225},{6976,0,1,2125,77},{6976,0,1,2233,76},{6980,0,1,2091,47}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30230)->
	#d_scene{
		scene_id		= 30230,			% 场景ID
		material_id	= 10158,			% 素材ID
		copy_id			= 30230,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{6984,0,1,805,279},{6984,0,1,779,87},{6984,0,1,835,68},{6988,0,1,839,96},{6988,0,1,710,275},{6988,0,1,755,196},{6992,0,1,900,111}],[]},{453,1653,463,[{6996,0,1,1297,75},{6996,0,1,1328,227},{6996,0,1,1246,37},{7000,0,1,1193,72},{7000,0,1,1353,5},{7000,0,1,1219,207},{7004,0,1,1211,92}],[]},{906,2106,916,[{7008,0,1,1702,269},{7008,0,1,1614,222},{7008,0,1,1621,183},{7012,0,1,1744,226},{7012,0,1,1688,221},{7012,0,1,1641,272},{7016,0,1,1671,21}],[]},{1359,2559,1369,[{7020,0,1,2092,255},{7020,0,1,2092,127},{7024,0,1,2245,136},{7024,0,1,2257,126},{7024,0,1,2213,207},{7028,0,1,2101,49}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30240)->
	#d_scene{
		scene_id		= 30240,			% 场景ID
		material_id	= 10163,			% 素材ID
		copy_id			= 30240,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{7032,0,1,855,148},{7032,0,1,777,73},{7032,0,1,853,62},{7036,0,1,840,159},{7036,0,1,738,250},{7036,0,1,864,172},{7040,0,1,714,121}],[]},{453,1653,463,[{7044,0,1,1309,119},{7044,0,1,1155,139},{7044,0,1,1276,225},{7048,0,1,1216,73},{7048,0,1,1276,95},{7048,0,1,1262,166},{7052,0,1,1285,40}],[]},{906,2106,916,[{7056,0,1,1761,246},{7056,0,1,1636,79},{7056,0,1,1752,66},{7060,0,1,1797,248},{7060,0,1,1776,235},{7060,0,1,1644,242},{7064,0,1,1629,206}],[]},{1359,2559,1369,[{7068,0,1,2151,237},{7068,0,1,2093,129},{7068,0,1,2135,156},{7072,0,1,2067,91},{7072,0,1,2205,21},{7076,0,1,2107,18}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30250)->
	#d_scene{
		scene_id		= 30250,			% 场景ID
		material_id	= 10160,			% 素材ID
		copy_id			= 30250,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{7080,0,1,855,255},{7080,0,1,860,125},{7080,0,1,837,73},{7084,0,1,717,89},{7084,0,1,749,114},{7084,0,1,767,167},{7088,0,1,786,219}],[]},{453,1653,463,[{7092,0,1,1278,175},{7092,0,1,1353,10},{7092,0,1,1263,15},{7096,0,1,1276,45},{7096,0,1,1252,117},{7096,0,1,1351,156},{7100,0,1,1304,75}],[]},{906,2106,916,[{7104,0,1,1672,225},{7104,0,1,1709,55},{7104,0,1,1784,127},{7108,0,1,1803,8},{7108,0,1,1801,221},{7108,0,1,1664,54},{7112,0,1,1695,179}],[]},{1359,2559,1369,[{7116,0,1,2096,171},{7116,0,1,2069,228},{7116,0,1,2070,127},{7120,0,1,2154,29},{7120,0,1,2079,95},{7124,0,1,2070,251}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30260)->
	#d_scene{
		scene_id		= 30260,			% 场景ID
		material_id	= 10159,			% 素材ID
		copy_id			= 30260,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{7128,0,1,204,161},{7128,0,1,724,102},{7128,0,1,598,43},{7132,0,1,668,56},{7132,0,1,616,222},{7132,0,1,586,252},{7136,0,1,462,163}],[]},{453,1653,463,[{7140,0,1,1155,228},{7140,0,1,1227,173},{7140,0,1,844,118},{7140,0,1,1067,20},{7140,0,1,736,247},{7140,0,1,831,229},{7144,0,1,1058,52}],[]},{906,2106,916,[{7148,0,1,1322,13},{7148,0,1,1420,86},{7148,0,1,1541,97},{7148,0,1,1761,191},{7148,0,1,1151,89},{7148,0,1,1375,149},{7152,0,1,1280,243}],[]},{1359,2559,1369,[{7156,0,1,2208,184},{7156,0,1,2214,126},{7156,0,1,1784,209},{7160,0,1,1605,26},{7160,0,1,2051,58},{7164,0,1,1816,201}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30270)->
	#d_scene{
		scene_id		= 30270,			% 场景ID
		material_id	= 10163,			% 素材ID
		copy_id			= 30270,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{7168,0,1,792,151},{7168,0,1,895,207},{7168,0,1,875,146},{7172,0,1,800,269},{7172,0,1,840,103},{7172,0,1,833,9},{7176,0,1,882,139}],[]},{453,1653,463,[{7180,0,1,1232,187},{7180,0,1,1214,308},{7180,0,1,1344,276},{7184,0,1,1331,295},{7184,0,1,1261,261},{7184,0,1,1261,141},{7188,0,1,1330,255}],[]},{906,2106,916,[{7192,0,1,1677,208},{7192,0,1,1676,1},{7192,0,1,1702,183},{7196,0,1,1709,211},{7196,0,1,1739,90},{7196,0,1,1689,137},{7200,0,1,1722,115}],[]},{1359,2559,1369,[{7204,0,1,2164,302},{7204,0,1,2154,82},{7208,0,1,2145,207},{7208,0,1,2188,290},{7208,0,1,2177,181},{7212,0,1,2157,56}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30280)->
	#d_scene{
		scene_id		= 30280,			% 场景ID
		material_id	= 10163,			% 素材ID
		copy_id			= 30280,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{7216,0,1,821,140},{7216,0,1,803,16},{7216,0,1,895,184},{7220,0,1,792,146},{7220,0,1,801,261},{7220,0,1,857,275},{7224,0,1,782,35}],[]},{453,1653,463,[{7228,0,1,1227,155},{7228,0,1,1329,211},{7228,0,1,1320,17},{7232,0,1,1238,185},{7232,0,1,1352,242},{7232,0,1,1230,188},{7236,0,1,1302,289}],[]},{906,2106,916,[{7240,0,1,1715,152},{7240,0,1,1779,281},{7240,0,1,1750,299},{7244,0,1,1679,277},{7244,0,1,1798,119},{7244,0,1,1803,125},{7248,0,1,1760,178}],[]},{1359,2559,1369,[{7252,0,1,2221,209},{7252,0,1,2188,2},{7256,0,1,2207,276},{7256,0,1,2159,142},{7256,0,1,2245,163},{7260,0,1,2179,59}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30290)->
	#d_scene{
		scene_id		= 30290,			% 场景ID
		material_id	= 10109,			% 素材ID
		copy_id			= 30290,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{7264,0,1,827,231},{7264,0,1,759,172},{7264,0,1,818,160},{7268,0,1,789,201},{7268,0,1,800,198},{7268,0,1,875,104},{7272,0,1,789,39}],[]},{453,1653,463,[{7276,0,1,1290,79},{7276,0,1,1263,276},{7276,0,1,1253,70},{7280,0,1,1216,95},{7280,0,1,1345,11},{7280,0,1,1343,61},{7284,0,1,1237,191}],[]},{906,2106,916,[{7288,0,1,1732,76},{7288,0,1,1674,211},{7288,0,1,1679,52},{7292,0,1,1660,55},{7292,0,1,1691,152},{7292,0,1,1755,227},{7296,0,1,1726,102}],[]},{1359,2559,1369,[{7300,0,1,2180,59},{7300,0,1,2226,57},{7304,0,1,2133,194},{7304,0,1,2144,258},{7304,0,1,2181,33},{7308,0,1,2217,256}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(30300)->
	#d_scene{
		scene_id		= 30300,			% 场景ID
		material_id	= 10109,			% 素材ID
		copy_id			= 30300,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 3,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{7312,0,1,688,174},{7312,0,1,825,220},{7312,0,1,359,243},{7316,0,1,782,37},{7316,0,1,260,23},{7316,0,1,372,61},{7320,0,1,252,162}],[]},{453,1653,463,[{7324,0,1,1078,4},{7324,0,1,972,23},{7324,0,1,1031,157},{7328,0,1,1293,132},{7328,0,1,823,270},{7328,0,1,886,122},{7332,0,1,1302,119}],[]},{906,2106,916,[{7336,0,1,1270,218},{7336,0,1,1163,62},{7336,0,1,1141,64},{7340,0,1,1382,191},{7340,0,1,1521,243},{7340,0,1,1660,170},{7344,0,1,1623,264}],[]},{1359,2559,1369,[{7348,0,1,1976,257},{7348,0,1,2221,193},{7352,0,1,1796,32},{7352,0,1,1915,24},{7352,0,1,1757,93},{7356,0,1,2203,232}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32010)->
	#d_scene{
		scene_id		= 32010,			% 场景ID
		material_id	= 10127,			% 素材ID
		copy_id			= 32010,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8000,0,1,736,31},{8000,0,1,822,178},{8004,0,1,817,139},{8004,0,1,859,51}],[]},{468,1668,478,[{8008,0,1,1228,115},{8008,0,1,1231,209},{8012,0,1,1208,253},{8012,0,1,1244,5}],[]},{936,2136,946,[{8016,0,1,1685,118},{8016,0,1,1705,163},{8020,0,1,1753,84},{8020,0,1,1697,63},{8024,0,1,1718,247}],[]},{1404,2604,1414,[{8028,0,1,2109,176},{8028,0,1,2260,215},{8028,0,1,2150,120},{8028,0,1,2193,249},{8032,0,1,2256,103}],[]},{1872,3072,1882,[{8036,0,1,2574,161},{8036,0,1,2769,223},{8040,0,1,2768,113},{8040,0,1,2689,13},{8044,0,1,2664,206}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32020)->
	#d_scene{
		scene_id		= 32020,			% 场景ID
		material_id	= 10115,			% 素材ID
		copy_id			= 32020,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8048,0,1,804,206},{8048,0,1,734,263},{8052,0,1,734,180},{8052,0,1,723,108}],[]},{468,1668,478,[{8056,0,1,1331,161},{8056,0,1,1193,233},{8060,0,1,1344,146},{8060,0,1,1188,200},{8064,0,1,1182,213}],[]},{936,2136,946,[{8068,0,1,1755,131},{8068,0,1,1739,69},{8068,0,1,1783,171},{8072,0,1,1763,126},{8076,0,1,1762,162}],[]},{1404,2604,1414,[{8080,0,1,2182,244},{8080,0,1,2228,168},{8080,0,1,2181,56},{8080,0,1,2119,107},{8084,0,1,2277,161}],[]},{1872,3072,1882,[{8088,0,1,2724,22},{8088,0,1,2759,235},{8092,0,1,2727,105},{8092,0,1,2623,120},{8096,0,1,2710,256}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32030)->
	#d_scene{
		scene_id		= 32030,			% 场景ID
		material_id	= 10115,			% 素材ID
		copy_id			= 32030,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8100,0,1,896,49},{8100,0,1,735,90},{8100,0,1,821,267},{8104,0,1,883,228},{8104,0,1,723,150},{8104,0,1,731,150}],[]},{468,1668,478,[{8108,0,1,1187,45},{8108,0,1,1186,87},{8108,0,1,1228,78},{8112,0,1,1317,155},{8112,0,1,1202,15},{8112,0,1,1281,263},{8116,0,1,1291,11}],[]},{936,2136,946,[{8120,0,1,1641,99},{8120,0,1,1731,59},{8124,0,1,1733,37},{8124,0,1,1637,93},{8120,0,1,1674,11},{8124,0,1,1739,124},{8128,0,1,1673,67}],[]},{1404,2604,1414,[{8132,0,1,2167,156},{8132,0,1,2233,83},{8132,0,1,2183,231},{8132,0,1,2200,13},{8132,0,1,2246,155},{8132,0,1,2225,21},{8136,0,1,2238,210}],[]},{1872,3072,1882,[{8140,0,1,2735,55},{8140,0,1,2648,76},{8140,0,1,2765,179},{8144,0,1,2670,187},{8144,0,1,2716,190},{8144,0,1,2718,39},{8148,0,1,2596,130}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32040)->
	#d_scene{
		scene_id		= 32040,			% 场景ID
		material_id	= 10115,			% 素材ID
		copy_id			= 32040,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8152,0,1,829,244},{8152,0,1,838,22},{8152,0,1,774,9},{8156,0,1,826,143},{8156,0,1,792,191},{8156,0,1,708,60}],[]},{468,1668,478,[{8160,0,1,1254,124},{8160,0,1,1201,161},{8160,0,1,1337,243},{8164,0,1,1175,187},{8164,0,1,1312,18},{8164,0,1,1251,34},{8168,0,1,1354,37}],[]},{936,2136,946,[{8172,0,1,1664,250},{8172,0,1,1834,118},{8172,0,1,1711,48},{8176,0,1,1762,164},{8176,0,1,1805,16},{8176,0,1,1701,201},{8180,0,1,1643,257}],[]},{1404,2604,1414,[{8184,0,1,2107,119},{8184,0,1,2301,226},{8184,0,1,2111,163},{8184,0,1,2122,1},{8184,0,1,2172,137},{8184,0,1,2140,159},{8188,0,1,2156,265}],[]},{1872,3072,1882,[{8192,0,1,2677,171},{8192,0,1,2624,123},{8192,0,1,2743,34},{8196,0,1,2688,96},{8196,0,1,2730,179},{8196,0,1,2615,258},{8200,0,1,2721,213}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32050)->
	#d_scene{
		scene_id		= 32050,			% 场景ID
		material_id	= 10109,			% 素材ID
		copy_id			= 32050,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8204,0,1,774,104},{8204,0,1,736,54},{8204,0,1,721,251},{8208,0,1,808,104},{8208,0,1,703,10},{8208,0,1,884,101}],[]},{468,1668,478,[{8212,0,1,1249,68},{8212,0,1,1269,221},{8212,0,1,1239,64},{8216,0,1,1227,124},{8216,0,1,1294,17},{8216,0,1,1190,101},{8220,0,1,1175,170}],[]},{936,2136,946,[{8224,0,1,1641,239},{8224,0,1,1664,85},{8228,0,1,1767,262},{8228,0,1,1677,109},{8224,0,1,1794,165},{8228,0,1,1716,186},{8232,0,1,1745,204}],[]},{1404,2604,1414,[{8236,0,1,2107,126},{8236,0,1,2250,136},{8236,0,1,2142,17},{8236,0,1,2273,191},{8236,0,1,2141,136},{8236,0,1,2198,61},{8240,0,1,2243,11}],[]},{1872,3072,1882,[{8244,0,1,2707,27},{8244,0,1,2769,72},{8244,0,1,2636,115},{8248,0,1,2671,151},{8248,0,1,2621,126},{8248,0,1,2603,133},{8252,0,1,2764,6}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32060)->
	#d_scene{
		scene_id		= 32060,			% 场景ID
		material_id	= 10109,			% 素材ID
		copy_id			= 32060,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8256,0,1,811,35},{8256,0,1,873,189},{8256,0,1,832,57},{8260,0,1,833,104},{8260,0,1,830,121},{8260,0,1,805,63}],[]},{468,1668,478,[{8264,0,1,1310,74},{8264,0,1,1260,41},{8264,0,1,1281,70},{8268,0,1,1183,221},{8268,0,1,1194,241},{8268,0,1,1232,190},{8272,0,1,1353,125}],[]},{936,2136,946,[{8276,0,1,1648,110},{8276,0,1,1724,7},{8280,0,1,1747,135},{8280,0,1,1772,255},{8276,0,1,1817,19},{8280,0,1,1722,189},{8284,0,1,1822,120}],[]},{1404,2604,1414,[{8288,0,1,2270,228},{8288,0,1,2262,218},{8288,0,1,2211,92},{8288,0,1,2271,136},{8288,0,1,2158,10},{8288,0,1,2186,48},{8292,0,1,2179,179}],[]},{1872,3072,1882,[{8296,0,1,2655,120},{8296,0,1,2585,243},{8296,0,1,2665,236},{8300,0,1,2603,165},{8300,0,1,2718,67},{8300,0,1,2759,19},{8304,0,1,2640,238}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32070)->
	#d_scene{
		scene_id		= 32070,			% 场景ID
		material_id	= 10109,			% 素材ID
		copy_id			= 32070,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8308,0,1,790,62},{8308,0,1,714,238},{8308,0,1,810,145},{8312,0,1,800,189},{8312,0,1,713,110},{8312,0,1,885,159}],[]},{468,1668,478,[{8316,0,1,1169,240},{8316,0,1,1335,137},{8316,0,1,1338,164},{8320,0,1,1218,241},{8320,0,1,1365,119},{8320,0,1,1226,124},{8324,0,1,1281,72}],[]},{936,2136,946,[{8328,0,1,1797,192},{8328,0,1,1779,233},{8332,0,1,1777,46},{8332,0,1,1689,235},{8328,0,1,1831,193},{8332,0,1,1771,160},{8336,0,1,1691,206}],[]},{1404,2604,1414,[{8340,0,1,2232,138},{8340,0,1,2202,42},{8340,0,1,2142,235},{8340,0,1,2216,159},{8340,0,1,2121,192},{8340,0,1,2252,71},{8344,0,1,2251,33}],[]},{1872,3072,1882,[{8348,0,1,2620,21},{8348,0,1,2730,100},{8348,0,1,2592,105},{8352,0,1,2640,111},{8352,0,1,2606,221},{8352,0,1,2624,37},{8356,0,1,2745,131}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32080)->
	#d_scene{
		scene_id		= 32080,			% 场景ID
		material_id	= 10121,			% 素材ID
		copy_id			= 32080,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8360,0,1,819,110},{8360,0,1,805,231},{8360,0,1,799,138},{8364,0,1,712,256},{8364,0,1,771,194},{8364,0,1,749,44}],[]},{468,1668,478,[{8368,0,1,1202,252},{8368,0,1,1357,221},{8368,0,1,1334,61},{8372,0,1,1301,98},{8372,0,1,1253,41},{8372,0,1,1367,87},{8376,0,1,1361,140}],[]},{936,2136,946,[{8380,0,1,1652,77},{8380,0,1,1791,231},{8384,0,1,1657,63},{8384,0,1,1670,76},{8380,0,1,1716,21},{8384,0,1,1777,201},{8388,0,1,1826,182}],[]},{1404,2604,1414,[{8392,0,1,2138,171},{8392,0,1,2270,85},{8392,0,1,2301,254},{8392,0,1,2265,227},{8392,0,1,2141,34},{8392,0,1,2173,123},{8396,0,1,2296,88}],[]},{1872,3072,1882,[{8400,0,1,2725,14},{8400,0,1,2590,53},{8400,0,1,2648,196},{8404,0,1,2697,252},{8404,0,1,2620,243},{8404,0,1,2579,25},{8408,0,1,2576,103}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32090)->
	#d_scene{
		scene_id		= 32090,			% 场景ID
		material_id	= 10155,			% 素材ID
		copy_id			= 32090,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8412,0,1,791,206},{8412,0,1,860,224},{8412,0,1,784,39},{8416,0,1,885,190},{8416,0,1,754,104},{8416,0,1,727,153}],[]},{468,1668,478,[{8420,0,1,1192,187},{8420,0,1,1181,59},{8420,0,1,1257,182},{8424,0,1,1270,266},{8424,0,1,1220,98},{8424,0,1,1214,161},{8428,0,1,1220,278}],[]},{936,2136,946,[{8432,0,1,1813,164},{8432,0,1,1772,65},{8436,0,1,1789,152},{8436,0,1,1693,72},{8432,0,1,1722,161},{8436,0,1,1703,257},{8440,0,1,1690,235}],[]},{1404,2604,1414,[{8444,0,1,2249,93},{8444,0,1,2231,225},{8444,0,1,2253,143},{8444,0,1,2233,104},{8444,0,1,2202,58},{8444,0,1,2111,9},{8448,0,1,2161,210}],[]},{1872,3072,1882,[{8452,0,1,2737,105},{8456,0,1,2674,51}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32100)->
	#d_scene{
		scene_id		= 32100,			% 场景ID
		material_id	= 10155,			% 素材ID
		copy_id			= 32100,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8460,0,1,861,241},{8460,0,1,860,95},{8460,0,1,756,222},{8464,0,1,849,177},{8464,0,1,780,122},{8464,0,1,840,122}],[]},{468,1668,478,[{8468,0,1,1353,18},{8468,0,1,1361,152},{8468,0,1,1325,91},{8472,0,1,1264,94},{8472,0,1,1219,182},{8472,0,1,1361,220},{8476,0,1,1328,138}],[]},{936,2136,946,[{8480,0,1,1730,272},{8480,0,1,1826,135},{8484,0,1,1721,212},{8484,0,1,1692,10},{8480,0,1,1716,58},{8484,0,1,1820,40},{8488,0,1,1709,214}],[]},{1404,2604,1414,[{8492,0,1,2275,167},{8492,0,1,2241,279},{8492,0,1,2205,136},{8492,0,1,2259,146},{8492,0,1,2205,271},{8492,0,1,2159,127},{8496,0,1,2158,203}],[]},{1872,3072,1882,[{8500,0,1,2723,62},{8504,0,1,2627,182}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32110)->
	#d_scene{
		scene_id		= 32110,			% 场景ID
		material_id	= 10118,			% 素材ID
		copy_id			= 32110,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8508,0,1,894,189},{8508,0,1,761,236},{8508,0,1,650,254},{8512,0,1,748,26},{8512,0,1,578,142},{8512,0,1,465,108}],[]},{468,1668,478,[{8516,0,1,1209,132},{8516,0,1,1279,174},{8516,0,1,802,277},{8520,0,1,843,265},{8520,0,1,738,238},{8520,0,1,775,11},{8524,0,1,1134,243}],[]},{936,2136,946,[{8528,0,1,1452,188},{8528,0,1,1522,207},{8532,0,1,1398,229},{8532,0,1,1569,73},{8528,0,1,1769,58},{8532,0,1,1668,43},{8536,0,1,1502,199}],[]},{1404,2604,1414,[{8540,0,1,1900,17},{8540,0,1,1942,185},{8540,0,1,1928,278},{8540,0,1,2142,221},{8540,0,1,1862,181},{8540,0,1,2264,28},{8544,0,1,1734,55}],[]},{1872,3072,1882,[{8548,0,1,2763,205},{8552,0,1,2335,73}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32120)->
	#d_scene{
		scene_id		= 32120,			% 场景ID
		material_id	= 10118,			% 素材ID
		copy_id			= 32120,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8556,0,1,896,186},{8556,0,1,888,227},{8556,0,1,830,99},{8560,0,1,772,218},{8560,0,1,895,92},{8560,0,1,855,9}],[]},{468,1668,478,[{8564,0,1,1228,67},{8564,0,1,1330,132},{8564,0,1,1254,231},{8568,0,1,1310,196},{8568,0,1,1239,123},{8568,0,1,1262,193},{8572,0,1,1271,145}],[]},{936,2136,946,[{8576,0,1,1694,237},{8576,0,1,1815,216},{8580,0,1,1722,234},{8580,0,1,1764,63},{8576,0,1,1709,26},{8580,0,1,1753,66},{8584,0,1,1836,45}],[]},{1404,2604,1414,[{8588,0,1,2289,20},{8588,0,1,2204,168},{8588,0,1,2170,102},{8588,0,1,2278,19},{8588,0,1,2218,2},{8588,0,1,2238,110},{8592,0,1,2295,245}],[]},{1872,3072,1882,[{8596,0,1,2768,159},{8600,0,1,2687,38}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32130)->
	#d_scene{
		scene_id		= 32130,			% 场景ID
		material_id	= 10112,			% 素材ID
		copy_id			= 32130,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8604,0,1,805,194},{8604,0,1,817,187},{8604,0,1,754,23},{8608,0,1,860,68},{8608,0,1,824,191},{8608,0,1,882,184}],[]},{468,1668,478,[{8612,0,1,1276,232},{8612,0,1,1252,13},{8612,0,1,1361,15},{8616,0,1,1294,79},{8616,0,1,1243,177},{8616,0,1,1367,228},{8620,0,1,1291,200}],[]},{936,2136,946,[{8624,0,1,1746,35},{8624,0,1,1797,244},{8628,0,1,1826,6},{8628,0,1,1817,101},{8624,0,1,1732,22},{8624,0,1,1747,222},{8632,0,1,1821,121}],[]},{1404,2604,1414,[{8636,0,1,2227,57},{8636,0,1,2226,185},{8636,0,1,2248,233},{8636,0,1,2197,235},{8636,0,1,2220,140},{8636,0,1,2220,143},{8640,0,1,2228,178}],[]},{1872,3072,1882,[{8644,0,1,2631,228},{8648,0,1,2665,222}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32140)->
	#d_scene{
		scene_id		= 32140,			% 场景ID
		material_id	= 10156,			% 素材ID
		copy_id			= 32140,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8652,0,1,770,179},{8652,0,1,769,107},{8652,0,1,756,24},{8656,0,1,882,157},{8656,0,1,798,228},{8656,0,1,871,30}],[]},{468,1668,478,[{8660,0,1,1272,217},{8660,0,1,1228,205},{8660,0,1,1242,77},{8664,0,1,1282,216},{8664,0,1,1355,163},{8664,0,1,1347,113},{8668,0,1,1314,31}],[]},{936,2136,946,[{8672,0,1,1705,184},{8672,0,1,1831,138},{8676,0,1,1776,11},{8676,0,1,1693,114},{8672,0,1,1793,109},{8676,0,1,1823,3},{8680,0,1,1799,95}],[]},{1404,2604,1414,[{8684,0,1,2162,40},{8684,0,1,2303,123},{8684,0,1,2264,189},{8684,0,1,2246,197},{8684,0,1,2251,228},{8684,0,1,2267,199},{8688,0,1,2238,153}],[]},{1872,3072,1882,[{8692,0,1,2718,177},{8696,0,1,2702,113}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32150)->
	#d_scene{
		scene_id		= 32150,			% 场景ID
		material_id	= 10157,			% 素材ID
		copy_id			= 32150,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8700,0,1,255,278},{8700,0,1,421,56},{8700,0,1,830,57},{8700,0,1,714,224},{8700,0,1,825,78}],[]},{468,1668,478,[{8704,0,1,825,142},{8704,0,1,1068,186},{8704,0,1,1127,110},{8704,0,1,1083,215},{8704,0,1,753,277},{8708,0,1,816,33}],[]},{936,2136,946,[{8712,0,1,1814,131},{8712,0,1,1818,272},{8712,0,1,1221,85},{8712,0,1,1696,193},{8712,0,1,1549,56},{8716,0,1,1442,287}],[]},{1404,2604,1414,[{8720,0,1,1679,18},{8720,0,1,2266,288},{8720,0,1,2250,103},{8720,0,1,1658,229},{8720,0,1,1755,201},{8724,0,1,2072,134}],[]},{1872,3072,1882,[{8728,0,1,2079,129},{8732,0,1,2337,89}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32160)->
	#d_scene{
		scene_id		= 32160,			% 场景ID
		material_id	= 10156,			% 素材ID
		copy_id			= 32160,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8736,0,1,524,163},{8736,0,1,893,139},{8736,0,1,804,172},{8740,0,1,510,205},{8740,0,1,675,265},{8740,0,1,505,38}],[]},{468,1668,478,[{8744,0,1,1340,25},{8744,0,1,836,179},{8744,0,1,1129,279},{8748,0,1,1330,217},{8748,0,1,1211,98},{8748,0,1,1294,272},{8752,0,1,921,108}],[]},{936,2136,946,[{8756,0,1,1643,132},{8756,0,1,1240,244},{8760,0,1,1230,25},{8760,0,1,1783,226},{8756,0,1,1682,5},{8760,0,1,1683,146},{8764,0,1,1810,188}],[]},{1404,2604,1414,[{8768,0,1,1996,195},{8768,0,1,1837,232},{8768,0,1,2108,274},{8768,0,1,1956,166},{8768,0,1,2178,189},{8768,0,1,2032,234},{8772,0,1,2072,197}],[]},{1872,3072,1882,[{8776,0,1,2742,77},{8780,0,1,2204,90}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32170)->
	#d_scene{
		scene_id		= 32170,			% 场景ID
		material_id	= 10166,			% 素材ID
		copy_id			= 32170,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8784,0,1,846,73},{8784,0,1,827,117},{8784,0,1,886,84},{8788,0,1,773,127},{8788,0,1,774,202},{8788,0,1,848,8}],[]},{468,1668,478,[{8792,0,1,1319,150},{8792,0,1,1300,57},{8792,0,1,1325,198},{8796,0,1,1282,186},{8796,0,1,1269,42},{8796,0,1,1252,271},{8800,0,1,1314,287}],[]},{936,2136,946,[{8804,0,1,1819,195},{8804,0,1,1786,12},{8808,0,1,1766,43},{8808,0,1,1716,234},{8804,0,1,1747,80},{8804,0,1,1812,29},{8812,0,1,1708,127}],[]},{1404,2604,1414,[{8816,0,1,2291,132},{8816,0,1,2262,191},{8816,0,1,2206,207},{8816,0,1,2228,281},{8816,0,1,2271,160},{8816,0,1,2278,203},{8820,0,1,2254,263}],[]},{1872,3072,1882,[{8824,0,1,2667,63},{8828,0,1,2721,52}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32180)->
	#d_scene{
		scene_id		= 32180,			% 场景ID
		material_id	= 10158,			% 素材ID
		copy_id			= 32180,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8832,0,1,874,162},{8832,0,1,771,264},{8832,0,1,790,137},{8836,0,1,891,52},{8836,0,1,875,56},{8836,0,1,878,154}],[]},{468,1668,478,[{8840,0,1,1315,7},{8840,0,1,1363,90},{8840,0,1,1278,190},{8844,0,1,1294,130},{8844,0,1,1362,85},{8844,0,1,1367,45},{8848,0,1,1311,85}],[]},{936,2136,946,[{8852,0,1,1702,236},{8852,0,1,1827,40},{8856,0,1,1798,63},{8856,0,1,1703,248},{8852,0,1,1829,153},{8856,0,1,1775,109},{8860,0,1,1821,161}],[]},{1404,2604,1414,[{8864,0,1,2229,251},{8864,0,1,2155,65},{8864,0,1,2244,87},{8864,0,1,2293,72},{8864,0,1,2215,127},{8864,0,1,2156,196},{8868,0,1,2191,200}],[]},{1872,3072,1882,[{8872,0,1,2691,98},{8876,0,1,2726,8}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32190)->
	#d_scene{
		scene_id		= 32190,			% 场景ID
		material_id	= 10163,			% 素材ID
		copy_id			= 32190,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8880,0,1,754,93},{8880,0,1,761,226},{8880,0,1,886,44},{8884,0,1,819,88},{8884,0,1,848,98},{8884,0,1,875,172}],[]},{468,1668,478,[{8888,0,1,1336,63},{8888,0,1,1330,31},{8888,0,1,1358,180},{8892,0,1,1243,22},{8892,0,1,1306,64},{8892,0,1,1219,279},{8896,0,1,1328,97}],[]},{936,2136,946,[{8900,0,1,1719,211},{8900,0,1,1786,238},{8904,0,1,1720,69},{8904,0,1,1826,10},{8900,0,1,1826,154},{8904,0,1,1828,127},{8908,0,1,1766,127}],[]},{1404,2604,1414,[{8912,0,1,2209,58},{8912,0,1,2246,15},{8912,0,1,2219,43},{8912,0,1,2245,235},{8912,0,1,2162,176},{8912,0,1,2219,236},{8916,0,1,2280,29}],[]},{1872,3072,1882,[{8920,0,1,2758,157},{8924,0,1,2724,133}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32200)->
	#d_scene{
		scene_id		= 32200,			% 场景ID
		material_id	= 10160,			% 素材ID
		copy_id			= 32200,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8928,0,1,875,155},{8928,0,1,861,17},{8928,0,1,850,153},{8932,0,1,827,196},{8932,0,1,761,169},{8932,0,1,863,10}],[]},{468,1668,478,[{8936,0,1,1341,73},{8936,0,1,1293,141},{8936,0,1,1224,195},{8940,0,1,1234,55},{8940,0,1,1320,254},{8940,0,1,1275,259},{8944,0,1,1232,29}],[]},{936,2136,946,[{8948,0,1,1718,220},{8948,0,1,1799,69},{8952,0,1,1726,177},{8952,0,1,1755,186},{8948,0,1,1789,177},{8952,0,1,1826,13},{8956,0,1,1738,137}],[]},{1404,2604,1414,[{8960,0,1,2302,71},{8960,0,1,2303,170},{8960,0,1,2299,60},{8960,0,1,2256,23},{8960,0,1,2178,11},{8960,0,1,2194,115},{8964,0,1,2182,47}],[]},{1872,3072,1882,[{8968,0,1,2753,126},{8972,0,1,2751,181}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32210)->
	#d_scene{
		scene_id		= 32210,			% 场景ID
		material_id	= 10163,			% 素材ID
		copy_id			= 32210,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{8976,0,1,887,241},{8976,0,1,866,155},{8976,0,1,297,204},{8980,0,1,582,103},{8980,0,1,275,215},{8980,0,1,798,119}],[]},{468,1668,478,[{8984,0,1,829,278},{8984,0,1,1241,156},{8984,0,1,796,226},{8988,0,1,1072,253},{8988,0,1,1087,154},{8988,0,1,1078,88},{8992,0,1,792,121}],[]},{936,2136,946,[{8996,0,1,1240,20},{8996,0,1,1764,24},{9000,0,1,1288,198},{9000,0,1,1729,30},{8996,0,1,1674,120},{9000,0,1,1663,105},{9004,0,1,1363,3}],[]},{1404,2604,1414,[{9008,0,1,1773,208},{9008,0,1,1725,171},{9008,0,1,2069,118},{9008,0,1,1933,244},{9008,0,1,2118,283},{9008,0,1,2088,194},{9012,0,1,1630,281}],[]},{1872,3072,1882,[{9016,0,1,2289,145},{9020,0,1,2671,129}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32220)->
	#d_scene{
		scene_id		= 32220,			% 场景ID
		material_id	= 10163,			% 素材ID
		copy_id			= 32220,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{9024,0,1,783,226},{9024,0,1,813,128},{9024,0,1,860,66},{9028,0,1,796,97},{9028,0,1,849,250},{9028,0,1,811,77}],[]},{468,1668,478,[{9032,0,1,1294,61},{9032,0,1,1233,248},{9032,0,1,1368,82},{9036,0,1,1287,86},{9036,0,1,1272,113},{9036,0,1,1342,109},{9040,0,1,1342,33}],[]},{936,2136,946,[{9044,0,1,1742,248},{9044,0,1,1746,75},{9048,0,1,1822,64},{9048,0,1,1792,109},{9044,0,1,1791,194},{9048,0,1,1706,10},{9052,0,1,1706,113}],[]},{1404,2604,1414,[{9056,0,1,2246,134},{9056,0,1,2248,127},{9056,0,1,2274,68},{9056,0,1,2236,63},{9056,0,1,2162,277},{9056,0,1,2188,262},{9060,0,1,2170,201}],[]},{1872,3072,1882,[{9064,0,1,2634,128},{9068,0,1,2705,22}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32230)->
	#d_scene{
		scene_id		= 32230,			% 场景ID
		material_id	= 10109,			% 素材ID
		copy_id			= 32230,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{9072,0,1,798,241},{9072,0,1,812,84},{9072,0,1,899,87},{9076,0,1,873,252},{9076,0,1,766,191},{9076,0,1,884,131}],[]},{468,1668,478,[{9080,0,1,1300,177},{9080,0,1,1309,135},{9080,0,1,1220,276},{9084,0,1,1305,230},{9084,0,1,1302,4},{9084,0,1,1304,157},{9088,0,1,1279,116}],[]},{936,2136,946,[{9092,0,1,1835,49},{9092,0,1,1722,182},{9096,0,1,1739,139},{9096,0,1,1745,56},{9092,0,1,1818,140},{9096,0,1,1820,122},{9100,0,1,1723,131}],[]},{1404,2604,1414,[{9104,0,1,2249,55},{9104,0,1,2199,20},{9104,0,1,2178,191},{9104,0,1,2163,166},{9104,0,1,2241,251},{9104,0,1,2195,196},{9108,0,1,2195,5}],[]},{1872,3072,1882,[{9112,0,1,2683,260},{9116,0,1,2640,231}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(32240)->
	#d_scene{
		scene_id		= 32240,			% 场景ID
		material_id	= 10109,			% 素材ID
		copy_id			= 32240,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 4,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 1, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{9120,0,1,539,63},{9120,0,1,698,3},{9120,0,1,321,244},{9124,0,1,611,195},{9124,0,1,277,241},{9124,0,1,535,198}],[]},{468,1668,478,[{9128,0,1,937,92},{9128,0,1,1236,201},{9128,0,1,1073,6},{9132,0,1,879,22},{9132,0,1,1065,148},{9132,0,1,944,225},{9136,0,1,863,131}],[]},{936,2136,946,[{9140,0,1,1509,181},{9140,0,1,1440,255},{9144,0,1,1648,63},{9144,0,1,1564,63},{9140,0,1,1710,163},{9144,0,1,1672,28},{9148,0,1,1474,26}],[]},{1404,2604,1414,[{9152,0,1,2028,85},{9152,0,1,2301,242},{9152,0,1,2282,70},{9152,0,1,1823,206},{9152,0,1,1750,88},{9152,0,1,2299,89},{9156,0,1,1615,200}],[]},{1872,3072,1882,[{9160,0,1,2485,73},{9164,0,1,2347,244}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(34010)->
	#d_scene{
		scene_id		= 34010,			% 场景ID
		material_id	= 10123,			% 素材ID
		copy_id			= 34010,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{35000,0,1,842,145}],[]},{424,1624,434,[{35004,0,1,1185,210}],[]},{848,2048,858,[{35008,0,1,1711,192}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(34020)->
	#d_scene{
		scene_id		= 34020,			% 场景ID
		material_id	= 10116,			% 素材ID
		copy_id			= 34020,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{35012,0,1,873,214}],[]},{424,1624,434,[{35016,0,1,1299,16}],[]},{848,2048,858,[{35020,0,1,1653,208}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(34030)->
	#d_scene{
		scene_id		= 34030,			% 场景ID
		material_id	= 10110,			% 素材ID
		copy_id			= 34030,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{35024,0,1,794,82}],[]},{424,1624,434,[{35028,0,1,1177,77}],[]},{848,2048,858,[{35032,0,1,1666,267}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(34040)->
	#d_scene{
		scene_id		= 34040,			% 场景ID
		material_id	= 10104,			% 素材ID
		copy_id			= 34040,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{35036,0,1,840,265}],[]},{424,1624,434,[{35040,0,1,1146,270}],[]},{848,2048,858,[{35044,0,1,1664,28}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(34050)->
	#d_scene{
		scene_id		= 34050,			% 场景ID
		material_id	= 10108,			% 素材ID
		copy_id			= 34050,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{35048,0,1,757,13}],[]},{424,1624,434,[{35052,0,1,1185,257}],[]},{848,2048,858,[{35056,0,1,1604,44}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(34060)->
	#d_scene{
		scene_id		= 34060,			% 场景ID
		material_id	= 10111,			% 素材ID
		copy_id			= 34060,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{35060,0,1,783,108}],[]},{424,1624,434,[{35064,0,1,1251,54}],[]},{848,2048,858,[{35068,0,1,1565,120}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(34070)->
	#d_scene{
		scene_id		= 34070,			% 场景ID
		material_id	= 10114,			% 素材ID
		copy_id			= 34070,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{35072,0,1,858,99}],[]},{424,1624,434,[{35076,0,1,1251,164}],[]},{848,2048,858,[{35080,0,1,1661,181}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(34080)->
	#d_scene{
		scene_id		= 34080,			% 场景ID
		material_id	= 10117,			% 素材ID
		copy_id			= 34080,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{35084,0,1,705,142}],[]},{424,1624,434,[{35088,0,1,1260,131}],[]},{848,2048,858,[{35092,0,1,1619,106}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(34090)->
	#d_scene{
		scene_id		= 34090,			% 场景ID
		material_id	= 10120,			% 素材ID
		copy_id			= 34090,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{35096,0,1,749,275}],[]},{424,1624,434,[{35100,0,1,1197,138}],[]},{848,2048,858,[{35104,0,1,1600,177}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(34100)->
	#d_scene{
		scene_id		= 34100,			% 场景ID
		material_id	= 10124,			% 素材ID
		copy_id			= 34100,			% 副本ID
		lv				= 0,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,400,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{35108,0,1,888,184}],[]},{424,1624,434,[{35112,0,1,1146,220}],[]},{848,2048,858,[{35116,0,1,1668,234}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40100)->
	#d_scene{
		scene_id		= 40100,			% 场景ID
		material_id	= 40001,			% 素材ID
		copy_id			= 40100,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,1,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25001,0,1,885,234},{25005,0,1,808,261},{25005,0,1,826,266},{25005,0,1,818,211},{25005,0,1,797,22},{25009,0,1,882,157},{25009,0,1,880,219},{25009,0,1,866,250},{25009,0,1,758,223}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40101)->
	#d_scene{
		scene_id		= 40101,			% 场景ID
		material_id	= 40002,			% 素材ID
		copy_id			= 40100,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,1,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26001,0,1,853,71},{26005,0,1,811,217},{26005,0,1,873,30},{26005,0,1,812,105},{26009,0,1,825,267},{26009,0,1,787,192},{26009,0,1,796,131}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40102)->
	#d_scene{
		scene_id		= 40102,			% 场景ID
		material_id	= 40003,			% 素材ID
		copy_id			= 40100,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27001,0,1,882,160}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40110)->
	#d_scene{
		scene_id		= 40110,			% 场景ID
		material_id	= 40004,			% 素材ID
		copy_id			= 40110,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,1,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25013,0,1,758,244},{25017,0,1,899,71},{25017,0,1,831,93},{25017,0,1,782,55},{25017,0,1,770,164},{25021,0,1,838,232},{25021,0,1,764,55},{25021,0,1,846,125},{25021,0,1,793,226}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40111)->
	#d_scene{
		scene_id		= 40111,			% 场景ID
		material_id	= 40005,			% 素材ID
		copy_id			= 40110,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,1,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26013,0,1,779,20},{26017,0,1,896,28},{26017,0,1,888,208},{26017,0,1,826,234},{26021,0,1,867,5},{26021,0,1,835,141},{26021,0,1,830,223}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40112)->
	#d_scene{
		scene_id		= 40112,			% 场景ID
		material_id	= 40006,			% 素材ID
		copy_id			= 40110,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27005,0,1,898,142}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40120)->
	#d_scene{
		scene_id		= 40120,			% 场景ID
		material_id	= 40007,			% 素材ID
		copy_id			= 40120,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,1,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25025,0,1,478,214},{25029,0,1,765,165},{25029,0,1,450,159},{25029,0,1,663,158},{25029,0,1,242,228},{25033,0,1,242,42},{25033,0,1,422,119},{25033,0,1,497,232},{25033,0,1,240,243}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40121)->
	#d_scene{
		scene_id		= 40121,			% 场景ID
		material_id	= 40008,			% 素材ID
		copy_id			= 40120,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,1,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26025,0,1,641,43},{26029,0,1,576,260},{26029,0,1,663,157},{26029,0,1,882,212},{26033,0,1,228,41},{26033,0,1,479,100},{26033,0,1,884,148}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40122)->
	#d_scene{
		scene_id		= 40122,			% 场景ID
		material_id	= 40009,			% 素材ID
		copy_id			= 40120,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27009,0,1,783,120}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40130)->
	#d_scene{
		scene_id		= 40130,			% 场景ID
		material_id	= 40010,			% 素材ID
		copy_id			= 40130,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,1,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25037,0,1,868,10},{25041,0,1,771,181},{25041,0,1,790,228},{25041,0,1,782,62},{25041,0,1,826,168},{25045,0,1,842,28},{25045,0,1,892,104},{25045,0,1,803,11},{25045,0,1,884,134}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40131)->
	#d_scene{
		scene_id		= 40131,			% 场景ID
		material_id	= 40011,			% 素材ID
		copy_id			= 40130,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,1,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26037,0,1,852,130},{26041,0,1,778,36},{26041,0,1,868,86},{26041,0,1,819,58},{26045,0,1,765,263},{26045,0,1,893,167},{26045,0,1,828,17}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40132)->
	#d_scene{
		scene_id		= 40132,			% 场景ID
		material_id	= 40012,			% 素材ID
		copy_id			= 40130,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27013,0,1,834,60}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40140)->
	#d_scene{
		scene_id		= 40140,			% 场景ID
		material_id	= 40013,			% 素材ID
		copy_id			= 40140,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,2,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25049,0,1,788,150},{25053,0,1,757,220},{25053,0,1,821,148},{25053,0,1,807,40},{25053,0,1,860,60},{25057,0,1,782,88},{25057,0,1,814,201},{25057,0,1,768,118},{25057,0,1,874,155}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40141)->
	#d_scene{
		scene_id		= 40141,			% 场景ID
		material_id	= 40014,			% 素材ID
		copy_id			= 40140,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,2,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26049,0,1,788,74},{26053,0,1,788,168},{26053,0,1,790,6},{26053,0,1,879,126},{26057,0,1,899,94},{26057,0,1,852,244},{26057,0,1,789,8}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40142)->
	#d_scene{
		scene_id		= 40142,			% 场景ID
		material_id	= 40015,			% 素材ID
		copy_id			= 40140,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27017,0,1,797,202}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40150)->
	#d_scene{
		scene_id		= 40150,			% 场景ID
		material_id	= 40016,			% 素材ID
		copy_id			= 40150,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,2,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25061,0,1,761,163},{25065,0,1,826,179},{25065,0,1,803,165},{25065,0,1,775,236},{25065,0,1,806,212},{25069,0,1,775,130},{25069,0,1,756,195},{25069,0,1,877,77},{25069,0,1,814,134}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40151)->
	#d_scene{
		scene_id		= 40151,			% 场景ID
		material_id	= 40017,			% 素材ID
		copy_id			= 40150,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,2,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26061,0,1,831,260},{26065,0,1,798,176},{26065,0,1,804,255},{26065,0,1,798,28},{26069,0,1,753,95},{26069,0,1,793,28},{26069,0,1,835,94}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40152)->
	#d_scene{
		scene_id		= 40152,			% 场景ID
		material_id	= 40018,			% 素材ID
		copy_id			= 40150,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27021,0,1,851,151}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40160)->
	#d_scene{
		scene_id		= 40160,			% 场景ID
		material_id	= 40019,			% 素材ID
		copy_id			= 40160,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,2,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25073,0,1,884,25},{25077,0,1,747,12},{25077,0,1,877,260},{25077,0,1,683,179},{25077,0,1,326,46},{25081,0,1,877,181},{25081,0,1,820,34},{25081,0,1,306,71},{25081,0,1,223,85}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40161)->
	#d_scene{
		scene_id		= 40161,			% 场景ID
		material_id	= 40020,			% 素材ID
		copy_id			= 40160,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,2,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26073,0,1,868,102},{26077,0,1,347,210},{26077,0,1,575,189},{26077,0,1,357,249},{26081,0,1,720,96},{26081,0,1,713,92},{26081,0,1,237,56}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40162)->
	#d_scene{
		scene_id		= 40162,			% 场景ID
		material_id	= 40021,			% 素材ID
		copy_id			= 40160,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27025,0,1,459,213}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40170)->
	#d_scene{
		scene_id		= 40170,			% 场景ID
		material_id	= 40022,			% 素材ID
		copy_id			= 40170,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,2,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25085,0,1,691,217},{25089,0,1,261,213},{25089,0,1,769,53},{25089,0,1,273,163},{25089,0,1,254,162},{25093,0,1,524,246},{25093,0,1,336,78},{25093,0,1,625,65},{25093,0,1,420,25}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40171)->
	#d_scene{
		scene_id		= 40171,			% 场景ID
		material_id	= 40023,			% 素材ID
		copy_id			= 40170,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,2,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26085,0,1,328,108},{26089,0,1,210,199},{26089,0,1,582,11},{26089,0,1,361,22},{26093,0,1,870,251},{26093,0,1,359,6},{26093,0,1,609,1}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40172)->
	#d_scene{
		scene_id		= 40172,			% 场景ID
		material_id	= 40024,			% 素材ID
		copy_id			= 40170,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27029,0,1,378,70}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40180)->
	#d_scene{
		scene_id		= 40180,			% 场景ID
		material_id	= 40025,			% 素材ID
		copy_id			= 40180,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25097,0,1,861,120},{25101,0,1,819,129},{25101,0,1,879,116},{25101,0,1,857,106},{25101,0,1,809,67},{25105,0,1,785,20},{25105,0,1,869,231},{25105,0,1,800,118},{25105,0,1,900,196}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40181)->
	#d_scene{
		scene_id		= 40181,			% 场景ID
		material_id	= 40026,			% 素材ID
		copy_id			= 40180,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26097,0,1,772,83},{26101,0,1,760,155},{26101,0,1,807,270},{26101,0,1,784,223},{26105,0,1,858,280},{26105,0,1,784,209},{26105,0,1,791,107}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40182)->
	#d_scene{
		scene_id		= 40182,			% 场景ID
		material_id	= 40027,			% 素材ID
		copy_id			= 40180,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27033,0,1,820,226}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40190)->
	#d_scene{
		scene_id		= 40190,			% 场景ID
		material_id	= 40028,			% 素材ID
		copy_id			= 40190,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25109,0,1,801,43},{25113,0,1,886,144},{25113,0,1,869,173},{25113,0,1,802,270},{25113,0,1,806,85},{25117,0,1,783,217},{25117,0,1,885,32},{25117,0,1,886,175},{25117,0,1,884,212}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40191)->
	#d_scene{
		scene_id		= 40191,			% 场景ID
		material_id	= 40029,			% 素材ID
		copy_id			= 40190,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26109,0,1,753,141},{26113,0,1,891,120},{26113,0,1,790,219},{26113,0,1,804,187},{26117,0,1,797,158},{26117,0,1,816,111},{26117,0,1,822,75}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40192)->
	#d_scene{
		scene_id		= 40192,			% 场景ID
		material_id	= 40030,			% 素材ID
		copy_id			= 40190,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27037,0,1,886,11}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40200)->
	#d_scene{
		scene_id		= 40200,			% 场景ID
		material_id	= 40031,			% 素材ID
		copy_id			= 40200,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25121,0,1,777,43},{25125,0,1,756,121},{25125,0,1,581,21},{25125,0,1,240,234},{25125,0,1,889,6},{25129,0,1,660,268},{25129,0,1,285,108},{25129,0,1,545,253},{25129,0,1,319,232}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40201)->
	#d_scene{
		scene_id		= 40201,			% 场景ID
		material_id	= 40032,			% 素材ID
		copy_id			= 40200,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26121,0,1,363,214},{26125,0,1,528,250},{26125,0,1,684,7},{26125,0,1,211,143},{26129,0,1,415,4},{26129,0,1,767,31},{26129,0,1,772,229}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40202)->
	#d_scene{
		scene_id		= 40202,			% 场景ID
		material_id	= 40033,			% 素材ID
		copy_id			= 40200,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27041,0,1,854,51}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40210)->
	#d_scene{
		scene_id		= 40210,			% 场景ID
		material_id	= 40034,			% 素材ID
		copy_id			= 40210,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25133,0,1,758,233},{25137,0,1,824,171},{25137,0,1,760,4},{25137,0,1,894,54},{25137,0,1,884,114},{25141,0,1,776,74},{25141,0,1,863,218},{25141,0,1,789,89},{25141,0,1,881,219}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40211)->
	#d_scene{
		scene_id		= 40211,			% 场景ID
		material_id	= 40035,			% 素材ID
		copy_id			= 40210,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26133,0,1,819,13},{26137,0,1,862,178},{26137,0,1,811,123},{26137,0,1,878,101},{26141,0,1,824,240},{26141,0,1,835,67},{26141,0,1,773,112}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40212)->
	#d_scene{
		scene_id		= 40212,			% 场景ID
		material_id	= 40036,			% 素材ID
		copy_id			= 40210,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27045,0,1,801,53}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40213)->
	#d_scene{
		scene_id		= 40213,			% 场景ID
		material_id	= 40001,			% 素材ID
		copy_id			= 40220,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25145,0,1,779,241},{25149,0,1,789,5},{25149,0,1,799,154},{25149,0,1,807,164},{25149,0,1,862,182},{25153,0,1,778,15},{25153,0,1,787,51},{25153,0,1,897,46},{25153,0,1,849,232}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40214)->
	#d_scene{
		scene_id		= 40214,			% 场景ID
		material_id	= 40002,			% 素材ID
		copy_id			= 40220,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26145,0,1,843,148},{26149,0,1,763,218},{26149,0,1,809,48},{26149,0,1,864,162},{26153,0,1,889,50},{26153,0,1,772,123},{26153,0,1,840,203}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40215)->
	#d_scene{
		scene_id		= 40215,			% 场景ID
		material_id	= 40003,			% 素材ID
		copy_id			= 40220,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27049,0,1,827,62}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40216)->
	#d_scene{
		scene_id		= 40216,			% 场景ID
		material_id	= 40004,			% 素材ID
		copy_id			= 40230,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25157,0,1,866,194},{25161,0,1,809,40},{25161,0,1,836,31},{25161,0,1,791,219},{25161,0,1,851,119},{25165,0,1,835,60},{25165,0,1,753,66},{25165,0,1,893,15},{25165,0,1,878,21}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40217)->
	#d_scene{
		scene_id		= 40217,			% 场景ID
		material_id	= 40005,			% 素材ID
		copy_id			= 40230,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26157,0,1,885,212},{26161,0,1,763,155},{26161,0,1,883,108},{26161,0,1,881,203},{26165,0,1,886,223},{26165,0,1,790,165},{26165,0,1,828,204}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40218)->
	#d_scene{
		scene_id		= 40218,			% 场景ID
		material_id	= 40006,			% 素材ID
		copy_id			= 40230,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27053,0,1,889,47}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40219)->
	#d_scene{
		scene_id		= 40219,			% 场景ID
		material_id	= 40007,			% 素材ID
		copy_id			= 40240,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25169,0,1,839,16},{25173,0,1,619,145},{25173,0,1,813,130},{25173,0,1,782,240},{25173,0,1,250,169},{25177,0,1,556,230},{25177,0,1,502,284},{25177,0,1,300,196},{25177,0,1,685,213}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40220)->
	#d_scene{
		scene_id		= 40220,			% 场景ID
		material_id	= 40008,			% 素材ID
		copy_id			= 40240,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26169,0,1,700,152},{26173,0,1,596,135},{26173,0,1,466,211},{26173,0,1,618,202},{26177,0,1,886,94},{26177,0,1,816,258},{26177,0,1,564,175}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40221)->
	#d_scene{
		scene_id		= 40221,			% 场景ID
		material_id	= 40009,			% 素材ID
		copy_id			= 40240,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27057,0,1,777,180}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40222)->
	#d_scene{
		scene_id		= 40222,			% 场景ID
		material_id	= 40010,			% 素材ID
		copy_id			= 40250,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25181,0,1,798,51},{25185,0,1,665,81},{25185,0,1,810,213},{25185,0,1,477,29},{25185,0,1,633,32},{25189,0,1,672,90},{25189,0,1,261,184},{25189,0,1,585,169},{25189,0,1,789,271}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40223)->
	#d_scene{
		scene_id		= 40223,			% 场景ID
		material_id	= 40011,			% 素材ID
		copy_id			= 40250,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26181,0,1,723,184},{26185,0,1,632,54},{26185,0,1,627,258},{26185,0,1,602,116},{26189,0,1,867,42},{26189,0,1,340,169},{26189,0,1,531,181}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40224)->
	#d_scene{
		scene_id		= 40224,			% 场景ID
		material_id	= 40012,			% 素材ID
		copy_id			= 40250,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27061,0,1,323,275}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40225)->
	#d_scene{
		scene_id		= 40225,			% 场景ID
		material_id	= 40013,			% 素材ID
		copy_id			= 40260,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25193,0,1,858,236},{25197,0,1,799,247},{25197,0,1,867,111},{25197,0,1,838,108},{25197,0,1,829,138},{25201,0,1,839,225},{25201,0,1,799,77},{25201,0,1,880,76},{25201,0,1,774,47}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40226)->
	#d_scene{
		scene_id		= 40226,			% 场景ID
		material_id	= 40014,			% 素材ID
		copy_id			= 40260,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26193,0,1,889,110},{26197,0,1,836,222},{26197,0,1,835,271},{26197,0,1,855,66},{26201,0,1,881,53},{26201,0,1,852,105},{26201,0,1,824,151}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40227)->
	#d_scene{
		scene_id		= 40227,			% 场景ID
		material_id	= 40015,			% 素材ID
		copy_id			= 40260,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27065,0,1,883,225}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40228)->
	#d_scene{
		scene_id		= 40228,			% 场景ID
		material_id	= 40016,			% 素材ID
		copy_id			= 40270,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25205,0,1,829,270},{25209,0,1,810,84},{25209,0,1,851,65},{25209,0,1,854,92},{25209,0,1,758,265},{25213,0,1,791,189},{25213,0,1,900,107},{25213,0,1,805,129},{25213,0,1,858,72}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40229)->
	#d_scene{
		scene_id		= 40229,			% 场景ID
		material_id	= 40017,			% 素材ID
		copy_id			= 40270,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26205,0,1,813,66},{26209,0,1,751,129},{26209,0,1,823,44},{26209,0,1,768,207},{26213,0,1,757,151},{26213,0,1,754,29},{26213,0,1,890,56}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40230)->
	#d_scene{
		scene_id		= 40230,			% 场景ID
		material_id	= 40018,			% 素材ID
		copy_id			= 40270,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27069,0,1,785,156}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40231)->
	#d_scene{
		scene_id		= 40231,			% 场景ID
		material_id	= 40019,			% 素材ID
		copy_id			= 40280,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25217,0,1,820,36},{25221,0,1,780,69},{25221,0,1,900,5},{25221,0,1,800,200},{25221,0,1,794,89},{25225,0,1,773,91},{25225,0,1,822,259},{25225,0,1,756,214},{25225,0,1,762,177}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40232)->
	#d_scene{
		scene_id		= 40232,			% 场景ID
		material_id	= 40020,			% 素材ID
		copy_id			= 40280,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26217,0,1,848,259},{26221,0,1,863,218},{26221,0,1,878,24},{26221,0,1,783,212},{26225,0,1,753,155},{26225,0,1,779,262},{26225,0,1,812,231}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40233)->
	#d_scene{
		scene_id		= 40233,			% 场景ID
		material_id	= 40021,			% 素材ID
		copy_id			= 40280,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27073,0,1,839,138}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40234)->
	#d_scene{
		scene_id		= 40234,			% 场景ID
		material_id	= 40022,			% 素材ID
		copy_id			= 40290,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25229,0,1,811,213},{25233,0,1,777,263},{25233,0,1,799,20},{25233,0,1,795,182},{25233,0,1,775,246},{25237,0,1,775,122},{25237,0,1,889,131},{25237,0,1,899,121},{25237,0,1,865,200}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40235)->
	#d_scene{
		scene_id		= 40235,			% 场景ID
		material_id	= 40023,			% 素材ID
		copy_id			= 40290,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26229,0,1,796,117},{26233,0,1,884,132},{26233,0,1,812,143},{26233,0,1,848,97},{26237,0,1,838,233},{26237,0,1,810,67},{26237,0,1,869,226}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40236)->
	#d_scene{
		scene_id		= 40236,			% 场景ID
		material_id	= 40024,			% 素材ID
		copy_id			= 40290,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27077,0,1,808,182}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40237)->
	#d_scene{
		scene_id		= 40237,			% 场景ID
		material_id	= 40025,			% 素材ID
		copy_id			= 40300,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25241,0,1,663,286},{25245,0,1,742,165},{25245,0,1,469,81},{25245,0,1,735,70},{25245,0,1,689,177},{25249,0,1,331,279},{25249,0,1,772,192},{25249,0,1,248,135},{25249,0,1,270,192}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40238)->
	#d_scene{
		scene_id		= 40238,			% 场景ID
		material_id	= 40026,			% 素材ID
		copy_id			= 40300,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26241,0,1,413,273},{26245,0,1,735,157},{26245,0,1,302,134},{26245,0,1,416,239},{26249,0,1,765,63},{26249,0,1,258,186},{26249,0,1,335,233}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40239)->
	#d_scene{
		scene_id		= 40239,			% 场景ID
		material_id	= 40027,			% 素材ID
		copy_id			= 40300,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27081,0,1,376,110}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40240)->
	#d_scene{
		scene_id		= 40240,			% 场景ID
		material_id	= 40028,			% 素材ID
		copy_id			= 40310,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25253,0,1,752,155},{25257,0,1,842,251},{25257,0,1,798,82},{25257,0,1,842,106},{25257,0,1,832,185},{25261,0,1,849,45},{25261,0,1,854,274},{25261,0,1,866,274},{25261,0,1,773,88}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40241)->
	#d_scene{
		scene_id		= 40241,			% 场景ID
		material_id	= 40029,			% 素材ID
		copy_id			= 40310,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26253,0,1,874,279},{26257,0,1,892,71},{26257,0,1,795,67},{26257,0,1,801,218},{26261,0,1,898,234},{26261,0,1,895,5},{26261,0,1,896,210}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40242)->
	#d_scene{
		scene_id		= 40242,			% 场景ID
		material_id	= 40030,			% 素材ID
		copy_id			= 40310,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27085,0,1,834,273}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40243)->
	#d_scene{
		scene_id		= 40243,			% 场景ID
		material_id	= 40031,			% 素材ID
		copy_id			= 40320,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25265,0,1,893,277},{25269,0,1,878,262},{25269,0,1,779,269},{25269,0,1,768,230},{25269,0,1,860,271},{25273,0,1,819,264},{25273,0,1,776,144},{25273,0,1,807,174},{25273,0,1,756,101}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40244)->
	#d_scene{
		scene_id		= 40244,			% 场景ID
		material_id	= 40032,			% 素材ID
		copy_id			= 40320,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26265,0,1,794,61},{26269,0,1,791,24},{26269,0,1,804,100},{26269,0,1,770,276},{26273,0,1,849,277},{26273,0,1,900,146},{26273,0,1,861,212}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40245)->
	#d_scene{
		scene_id		= 40245,			% 场景ID
		material_id	= 40033,			% 素材ID
		copy_id			= 40320,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27089,0,1,757,112}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40246)->
	#d_scene{
		scene_id		= 40246,			% 场景ID
		material_id	= 40034,			% 素材ID
		copy_id			= 40330,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25277,0,1,367,18},{25281,0,1,785,53},{25281,0,1,743,255},{25281,0,1,760,125},{25281,0,1,678,73},{25285,0,1,257,89},{25285,0,1,369,114},{25285,0,1,432,167},{25285,0,1,501,219}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40247)->
	#d_scene{
		scene_id		= 40247,			% 场景ID
		material_id	= 40035,			% 素材ID
		copy_id			= 40330,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26277,0,1,466,170},{26281,0,1,772,211},{26281,0,1,238,155},{26281,0,1,431,127},{26285,0,1,648,65},{26285,0,1,476,124},{26285,0,1,456,61}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40248)->
	#d_scene{
		scene_id		= 40248,			% 场景ID
		material_id	= 40036,			% 素材ID
		copy_id			= 40330,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27093,0,1,772,188}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40249)->
	#d_scene{
		scene_id		= 40249,			% 场景ID
		material_id	= 40001,			% 素材ID
		copy_id			= 40340,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25289,0,1,636,175},{25293,0,1,899,10},{25293,0,1,585,15},{25293,0,1,628,45},{25293,0,1,547,117},{25297,0,1,893,156},{25297,0,1,727,75},{25297,0,1,830,221},{25297,0,1,428,225}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40250)->
	#d_scene{
		scene_id		= 40250,			% 场景ID
		material_id	= 40002,			% 素材ID
		copy_id			= 40340,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26289,0,1,211,134},{26293,0,1,845,113},{26293,0,1,469,5},{26293,0,1,783,175},{26297,0,1,883,142},{26297,0,1,623,146},{26297,0,1,872,233}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40251)->
	#d_scene{
		scene_id		= 40251,			% 场景ID
		material_id	= 40003,			% 素材ID
		copy_id			= 40340,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27097,0,1,579,73}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40252)->
	#d_scene{
		scene_id		= 40252,			% 场景ID
		material_id	= 40004,			% 素材ID
		copy_id			= 40350,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25301,0,1,821,127},{25305,0,1,890,8},{25305,0,1,881,221},{25305,0,1,401,54},{25305,0,1,511,179},{25309,0,1,397,251},{25309,0,1,329,171},{25309,0,1,235,228},{25309,0,1,239,127}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40253)->
	#d_scene{
		scene_id		= 40253,			% 场景ID
		material_id	= 40005,			% 素材ID
		copy_id			= 40350,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26301,0,1,463,69},{26305,0,1,315,53},{26305,0,1,608,232},{26305,0,1,750,21},{26309,0,1,876,243},{26309,0,1,436,167},{26309,0,1,820,161}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40254)->
	#d_scene{
		scene_id		= 40254,			% 场景ID
		material_id	= 40006,			% 素材ID
		copy_id			= 40350,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27101,0,1,818,95}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40255)->
	#d_scene{
		scene_id		= 40255,			% 场景ID
		material_id	= 40007,			% 素材ID
		copy_id			= 40360,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25313,0,1,765,114},{25317,0,1,759,299},{25317,0,1,899,179},{25317,0,1,751,192},{25317,0,1,863,121},{25321,0,1,836,51},{25321,0,1,851,66},{25321,0,1,839,265},{25321,0,1,833,300}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40256)->
	#d_scene{
		scene_id		= 40256,			% 场景ID
		material_id	= 40008,			% 素材ID
		copy_id			= 40360,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26313,0,1,883,196},{26317,0,1,807,193},{26317,0,1,771,235},{26317,0,1,837,162},{26321,0,1,775,239},{26321,0,1,833,262},{26321,0,1,864,178}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40257)->
	#d_scene{
		scene_id		= 40257,			% 场景ID
		material_id	= 40009,			% 素材ID
		copy_id			= 40360,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27105,0,1,783,48}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40258)->
	#d_scene{
		scene_id		= 40258,			% 场景ID
		material_id	= 40010,			% 素材ID
		copy_id			= 40370,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25325,0,1,771,229},{25329,0,1,858,271},{25329,0,1,873,207},{25329,0,1,791,141},{25329,0,1,839,23},{25333,0,1,768,295},{25333,0,1,789,273},{25333,0,1,837,62},{25333,0,1,880,67}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40259)->
	#d_scene{
		scene_id		= 40259,			% 场景ID
		material_id	= 40011,			% 素材ID
		copy_id			= 40370,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26325,0,1,783,182},{26329,0,1,847,140},{26329,0,1,869,124},{26329,0,1,880,21},{26333,0,1,805,201},{26333,0,1,818,170},{26333,0,1,816,50}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40260)->
	#d_scene{
		scene_id		= 40260,			% 场景ID
		material_id	= 40012,			% 素材ID
		copy_id			= 40370,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27109,0,1,840,256}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40261)->
	#d_scene{
		scene_id		= 40261,			% 场景ID
		material_id	= 40013,			% 素材ID
		copy_id			= 40380,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25337,0,1,818,103},{25341,0,1,844,116},{25341,0,1,891,228},{25341,0,1,760,106},{25341,0,1,808,178},{25345,0,1,788,290},{25345,0,1,813,88},{25345,0,1,889,219},{25345,0,1,891,150}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40262)->
	#d_scene{
		scene_id		= 40262,			% 场景ID
		material_id	= 40014,			% 素材ID
		copy_id			= 40380,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26337,0,1,796,109},{26341,0,1,794,213},{26341,0,1,830,264},{26341,0,1,829,9},{26345,0,1,845,129},{26345,0,1,825,118},{26345,0,1,756,15}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40263)->
	#d_scene{
		scene_id		= 40263,			% 场景ID
		material_id	= 40015,			% 素材ID
		copy_id			= 40380,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27113,0,1,890,293}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40264)->
	#d_scene{
		scene_id		= 40264,			% 场景ID
		material_id	= 40016,			% 素材ID
		copy_id			= 40390,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25349,0,1,246,27},{25353,0,1,692,60},{25353,0,1,457,208},{25353,0,1,352,92},{25353,0,1,395,131},{25357,0,1,876,180},{25357,0,1,783,127},{25357,0,1,431,234},{25357,0,1,616,90}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40265)->
	#d_scene{
		scene_id		= 40265,			% 场景ID
		material_id	= 40017,			% 素材ID
		copy_id			= 40390,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26349,0,1,423,107},{26353,0,1,835,159},{26353,0,1,612,108},{26353,0,1,698,264},{26357,0,1,374,46},{26357,0,1,473,60},{26357,0,1,850,38}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40266)->
	#d_scene{
		scene_id		= 40266,			% 场景ID
		material_id	= 40018,			% 素材ID
		copy_id			= 40390,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27117,0,1,518,33}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40267)->
	#d_scene{
		scene_id		= 40267,			% 场景ID
		material_id	= 40019,			% 素材ID
		copy_id			= 40400,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25361,0,1,814,121},{25365,0,1,597,44},{25365,0,1,333,163},{25365,0,1,248,268},{25365,0,1,857,241},{25369,0,1,797,257},{25369,0,1,469,227},{25369,0,1,469,123},{25369,0,1,790,222}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40268)->
	#d_scene{
		scene_id		= 40268,			% 场景ID
		material_id	= 40020,			% 素材ID
		copy_id			= 40400,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26361,0,1,679,120},{26365,0,1,425,177},{26365,0,1,520,156},{26365,0,1,775,196},{26369,0,1,745,70},{26369,0,1,265,55},{26369,0,1,700,162}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40269)->
	#d_scene{
		scene_id		= 40269,			% 场景ID
		material_id	= 40021,			% 素材ID
		copy_id			= 40400,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27121,0,1,499,242}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40270)->
	#d_scene{
		scene_id		= 40270,			% 场景ID
		material_id	= 40022,			% 素材ID
		copy_id			= 40410,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25373,0,1,296,181},{25377,0,1,293,1},{25377,0,1,414,160},{25377,0,1,444,184},{25377,0,1,585,78},{25381,0,1,351,119},{25381,0,1,506,100},{25381,0,1,889,92},{25381,0,1,453,263}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40271)->
	#d_scene{
		scene_id		= 40271,			% 场景ID
		material_id	= 40023,			% 素材ID
		copy_id			= 40410,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26373,0,1,254,128},{26377,0,1,631,174},{26377,0,1,813,46},{26377,0,1,546,92},{26381,0,1,212,76},{26381,0,1,768,189},{26381,0,1,383,225}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40272)->
	#d_scene{
		scene_id		= 40272,			% 场景ID
		material_id	= 40024,			% 素材ID
		copy_id			= 40410,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27125,0,1,259,235}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40273)->
	#d_scene{
		scene_id		= 40273,			% 场景ID
		material_id	= 40025,			% 素材ID
		copy_id			= 40420,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25385,0,1,786,174},{25389,0,1,829,243},{25389,0,1,818,152},{25389,0,1,798,47},{25389,0,1,764,212},{25393,0,1,821,118},{25393,0,1,803,13},{25393,0,1,895,154},{25393,0,1,792,123}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40274)->
	#d_scene{
		scene_id		= 40274,			% 场景ID
		material_id	= 40026,			% 素材ID
		copy_id			= 40420,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26385,0,1,814,182},{26389,0,1,769,145},{26389,0,1,875,56},{26389,0,1,845,37},{26393,0,1,753,21},{26393,0,1,751,90},{26393,0,1,853,132}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40275)->
	#d_scene{
		scene_id		= 40275,			% 场景ID
		material_id	= 40027,			% 素材ID
		copy_id			= 40420,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27129,0,1,877,26}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40276)->
	#d_scene{
		scene_id		= 40276,			% 场景ID
		material_id	= 40028,			% 素材ID
		copy_id			= 40430,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25397,0,1,857,230},{25401,0,1,782,29},{25401,0,1,821,33},{25401,0,1,774,130},{25401,0,1,876,177},{25405,0,1,867,14},{25405,0,1,785,155},{25405,0,1,899,203},{25405,0,1,777,158}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40277)->
	#d_scene{
		scene_id		= 40277,			% 场景ID
		material_id	= 40029,			% 素材ID
		copy_id			= 40430,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26397,0,1,886,156},{26401,0,1,814,169},{26401,0,1,835,259},{26401,0,1,805,180},{26405,0,1,762,198},{26405,0,1,806,3},{26405,0,1,802,138}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40278)->
	#d_scene{
		scene_id		= 40278,			% 场景ID
		material_id	= 40030,			% 素材ID
		copy_id			= 40430,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27133,0,1,864,194}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40279)->
	#d_scene{
		scene_id		= 40279,			% 场景ID
		material_id	= 40031,			% 素材ID
		copy_id			= 40440,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25409,0,1,827,137},{25413,0,1,809,128},{25413,0,1,873,235},{25413,0,1,844,251},{25413,0,1,773,232},{25417,0,1,892,100},{25417,0,1,897,105},{25417,0,1,854,150},{25417,0,1,808,128}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40280)->
	#d_scene{
		scene_id		= 40280,			% 场景ID
		material_id	= 40032,			% 素材ID
		copy_id			= 40440,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26409,0,1,891,233},{26413,0,1,803,111},{26413,0,1,834,12},{26413,0,1,766,210},{26417,0,1,863,173},{26417,0,1,882,217},{26417,0,1,879,15}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40281)->
	#d_scene{
		scene_id		= 40281,			% 场景ID
		material_id	= 40033,			% 素材ID
		copy_id			= 40440,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27137,0,1,783,249}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40282)->
	#d_scene{
		scene_id		= 40282,			% 场景ID
		material_id	= 40034,			% 素材ID
		copy_id			= 40450,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25421,0,1,829,2},{25425,0,1,848,249},{25425,0,1,800,128},{25425,0,1,886,147},{25425,0,1,820,53},{25429,0,1,835,67},{25429,0,1,827,209},{25429,0,1,759,156},{25429,0,1,818,145}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40283)->
	#d_scene{
		scene_id		= 40283,			% 场景ID
		material_id	= 40035,			% 素材ID
		copy_id			= 40450,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26421,0,1,781,156},{26425,0,1,899,178},{26425,0,1,834,43},{26425,0,1,823,156},{26429,0,1,877,110},{26429,0,1,860,53},{26429,0,1,763,141}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40284)->
	#d_scene{
		scene_id		= 40284,			% 场景ID
		material_id	= 40036,			% 素材ID
		copy_id			= 40450,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27141,0,1,884,4}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40285)->
	#d_scene{
		scene_id		= 40285,			% 场景ID
		material_id	= 40001,			% 素材ID
		copy_id			= 40460,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25433,0,1,800,179},{25437,0,1,875,94},{25437,0,1,789,35},{25437,0,1,872,101},{25437,0,1,837,72},{25441,0,1,810,249},{25441,0,1,800,63},{25441,0,1,763,86},{25441,0,1,892,10}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40286)->
	#d_scene{
		scene_id		= 40286,			% 场景ID
		material_id	= 40002,			% 素材ID
		copy_id			= 40460,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26433,0,1,844,227},{26437,0,1,850,81},{26437,0,1,832,99},{26437,0,1,810,72},{26441,0,1,809,221},{26441,0,1,807,197},{26441,0,1,772,148}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40287)->
	#d_scene{
		scene_id		= 40287,			% 场景ID
		material_id	= 40003,			% 素材ID
		copy_id			= 40460,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27145,0,1,894,200}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40288)->
	#d_scene{
		scene_id		= 40288,			% 场景ID
		material_id	= 40004,			% 素材ID
		copy_id			= 40470,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25445,0,1,784,173},{25449,0,1,779,177},{25449,0,1,826,69},{25449,0,1,768,191},{25449,0,1,773,47},{25453,0,1,754,50},{25453,0,1,785,137},{25453,0,1,849,205},{25453,0,1,820,92}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40289)->
	#d_scene{
		scene_id		= 40289,			% 场景ID
		material_id	= 40005,			% 素材ID
		copy_id			= 40470,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26445,0,1,807,36},{26449,0,1,895,179},{26449,0,1,864,261},{26449,0,1,900,133},{26453,0,1,857,268},{26453,0,1,831,73},{26453,0,1,809,12}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40290)->
	#d_scene{
		scene_id		= 40290,			% 场景ID
		material_id	= 40006,			% 素材ID
		copy_id			= 40470,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27149,0,1,831,5}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40291)->
	#d_scene{
		scene_id		= 40291,			% 场景ID
		material_id	= 40007,			% 素材ID
		copy_id			= 40480,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25457,0,1,528,59},{25461,0,1,746,57},{25461,0,1,310,194},{25461,0,1,359,258},{25461,0,1,534,33},{25465,0,1,703,256},{25465,0,1,448,52},{25465,0,1,688,199},{25465,0,1,825,252}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40292)->
	#d_scene{
		scene_id		= 40292,			% 场景ID
		material_id	= 40008,			% 素材ID
		copy_id			= 40480,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26457,0,1,825,72},{26461,0,1,704,57},{26461,0,1,683,130},{26461,0,1,671,6}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40293)->
	#d_scene{
		scene_id		= 40293,			% 场景ID
		material_id	= 40009,			% 素材ID
		copy_id			= 40480,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27153,0,1,471,290},{27157,0,1,593,95}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40294)->
	#d_scene{
		scene_id		= 40294,			% 场景ID
		material_id	= 40010,			% 素材ID
		copy_id			= 40490,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25469,0,1,782,43},{25473,0,1,260,26},{25473,0,1,372,70},{25473,0,1,252,186},{25473,0,1,550,92},{25477,0,1,625,5},{25477,0,1,519,26},{25477,0,1,578,180},{25477,0,1,840,151}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40295)->
	#d_scene{
		scene_id		= 40295,			% 场景ID
		material_id	= 40011,			% 素材ID
		copy_id			= 40490,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26465,0,1,311,305},{26469,0,1,510,63},{26469,0,1,690,97},{26469,0,1,789,29}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40296)->
	#d_scene{
		scene_id		= 40296,			% 场景ID
		material_id	= 40012,			% 素材ID
		copy_id			= 40490,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27161,0,1,847,233},{27165,0,1,339,4}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40297)->
	#d_scene{
		scene_id		= 40297,			% 场景ID
		material_id	= 40013,			% 素材ID
		copy_id			= 40500,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25481,0,1,433,140},{25485,0,1,849,137},{25485,0,1,738,39},{25485,0,1,364,250},{25485,0,1,257,71},{25489,0,1,235,74},{25489,0,1,476,220},{25489,0,1,615,278},{25489,0,1,754,196}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40298)->
	#d_scene{
		scene_id		= 40298,			% 场景ID
		material_id	= 40014,			% 素材ID
		copy_id			= 40500,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26473,0,1,254,188},{26477,0,1,249,300},{26477,0,1,261,73},{26477,0,1,516,80}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40299)->
	#d_scene{
		scene_id		= 40299,			% 场景ID
		material_id	= 40015,			% 素材ID
		copy_id			= 40500,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27169,0,1,739,302},{27173,0,1,638,98}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40300)->
	#d_scene{
		scene_id		= 40300,			% 场景ID
		material_id	= 40016,			% 素材ID
		copy_id			= 40510,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25493,0,1,389,81},{25497,0,1,617,248},{25497,0,1,862,186},{25497,0,1,437,31},{25497,0,1,556,23},{25501,0,1,398,89},{25501,0,1,844,223},{25501,0,1,349,21},{25501,0,1,458,200}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40301)->
	#d_scene{
		scene_id		= 40301,			% 场景ID
		material_id	= 40017,			% 素材ID
		copy_id			= 40510,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26481,0,1,832,32},{26485,0,1,306,243},{26485,0,1,320,36},{26485,0,1,836,136}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40302)->
	#d_scene{
		scene_id		= 40302,			% 场景ID
		material_id	= 40018,			% 素材ID
		copy_id			= 40510,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27177,0,1,678,237},{27181,0,1,319,130}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40303)->
	#d_scene{
		scene_id		= 40303,			% 场景ID
		material_id	= 40019,			% 素材ID
		copy_id			= 40520,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25505,0,1,534,70},{25509,0,1,367,190},{25509,0,1,723,42},{25509,0,1,694,39},{25509,0,1,390,126},{25513,0,1,416,231},{25513,0,1,676,170},{25513,0,1,796,87},{25513,0,1,443,225}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40304)->
	#d_scene{
		scene_id		= 40304,			% 场景ID
		material_id	= 40020,			% 素材ID
		copy_id			= 40520,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26489,0,1,201,206},{26493,0,1,811,184},{26493,0,1,665,94},{26493,0,1,733,137}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40305)->
	#d_scene{
		scene_id		= 40305,			% 场景ID
		material_id	= 40021,			% 素材ID
		copy_id			= 40520,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27185,0,1,719,123},{27189,0,1,654,119}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40306)->
	#d_scene{
		scene_id		= 40306,			% 场景ID
		material_id	= 40022,			% 素材ID
		copy_id			= 40530,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25517,0,1,792,185},{25521,0,1,554,101},{25521,0,1,651,27},{25521,0,1,362,201},{25521,0,1,245,99},{25525,0,1,225,183},{25525,0,1,540,188},{25525,0,1,514,106},{25525,0,1,756,202}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40307)->
	#d_scene{
		scene_id		= 40307,			% 场景ID
		material_id	= 40023,			% 素材ID
		copy_id			= 40530,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26497,0,1,747,209},{26501,0,1,495,119},{26501,0,1,799,149},{26501,0,1,469,3}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40308)->
	#d_scene{
		scene_id		= 40308,			% 场景ID
		material_id	= 40024,			% 素材ID
		copy_id			= 40530,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27193,0,1,670,180},{27197,0,1,429,73}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40309)->
	#d_scene{
		scene_id		= 40309,			% 场景ID
		material_id	= 40025,			% 素材ID
		copy_id			= 40540,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25529,0,1,764,153},{25533,0,1,816,99},{25533,0,1,846,164},{25533,0,1,830,188},{25533,0,1,760,85},{25537,0,1,851,198},{25537,0,1,875,173},{25537,0,1,760,181},{25537,0,1,887,262}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40310)->
	#d_scene{
		scene_id		= 40310,			% 场景ID
		material_id	= 40026,			% 素材ID
		copy_id			= 40540,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26505,0,1,797,250},{26509,0,1,833,193},{26509,0,1,871,191},{26509,0,1,852,49}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40311)->
	#d_scene{
		scene_id		= 40311,			% 场景ID
		material_id	= 40027,			% 素材ID
		copy_id			= 40540,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27201,0,1,768,111},{27205,0,1,805,123}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40312)->
	#d_scene{
		scene_id		= 40312,			% 场景ID
		material_id	= 40028,			% 素材ID
		copy_id			= 40550,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25541,0,1,864,65},{25545,0,1,842,135},{25545,0,1,828,98},{25545,0,1,801,81},{25545,0,1,817,227},{25549,0,1,805,26},{25549,0,1,849,178},{25549,0,1,868,120},{25549,0,1,757,121}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40313)->
	#d_scene{
		scene_id		= 40313,			% 场景ID
		material_id	= 40029,			% 素材ID
		copy_id			= 40550,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26513,0,1,868,166},{26517,0,1,868,63},{26517,0,1,778,244},{26517,0,1,858,76}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40314)->
	#d_scene{
		scene_id		= 40314,			% 场景ID
		material_id	= 40030,			% 素材ID
		copy_id			= 40550,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27209,0,1,781,29},{27213,0,1,873,91}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40315)->
	#d_scene{
		scene_id		= 40315,			% 场景ID
		material_id	= 40031,			% 素材ID
		copy_id			= 40560,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25553,0,1,826,236},{25557,0,1,828,244},{25557,0,1,806,43},{25557,0,1,768,201},{25557,0,1,769,66},{25561,0,1,764,122},{25561,0,1,805,177},{25561,0,1,877,161},{25561,0,1,896,274}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40316)->
	#d_scene{
		scene_id		= 40316,			% 场景ID
		material_id	= 40032,			% 素材ID
		copy_id			= 40560,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26521,0,1,788,92},{26525,0,1,890,9},{26525,0,1,855,216},{26525,0,1,827,229}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40317)->
	#d_scene{
		scene_id		= 40317,			% 场景ID
		material_id	= 40033,			% 素材ID
		copy_id			= 40560,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27217,0,1,893,26},{27221,0,1,834,252}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40318)->
	#d_scene{
		scene_id		= 40318,			% 场景ID
		material_id	= 40034,			% 素材ID
		copy_id			= 40570,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25565,0,1,841,175},{25569,0,1,784,239},{25569,0,1,807,153},{25569,0,1,751,42},{25569,0,1,873,129},{25573,0,1,869,133},{25573,0,1,762,66},{25573,0,1,755,76},{25573,0,1,806,150}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40319)->
	#d_scene{
		scene_id		= 40319,			% 场景ID
		material_id	= 40035,			% 素材ID
		copy_id			= 40570,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26529,0,1,785,45},{26533,0,1,861,234},{26533,0,1,784,127},{26533,0,1,789,91}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40320)->
	#d_scene{
		scene_id		= 40320,			% 场景ID
		material_id	= 40036,			% 素材ID
		copy_id			= 40570,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27225,0,1,819,151},{27229,0,1,853,279}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40321)->
	#d_scene{
		scene_id		= 40321,			% 场景ID
		material_id	= 40035,			% 素材ID
		copy_id			= 40580,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25577,0,1,855,192},{25581,0,1,787,131},{25581,0,1,867,234},{25581,0,1,884,127},{25581,0,1,789,97},{25585,0,1,866,241},{25585,0,1,776,117},{25585,0,1,798,48},{25585,0,1,848,1}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40322)->
	#d_scene{
		scene_id		= 40322,			% 场景ID
		material_id	= 40035,			% 素材ID
		copy_id			= 40580,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26537,0,1,778,272},{26541,0,1,890,141},{26541,0,1,765,95},{26541,0,1,861,170}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40323)->
	#d_scene{
		scene_id		= 40323,			% 场景ID
		material_id	= 40035,			% 素材ID
		copy_id			= 40580,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27233,0,1,879,17},{27237,0,1,795,150}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40324)->
	#d_scene{
		scene_id		= 40324,			% 场景ID
		material_id	= 40035,			% 素材ID
		copy_id			= 40590,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 1,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{25589,0,1,878,259},{25593,0,1,852,267},{25593,0,1,778,77},{25593,0,1,879,271},{25593,0,1,862,18},{25597,0,1,801,67},{25597,0,1,755,28},{25597,0,1,863,190},{25597,0,1,887,37}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40325)->
	#d_scene{
		scene_id		= 40325,			% 场景ID
		material_id	= 40035,			% 素材ID
		copy_id			= 40590,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 4,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [{38501,3,10000}], %% 战斗奖励
		door			= [{50104,800,160}],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{26545,0,1,887,179},{26549,0,1,751,46},{26549,0,1,769,111},{26549,0,1,871,232}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(40326)->
	#d_scene{
		scene_id		= 40326,			% 场景ID
		material_id	= 40035,			% 素材ID
		copy_id			= 40590,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 8,			% 地图类型
		pass_type		= 2,			% 通关类型
		pass_value	= 90,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,480,200}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 1, %% 显示伙伴
		is_matte		= 3, %% 迷雾遮罩
		is_map		= 0, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{27241,0,1,822,223},{27245,0,1,855,103}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(50001)->
	#d_scene{
		scene_id		= 50001,			% 场景ID
		material_id	= 10155,			% 素材ID
		copy_id			= 50001,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 2,			% 地图类型
		pass_type		= 0,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,300,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 0, %% 迷雾遮罩
		is_map		= 1, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 1, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= [{0,1200,0,[{10001,0,1,842,145},{10001,0,1,816,79},{10001,0,1,761,210},{10001,0,1,703,206}],[]},{424,1624,434,[{10001,0,1,1134,112},{10001,0,1,1297,214},{10001,0,1,1199,260},{10001,0,1,1299,16}],[]},{848,2048,858,[{10000,0,1,1653,208}],[]}]    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(50010)->
	#d_scene{
		scene_id		= 50010,			% 场景ID
		material_id	= 50010,			% 素材ID
		copy_id			= 0,			% 副本ID
		lv				= 20,			% 地图需求等级
		scene_type		= 5,			% 地图类型
		pass_type		= 0,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,10,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 0, %% 迷雾遮罩
		is_map		= 1, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 1, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= []    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(50011)->
	#d_scene{
		scene_id		= 50011,			% 场景ID
		material_id	= 50010,			% 素材ID
		copy_id			= 0,			% 副本ID
		lv				= 20,			% 地图需求等级
		scene_type		= 5,			% 地图类型
		pass_type		= 0,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,10,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 0, %% 迷雾遮罩
		is_map		= 1, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 1, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= []    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(50020)->
	#d_scene{
		scene_id		= 50020,			% 场景ID
		material_id	= 10142,			% 素材ID
		copy_id			= 0,			% 副本ID
		lv				= 20,			% 地图需求等级
		scene_type		= 6,			% 地图类型
		pass_type		= 0,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 60,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,10,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 0, %% 迷雾遮罩
		is_map		= 1, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 1, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= []    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(50030)->
	#d_scene{
		scene_id		= 50030,			% 场景ID
		material_id	= 10142,			% 素材ID
		copy_id			= 0,			% 副本ID
		lv				= 1,			% 地图需求等级
		scene_type		= 7,			% 地图类型
		pass_type		= 0,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{1,10,160},{2,850,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 0, %% 迷雾遮罩
		is_map		= 1, %% 小地图是否显示
		is_ride		= 0, %% 是否可以坐骑
		is_mount		= 0, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= []    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(50040)->
	#d_scene{
		scene_id		= 50040,			% 场景ID
		material_id	= 10142,			% 素材ID
		copy_id			= 0,			% 副本ID
		lv				= 40,			% 地图需求等级
		scene_type		= 9,			% 地图类型
		pass_type		= 0,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 60,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{1,10,160},{2,850,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 0, %% 迷雾遮罩
		is_map		= 1, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 1, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= []    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(50050)->
	#d_scene{
		scene_id		= 50050,			% 场景ID
		material_id	= 50010,			% 素材ID
		copy_id			= 0,			% 副本ID
		lv				= 20,			% 地图需求等级
		scene_type		= 10,			% 地图类型
		pass_type		= 0,			% 通关类型
		pass_value	= 0,			% 通关值
		war_cd		= 0,				% 战斗间隔CD(0:无CD|具体数字:单位秒)
		reborn_cd		= 0,			% 复活CD
		reborn		= [],		% 复活数据{阵营(活动对伍),场景ID,X(像素),Y(像素)} 如:[{CountryID,SceneID,X,Y}]
		born			= [{0,10,160}],		% 场景的出生点{阵营(活动对伍),X(像素),Y(像素)}    如:[{CountryID,X,Y}]
		buff_state	= 0,			% BUFF持续状态(0:没有|1:退出场景后消失|2:退出后再进入时存在)
		attr_bonus	= 0,			% 地图属性加成
		attr_add		= 0,			% 属性加成是否叠加
		exp_revise	= 1,		    % 经验校正
		flop_revise	= 1,		% 掉落校正
		is_team		= 0, %% 组队
		is_button		= 1, %% 显示按钮
		is_par		= 0, %% 显示伙伴
		is_matte		= 0, %% 迷雾遮罩
		is_map		= 1, %% 小地图是否显示
		is_ride		= 1, %% 是否可以坐骑
		is_mount		= 1, %% 坐骑效果加成
		war_reward	= [], %% 战斗奖励
		door			= [],   % 传送点   传送门[{door_id,x,y,to}]   旧： [{传送点ID,坐标X,坐标Y,目标地图ID,目标地图X,目标地图Y},...] 
		npc			= [],   % NPC列表  [{npc_id,x,y}]
		monsters		= []    % 怪物[{lx,rx,born_x,[{monster_id,refresh,count,x,y},...],[{give,...},...]},...]
	};
scene(_)->?null.


%% material(素材图片ID) -> 场景(地图) 
material(10166)->
	#d_material{
		id			= 10166,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 295,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10165)->
	#d_material{
		id			= 10165,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10164)->
	#d_material{
		id			= 10164,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10163)->
	#d_material{
		id			= 10163,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 295,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10162)->
	#d_material{
		id			= 10162,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 295,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10161)->
	#d_material{
		id			= 10161,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 285,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10160)->
	#d_material{
		id			= 10160,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 305,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10159)->
	#d_material{
		id			= 10159,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10158)->
	#d_material{
		id			= 10158,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 300,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10157)->
	#d_material{
		id			= 10157,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10156)->
	#d_material{
		id			= 10156,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 300,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10155)->
	#d_material{
		id			= 10155,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 300,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10154)->
	#d_material{
		id			= 10154,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 295,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10153)->
	#d_material{
		id			= 10153,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10152)->
	#d_material{
		id			= 10152,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10151)->
	#d_material{
		id			= 10151,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 295,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10150)->
	#d_material{
		id			= 10150,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 295,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10149)->
	#d_material{
		id			= 10149,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 285,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10148)->
	#d_material{
		id			= 10148,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 305,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10147)->
	#d_material{
		id			= 10147,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10146)->
	#d_material{
		id			= 10146,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 300,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10145)->
	#d_material{
		id			= 10145,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10144)->
	#d_material{
		id			= 10144,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 300,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10143)->
	#d_material{
		id			= 10143,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 300,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10142)->
	#d_material{
		id			= 10142,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1536,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1536,	% 素材格子tile宽
		move_height	= 300,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10141)->
	#d_material{
		id			= 10141,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 295,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10140)->
	#d_material{
		id			= 10140,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10139)->
	#d_material{
		id			= 10139,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10138)->
	#d_material{
		id			= 10138,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 295,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10137)->
	#d_material{
		id			= 10137,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 295,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10136)->
	#d_material{
		id			= 10136,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 285,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10135)->
	#d_material{
		id			= 10135,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 305,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10134)->
	#d_material{
		id			= 10134,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10133)->
	#d_material{
		id			= 10133,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 300,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10132)->
	#d_material{
		id			= 10132,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10131)->
	#d_material{
		id			= 10131,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 300,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10130)->
	#d_material{
		id			= 10130,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 300,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40036)->
	#d_material{
		id			= 40036,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40035)->
	#d_material{
		id			= 40035,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40034)->
	#d_material{
		id			= 40034,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40033)->
	#d_material{
		id			= 40033,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40032)->
	#d_material{
		id			= 40032,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40031)->
	#d_material{
		id			= 40031,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40030)->
	#d_material{
		id			= 40030,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40029)->
	#d_material{
		id			= 40029,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40028)->
	#d_material{
		id			= 40028,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40027)->
	#d_material{
		id			= 40027,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10105)->
	#d_material{
		id			= 10105,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10106)->
	#d_material{
		id			= 10106,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10107)->
	#d_material{
		id			= 10107,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 255,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10108)->
	#d_material{
		id			= 10108,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 255,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10109)->
	#d_material{
		id			= 10109,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 255,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10110)->
	#d_material{
		id			= 10110,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 310,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10111)->
	#d_material{
		id			= 10111,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 310,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40026)->
	#d_material{
		id			= 40026,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40025)->
	#d_material{
		id			= 40025,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40024)->
	#d_material{
		id			= 40024,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40023)->
	#d_material{
		id			= 40023,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 310,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40022)->
	#d_material{
		id			= 40022,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 255,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40021)->
	#d_material{
		id			= 40021,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40020)->
	#d_material{
		id			= 40020,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 310,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40019)->
	#d_material{
		id			= 40019,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 255,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40018)->
	#d_material{
		id			= 40018,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40017)->
	#d_material{
		id			= 40017,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 310,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40016)->
	#d_material{
		id			= 40016,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 255,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40015)->
	#d_material{
		id			= 40015,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40014)->
	#d_material{
		id			= 40014,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 310,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40013)->
	#d_material{
		id			= 40013,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 255,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40012)->
	#d_material{
		id			= 40012,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40011)->
	#d_material{
		id			= 40011,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40010)->
	#d_material{
		id			= 40010,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40009)->
	#d_material{
		id			= 40009,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40008)->
	#d_material{
		id			= 40008,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40007)->
	#d_material{
		id			= 40007,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40006)->
	#d_material{
		id			= 40006,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40005)->
	#d_material{
		id			= 40005,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40004)->
	#d_material{
		id			= 40004,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40003)->
	#d_material{
		id			= 40003,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40002)->
	#d_material{
		id			= 40002,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(40001)->
	#d_material{
		id			= 40001,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10129)->
	#d_material{
		id			= 10129,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10128)->
	#d_material{
		id			= 10128,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10127)->
	#d_material{
		id			= 10127,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10126)->
	#d_material{
		id			= 10126,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10001)->
	#d_material{
		id			= 10001,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10010)->
	#d_material{
		id			= 10010,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 600,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10002)->
	#d_material{
		id			= 10002,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 255,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(50010)->
	#d_material{
		id			= 50010,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1536,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1536,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(50020)->
	#d_material{
		id			= 50020,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1280,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1280,	% 素材格子tile宽
		move_height	= 255,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10101)->
	#d_material{
		id			= 10101,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 1536,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 1536,	% 素材格子tile宽
		move_height	= 600,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10102)->
	#d_material{
		id			= 10102,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10103)->
	#d_material{
		id			= 10103,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10104)->
	#d_material{
		id			= 10104,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 270,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10112)->
	#d_material{
		id			= 10112,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 310,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10113)->
	#d_material{
		id			= 10113,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10114)->
	#d_material{
		id			= 10114,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10115)->
	#d_material{
		id			= 10115,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 280,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10116)->
	#d_material{
		id			= 10116,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10117)->
	#d_material{
		id			= 10117,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10118)->
	#d_material{
		id			= 10118,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10119)->
	#d_material{
		id			= 10119,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10120)->
	#d_material{
		id			= 10120,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10121)->
	#d_material{
		id			= 10121,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10122)->
	#d_material{
		id			= 10122,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3580,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3580,	% 素材格子tile宽
		move_height	= 260,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10123)->
	#d_material{
		id			= 10123,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2048,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2048,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10124)->
	#d_material{
		id			= 10124,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 2560,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 2560,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(10125)->
	#d_material{
		id			= 10125,	% 素材ID
		scale       	= 1,	% 格子大小
		image_height	= 640,	% 素材像素高
		image_width	= 3070,	% 素材像素宽
		tile_height	= 640,	% 素材格子tile高
		tile_width	= 3070,	% 素材格子tile宽
		move_height	= 290,	% 可行高度
		excess_bottom	= 0,	% 底部多余部份
		path	= <<"">> 
	};
material(_)->?null.