-module(data_clan_yqs_lv).
-include("../include/comm.hrl").

-export([get/1,get_list/0]).

% get(成长类型,等级);
% 摇钱树等级数据;
% 
get(1)->
	#d_clan_yqs_lv{
		yqs_lv       = 1,               %% 等级
		yqs_exp      = 0,               %% 当前等级下限值
		yqs_exp_up   = 3750,            %% 下一级升级值
		times        = 2,               %% 互动次数
		rewards      = [{{give,48021,2,0,0,0,0,0},5000},{{give,48081,1,0,0,0,0,0},4000},{{give,48111,1,0,0,0,0,0},1000}]%% 摇钱奖励
	};
get(2)->
	#d_clan_yqs_lv{
		yqs_lv       = 2,               %% 等级
		yqs_exp      = 3751,            %% 当前等级下限值
		yqs_exp_up   = 10950,           %% 下一级升级值
		times        = 3,               %% 互动次数
		rewards      = [{{give,48021,2,0,0,0,0,0},5000},{{give,48081,2,0,0,0,0,0},4000},{{give,48111,1,0,0,0,0,0},1000}]%% 摇钱奖励
	};
get(3)->
	#d_clan_yqs_lv{
		yqs_lv       = 3,               %% 等级
		yqs_exp      = 10951,           %% 当前等级下限值
		yqs_exp_up   = 26700,           %% 下一级升级值
		times        = 3,               %% 互动次数
		rewards      = [{{give,48021,3,0,0,0,0,0},5000},{{give,48081,2,0,0,0,0,0},4000},{{give,48111,1,0,0,0,0,0},1000}]%% 摇钱奖励
	};
get(4)->
	#d_clan_yqs_lv{
		yqs_lv       = 4,               %% 等级
		yqs_exp      = 26701,           %% 当前等级下限值
		yqs_exp_up   = 50700,           %% 下一级升级值
		times        = 4,               %% 互动次数
		rewards      = [{{give,48021,3,0,0,0,0,0},5000},{{give,48081,2,0,0,0,0,0},4000},{{give,48111,1,0,0,0,0,0},1000}]%% 摇钱奖励
	};
get(5)->
	#d_clan_yqs_lv{
		yqs_lv       = 5,               %% 等级
		yqs_exp      = 50701,           %% 当前等级下限值
		yqs_exp_up   = 104700,          %% 下一级升级值
		times        = 4,               %% 互动次数
		rewards      = [{{give,48021,4,0,0,0,0,0},5000},{{give,48081,2,0,0,0,0,0},4000},{{give,48111,1,0,0,0,0,0},1000}]%% 摇钱奖励
	};
get(6)->
	#d_clan_yqs_lv{
		yqs_lv       = 6,               %% 等级
		yqs_exp      = 104701,          %% 当前等级下限值
		yqs_exp_up   = 194700,          %% 下一级升级值
		times        = 4,               %% 互动次数
		rewards      = [{{give,48021,4,0,0,0,0,0},5000},{{give,48081,2,0,0,0,0,0},4000},{{give,48111,1,0,0,0,0,0},1000}]%% 摇钱奖励
	};
get(7)->
	#d_clan_yqs_lv{
		yqs_lv       = 7,               %% 等级
		yqs_exp      = 194701,          %% 当前等级下限值
		yqs_exp_up   = 374700,          %% 下一级升级值
		times        = 5,               %% 互动次数
		rewards      = [{{give,48021,4,0,0,0,0,0},5000},{{give,48081,2,0,0,0,0,0},4000},{{give,48111,1,0,0,0,0,0},1000}]%% 摇钱奖励
	};
get(8)->
	#d_clan_yqs_lv{
		yqs_lv       = 8,               %% 等级
		yqs_exp      = 374701,          %% 当前等级下限值
		yqs_exp_up   = 674700,          %% 下一级升级值
		times        = 5,               %% 互动次数
		rewards      = [{{give,48021,5,0,0,0,0,0},5000},{{give,48081,2,0,0,0,0,0},4000},{{give,48111,2,0,0,0,0,0},1000}]%% 摇钱奖励
	};
get(9)->
	#d_clan_yqs_lv{
		yqs_lv       = 9,               %% 等级
		yqs_exp      = 674701,          %% 当前等级下限值
		yqs_exp_up   = 1174700,         %% 下一级升级值
		times        = 5,               %% 互动次数
		rewards      = [{{give,48021,5,0,0,0,0,0},5000},{{give,48081,2,0,0,0,0,0},4000},{{give,48111,2,0,0,0,0,0},1000}]%% 摇钱奖励
	};
get(10)->
	#d_clan_yqs_lv{
		yqs_lv       = 10,              %% 等级
		yqs_exp      = 1174701,         %% 当前等级下限值
		yqs_exp_up   = 1974700,         %% 下一级升级值
		times        = 5,               %% 互动次数
		rewards      = [{{give,48021,5,0,0,0,0,0},5000},{{give,48081,2,0,0,0,0,0},4000},{{give,48111,2,0,0,0,0,0},1000}]%% 摇钱奖励
	};
get(_)->?null.

get_list()->[1,2,3,4,5,6,7,8,9,10].
