-module(data_battle_ai).
-include("../include/comm.hrl").

-export([get/1]).

% get();
% 战斗AI设置;
% 技能发生概率计算：单个技能概率/所用技能概率总和
get(10001)->
	#d_battle_ai{
		ai_id        = 10001,           %% 11QQ
		reaction_time = 0.1,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 0.1,          %% 攻击间隔时间（秒）
		attack_skill = [{10010,10011,0,7000,{200,30,200}},{10014,0,0,1000,{200,30,200}},{10015,0,0,1000,{300,30,200}},{10016,0,0,1000,{300,30,200}}],%% 攻击策略所用技能
		get_up_skill = [{10010,10011,0,7000,{200,30,200}},{10014,0,0,1000,{200,30,200}},{10015,0,0,1000,{300,30,200}},{10016,0,0,1000,{300,30,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [3,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10002)->
	#d_battle_ai{
		ai_id        = 10002,           %% 11QQ
		reaction_time = 0.1,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 0.1,          %% 攻击间隔时间（秒）
		attack_skill = [{10020,10021,0,7000,{200,30,300}},{10024,0,0,1000,{200,30,300}},{10025,0,0,1000,{300,30,300}},{10026,0,0,1000,{300,30,300}}],%% 攻击策略所用技能
		get_up_skill = [{10020,10021,0,7000,{200,30,300}},{10024,0,0,1000,{200,30,300}},{10025,0,0,1000,{300,30,300}},{10026,0,0,1000,{300,30,300}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [3,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10003)->
	#d_battle_ai{
		ai_id        = 10003,           %% 11QQ
		reaction_time = 0.1,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 0.1,          %% 攻击间隔时间（秒）
		attack_skill = [{10030,10031,0,7000,{200,30,300}},{10034,0,0,1000,{200,30,300}},{10035,0,0,1000,{300,30,300}},{10036,0,0,1000,{300,30,300}}],%% 攻击策略所用技能
		get_up_skill = [{10030,10031,0,7000,{200,30,300}},{10034,0,0,1000,{200,30,300}},{10035,0,0,1000,{300,30,300}},{10036,0,0,1000,{300,30,300}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [3,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10004)->
	#d_battle_ai{
		ai_id        = 10004,           %% 11QQ
		reaction_time = 0.1,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 0.1,          %% 攻击间隔时间（秒）
		attack_skill = [{10040,10041,0,7000,{200,30,200}},{10044,0,0,1000,{200,30,200}},{10045,0,0,1000,{300,30,200}},{10046,0,0,1000,{300,30,200}}],%% 攻击策略所用技能
		get_up_skill = [{10040,10041,0,7000,{200,30,200}},{10044,0,0,1000,{200,30,200}},{10045,0,0,1000,{300,30,200}},{10046,0,0,1000,{300,30,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [3,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10005)->
	#d_battle_ai{
		ai_id        = 10005,           %% 11QQ
		reaction_time = 0.1,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 0.1,          %% 攻击间隔时间（秒）
		attack_skill = [{10050,10051,0,7000,{200,30,300}},{10054,0,0,1000,{200,30,300}},{10055,0,0,1000,{300,30,300}},{10056,0,0,1000,{300,30,300}}],%% 攻击策略所用技能
		get_up_skill = [{10050,10051,0,7000,{200,30,300}},{10054,0,0,1000,{200,30,300}},{10055,0,0,1000,{300,30,300}},{10056,0,0,1000,{300,30,300}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [3,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10006)->
	#d_battle_ai{
		ai_id        = 10006,           %% 11QQ
		reaction_time = 0.1,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 0.1,          %% 攻击间隔时间（秒）
		attack_skill = [{10060,10061,0,7000,{200,30,300}},{10064,0,0,1000,{200,30,300}},{10065,0,0,1000,{300,30,300}},{10066,0,0,1000,{300,30,300}}],%% 攻击策略所用技能
		get_up_skill = [{10060,10061,0,7000,{200,30,300}},{10064,0,0,1000,{200,30,300}},{10065,0,0,1000,{300,30,300}},{10066,0,0,1000,{300,30,300}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [3,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10301)->
	#d_battle_ai{
		ai_id        = 10301,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13010,0,0,5000,{120,25,200}},{13011,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13010,0,0,5000,{120,25,200}},{13011,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10302)->
	#d_battle_ai{
		ai_id        = 10302,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13020,0,0,5000,{120,25,200}},{13021,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13020,0,0,5000,{120,25,200}},{13021,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10303)->
	#d_battle_ai{
		ai_id        = 10303,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13030,0,0,5000,{200,25,200}},{13031,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13030,0,0,5000,{200,25,200}},{13031,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10304)->
	#d_battle_ai{
		ai_id        = 10304,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13040,0,0,5000,{300,25,200}},{13041,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13040,0,0,5000,{300,25,200}},{13041,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10305)->
	#d_battle_ai{
		ai_id        = 10305,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13050,0,0,5000,{400,25,200}},{13051,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13050,0,0,5000,{400,25,200}},{13051,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10306)->
	#d_battle_ai{
		ai_id        = 10306,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13060,0,0,3000,{500,35,200}},{13061,0,0,3000,{500,35,200}},{13062,0,0,4000,{500,35,200}}],%% 攻击策略所用技能
		get_up_skill = [{13060,0,0,3000,{500,35,200}},{13061,0,0,3000,{500,35,200}},{13062,0,0,4000,{500,35,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10307)->
	#d_battle_ai{
		ai_id        = 10307,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13070,0,0,5000,{300,25,200}},{13071,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13070,0,0,5000,{300,25,200}},{13071,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10308)->
	#d_battle_ai{
		ai_id        = 10308,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13080,0,0,5000,{500,25,200}},{13081,0,0,5000,{500,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13080,0,0,5000,{500,25,200}},{13081,0,0,5000,{500,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10309)->
	#d_battle_ai{
		ai_id        = 10309,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13090,0,0,5000,{250,25,200}},{13091,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13090,0,0,5000,{250,25,200}},{13091,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10310)->
	#d_battle_ai{
		ai_id        = 10310,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13100,0,0,5000,{800,25,200}},{13101,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13100,0,0,5000,{800,25,200}},{13101,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10311)->
	#d_battle_ai{
		ai_id        = 10311,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13110,0,0,5000,{300,25,200}},{13111,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13110,0,0,5000,{300,25,200}},{13111,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10312)->
	#d_battle_ai{
		ai_id        = 10312,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13120,0,0,5000,{200,25,200}},{13121,0,0,5000,{600,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13120,0,0,5000,{200,25,200}},{13121,0,0,5000,{600,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10313)->
	#d_battle_ai{
		ai_id        = 10313,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13130,0,0,5000,{200,25,200}},{13131,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13130,0,0,5000,{200,25,200}},{13131,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10314)->
	#d_battle_ai{
		ai_id        = 10314,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13140,0,0,5000,{800,25,200}},{13141,0,0,5000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13140,0,0,5000,{800,25,200}},{13141,0,0,5000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10315)->
	#d_battle_ai{
		ai_id        = 10315,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13150,0,0,5000,{200,25,200}},{13151,0,0,5000,{600,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13150,0,0,5000,{200,25,200}},{13151,0,0,5000,{600,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10316)->
	#d_battle_ai{
		ai_id        = 10316,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13160,0,0,5000,{200,25,200}},{13161,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13160,0,0,5000,{200,25,200}},{13161,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10317)->
	#d_battle_ai{
		ai_id        = 10317,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13170,0,0,5000,{800,25,200}},{13171,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13170,0,0,5000,{800,25,200}},{13171,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10318)->
	#d_battle_ai{
		ai_id        = 10318,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13180,0,0,5000,{800,25,200}},{13181,0,0,5000,{600,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13180,0,0,5000,{800,25,200}},{13181,0,0,5000,{600,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10319)->
	#d_battle_ai{
		ai_id        = 10319,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13190,0,0,5000,{200,25,200}},{13191,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13190,0,0,5000,{200,25,200}},{13191,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10320)->
	#d_battle_ai{
		ai_id        = 10320,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13200,0,0,3000,{250,25,200}},{13201,0,0,3000,{250,25,200}},{13202,0,0,4000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13200,0,0,3000,{250,25,200}},{13201,0,0,3000,{250,25,200}},{13202,0,0,4000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10321)->
	#d_battle_ai{
		ai_id        = 10321,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13210,0,0,5000,{800,25,200}},{13211,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13210,0,0,5000,{800,25,200}},{13211,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10322)->
	#d_battle_ai{
		ai_id        = 10322,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13220,0,0,5000,{800,25,200}},{13221,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13220,0,0,5000,{800,25,200}},{13221,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10323)->
	#d_battle_ai{
		ai_id        = 10323,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13230,0,0,5000,{800,25,200}},{13231,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13230,0,0,5000,{800,25,200}},{13231,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10324)->
	#d_battle_ai{
		ai_id        = 10324,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13240,0,0,3000,{800,25,200}},{13241,0,0,3000,{400,25,200}},{13242,0,0,4000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13240,0,0,3000,{800,25,200}},{13241,0,0,3000,{400,25,200}},{13242,0,0,4000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10325)->
	#d_battle_ai{
		ai_id        = 10325,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13250,0,0,5000,{400,25,200}},{13251,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13250,0,0,5000,{400,25,200}},{13251,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10326)->
	#d_battle_ai{
		ai_id        = 10326,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13260,0,0,5000,{800,25,200}},{13261,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13260,0,0,5000,{800,25,200}},{13261,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10327)->
	#d_battle_ai{
		ai_id        = 10327,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13270,0,0,5000,{800,25,200}},{13271,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13270,0,0,5000,{800,25,200}},{13271,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10328)->
	#d_battle_ai{
		ai_id        = 10328,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13280,0,0,5000,{800,25,200}},{13281,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13280,0,0,5000,{800,25,200}},{13281,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10329)->
	#d_battle_ai{
		ai_id        = 10329,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13290,0,0,5000,{800,25,200}},{13291,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13290,0,0,5000,{800,25,200}},{13291,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10330)->
	#d_battle_ai{
		ai_id        = 10330,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13300,0,0,5000,{250,25,200}},{13301,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13300,0,0,5000,{250,25,200}},{13301,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10331)->
	#d_battle_ai{
		ai_id        = 10331,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13310,0,0,5000,{800,25,200}},{13311,0,0,5000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13310,0,0,5000,{800,25,200}},{13311,0,0,5000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10332)->
	#d_battle_ai{
		ai_id        = 10332,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13320,0,0,5000,{800,25,200}},{13321,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13320,0,0,5000,{800,25,200}},{13321,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10333)->
	#d_battle_ai{
		ai_id        = 10333,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13330,0,0,5000,{800,25,200}},{13331,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13330,0,0,5000,{800,25,200}},{13331,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10334)->
	#d_battle_ai{
		ai_id        = 10334,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13340,0,0,5000,{800,25,200}},{13341,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13340,0,0,5000,{800,25,200}},{13341,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10335)->
	#d_battle_ai{
		ai_id        = 10335,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13350,0,0,5000,{800,25,200}},{13351,0,0,5000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13350,0,0,5000,{800,25,200}},{13351,0,0,5000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10336)->
	#d_battle_ai{
		ai_id        = 10336,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13360,0,0,5000,{120,25,200}},{13361,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13360,0,0,5000,{120,25,200}},{13361,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10337)->
	#d_battle_ai{
		ai_id        = 10337,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13370,0,0,5000,{800,25,200}},{13371,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13370,0,0,5000,{800,25,200}},{13371,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10338)->
	#d_battle_ai{
		ai_id        = 10338,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13380,0,0,5000,{120,25,200}},{13381,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13380,0,0,5000,{120,25,200}},{13381,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10339)->
	#d_battle_ai{
		ai_id        = 10339,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13390,0,0,5000,{120,25,200}},{13391,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13390,0,0,5000,{120,25,200}},{13391,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10340)->
	#d_battle_ai{
		ai_id        = 10340,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13400,0,0,5000,{120,25,200}},{13401,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13400,0,0,5000,{120,25,200}},{13401,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10341)->
	#d_battle_ai{
		ai_id        = 10341,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13410,0,0,5000,{800,25,200}},{13411,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13410,0,0,5000,{800,25,200}},{13411,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10501)->
	#d_battle_ai{
		ai_id        = 10501,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15010,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15010,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10502)->
	#d_battle_ai{
		ai_id        = 10502,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15020,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15020,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10503)->
	#d_battle_ai{
		ai_id        = 10503,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15030,0,0,10000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15030,0,0,10000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 4000            %% 起身策略随机
	};
get(10504)->
	#d_battle_ai{
		ai_id        = 10504,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15040,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15040,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10505)->
	#d_battle_ai{
		ai_id        = 10505,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15050,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15050,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10506)->
	#d_battle_ai{
		ai_id        = 10506,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15060,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15060,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10507)->
	#d_battle_ai{
		ai_id        = 10507,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15070,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15070,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10508)->
	#d_battle_ai{
		ai_id        = 10508,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15080,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15080,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10509)->
	#d_battle_ai{
		ai_id        = 10509,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15090,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15090,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10510)->
	#d_battle_ai{
		ai_id        = 10510,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15100,0,0,10000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15100,0,0,10000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 4000            %% 起身策略随机
	};
get(10511)->
	#d_battle_ai{
		ai_id        = 10511,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15110,0,0,10000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15110,0,0,10000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 4000            %% 起身策略随机
	};
get(10512)->
	#d_battle_ai{
		ai_id        = 10512,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15120,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15120,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10513)->
	#d_battle_ai{
		ai_id        = 10513,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15130,0,0,10000,{500,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15130,0,0,10000,{500,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10514)->
	#d_battle_ai{
		ai_id        = 10514,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15140,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15140,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10515)->
	#d_battle_ai{
		ai_id        = 10515,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15150,0,0,10000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15150,0,0,10000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 4000            %% 起身策略随机
	};
get(10516)->
	#d_battle_ai{
		ai_id        = 10516,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15160,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15160,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10517)->
	#d_battle_ai{
		ai_id        = 10517,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15170,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15170,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10518)->
	#d_battle_ai{
		ai_id        = 10518,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15180,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15180,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10519)->
	#d_battle_ai{
		ai_id        = 10519,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15190,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15190,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10520)->
	#d_battle_ai{
		ai_id        = 10520,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15200,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15200,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(10521)->
	#d_battle_ai{
		ai_id        = 10521,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15210,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15210,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(50001)->
	#d_battle_ai{
		ai_id        = 50001,           %% 11QQ
		reaction_time = 0.3,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 0.1,          %% 攻击间隔时间（秒）
		attack_skill = [{10010,10011,0,7000,{200,30,200}},{10014,0,0,1000,{200,30,200}},{10015,0,0,1000,{300,30,200}},{10016,0,0,1000,{300,30,200}}],%% 攻击策略所用技能
		get_up_skill = [{10010,10011,0,7000,{200,30,200}},{10014,0,0,1000,{200,30,200}},{10015,0,0,1000,{300,30,200}},{10016,0,0,1000,{300,30,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(50002)->
	#d_battle_ai{
		ai_id        = 50002,           %% 11QQ
		reaction_time = 0.3,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 0.1,          %% 攻击间隔时间（秒）
		attack_skill = [{10020,10021,0,7000,{200,30,300}},{10024,0,0,1000,{200,30,300}},{10025,0,0,1000,{300,30,300}},{10026,0,0,1000,{300,30,300}}],%% 攻击策略所用技能
		get_up_skill = [{10020,10021,0,7000,{200,30,300}},{10024,0,0,1000,{200,30,300}},{10025,0,0,1000,{300,30,300}},{10026,0,0,1000,{300,30,300}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(50003)->
	#d_battle_ai{
		ai_id        = 50003,           %% 11QQ
		reaction_time = 0.3,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 0.1,          %% 攻击间隔时间（秒）
		attack_skill = [{10030,10031,0,7000,{200,30,300}},{10034,0,0,1000,{200,30,300}},{10035,0,0,1000,{300,30,300}},{10036,0,0,1000,{300,30,300}}],%% 攻击策略所用技能
		get_up_skill = [{10030,10031,0,7000,{200,30,300}},{10034,0,0,1000,{200,30,300}},{10035,0,0,1000,{300,30,300}},{10036,0,0,1000,{300,30,300}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(50004)->
	#d_battle_ai{
		ai_id        = 50004,           %% 11QQ
		reaction_time = 0.3,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 0.1,          %% 攻击间隔时间（秒）
		attack_skill = [{10040,10041,0,7000,{200,30,200}},{10044,0,0,1000,{200,30,200}},{10045,0,0,1000,{300,30,200}},{10046,0,0,1000,{300,30,200}}],%% 攻击策略所用技能
		get_up_skill = [{10040,10041,0,7000,{200,30,200}},{10044,0,0,1000,{200,30,200}},{10045,0,0,1000,{300,30,200}},{10046,0,0,1000,{300,30,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(50005)->
	#d_battle_ai{
		ai_id        = 50005,           %% 11QQ
		reaction_time = 0.3,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 0.1,          %% 攻击间隔时间（秒）
		attack_skill = [{10050,10051,0,7000,{200,30,300}},{10054,0,0,1000,{200,30,300}},{10055,0,0,1000,{300,30,300}},{10056,0,0,1000,{300,30,300}}],%% 攻击策略所用技能
		get_up_skill = [{10050,10051,0,7000,{200,30,300}},{10054,0,0,1000,{200,30,300}},{10055,0,0,1000,{300,30,300}},{10056,0,0,1000,{300,30,300}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(50006)->
	#d_battle_ai{
		ai_id        = 50006,           %% 11QQ
		reaction_time = 0.3,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 0.1,          %% 攻击间隔时间（秒）
		attack_skill = [{10060,10061,0,7000,{200,30,300}},{10064,0,0,1000,{200,30,300}},{10065,0,0,1000,{300,30,300}},{10066,0,0,1000,{300,30,300}}],%% 攻击策略所用技能
		get_up_skill = [{10060,10061,0,7000,{200,30,300}},{10064,0,0,1000,{200,30,300}},{10065,0,0,1000,{300,30,300}},{10066,0,0,1000,{300,30,300}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10402)->
	#d_battle_ai{
		ai_id        = 10402,           %% 11QQ
		reaction_time = 0.9,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{14020,0,0,5000,{120,25,200}},{14021,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{14020,0,0,5000,{120,25,200}},{14021,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10403)->
	#d_battle_ai{
		ai_id        = 10403,           %% 11QQ
		reaction_time = 0.9,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{14030,0,0,5000,{200,25,200}},{14031,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{14030,0,0,5000,{200,25,200}},{14031,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10407)->
	#d_battle_ai{
		ai_id        = 10407,           %% 11QQ
		reaction_time = 0.9,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{14070,0,0,5000,{300,25,200}},{14071,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{14070,0,0,5000,{300,25,200}},{14071,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10409)->
	#d_battle_ai{
		ai_id        = 10409,           %% 11QQ
		reaction_time = 0.8,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{14090,0,0,5000,{250,25,200}},{14091,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{14090,0,0,5000,{250,25,200}},{14091,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10414)->
	#d_battle_ai{
		ai_id        = 10414,           %% 11QQ
		reaction_time = 0.8,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{14140,0,0,5000,{800,25,200}},{14141,0,0,5000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{14140,0,0,5000,{800,25,200}},{14141,0,0,5000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10412)->
	#d_battle_ai{
		ai_id        = 10412,           %% 11QQ
		reaction_time = 0.8,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{14120,0,0,5000,{200,25,200}},{14121,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{14120,0,0,5000,{200,25,200}},{14121,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10425)->
	#d_battle_ai{
		ai_id        = 10425,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{14250,0,0,5000,{120,25,200}},{14251,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{14250,0,0,5000,{120,25,200}},{14251,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10428)->
	#d_battle_ai{
		ai_id        = 10428,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{14280,0,0,5000,{800,25,200}},{14281,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{14280,0,0,5000,{800,25,200}},{14281,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10432)->
	#d_battle_ai{
		ai_id        = 10432,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{14320,0,0,5000,{800,25,200}},{14321,0,0,5000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{14320,0,0,5000,{800,25,200}},{14321,0,0,5000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10435)->
	#d_battle_ai{
		ai_id        = 10435,           %% 11QQ
		reaction_time = 0.5,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{14350,0,0,5000,{450,25,200}},{14351,0,0,5000,{450,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{14350,0,0,5000,{450,25,200}},{14351,0,0,5000,{450,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(10416)->
	#d_battle_ai{
		ai_id        = 10416,           %% 11QQ
		reaction_time = 0.5,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{14160,0,0,5000,{300,25,200}},{14161,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{14160,0,0,5000,{300,25,200}},{14161,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [4,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(60000)->
	#d_battle_ai{
		ai_id        = 60000,           %% 11QQ
		reaction_time = 1,              %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13410,0,0,5000,{800,25,200}},{13411,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13410,0,0,5000,{800,25,200}},{13411,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(60001)->
	#d_battle_ai{
		ai_id        = 60001,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 5.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13010,0,0,5000,{120,25,200}},{13011,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13010,0,0,5000,{120,25,200}},{13011,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(60002)->
	#d_battle_ai{
		ai_id        = 60002,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 5.5,          %% 攻击间隔时间（秒）
		attack_skill = [{13100,0,0,5000,{800,25,200}},{13101,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13100,0,0,5000,{800,25,200}},{13101,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11301)->
	#d_battle_ai{
		ai_id        = 11301,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13010,0,0,5000,{120,25,200}},{13011,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13010,0,0,5000,{120,25,200}},{13011,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11302)->
	#d_battle_ai{
		ai_id        = 11302,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13020,0,0,5000,{120,25,200}},{13021,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13020,0,0,5000,{120,25,200}},{13021,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11303)->
	#d_battle_ai{
		ai_id        = 11303,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13030,0,0,5000,{200,25,200}},{13031,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13030,0,0,5000,{200,25,200}},{13031,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11304)->
	#d_battle_ai{
		ai_id        = 11304,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13040,0,0,5000,{300,25,200}},{13041,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13040,0,0,5000,{300,25,200}},{13041,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11305)->
	#d_battle_ai{
		ai_id        = 11305,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13050,0,0,5000,{400,25,200}},{13051,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13050,0,0,5000,{400,25,200}},{13051,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11306)->
	#d_battle_ai{
		ai_id        = 11306,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13060,0,0,3000,{500,35,200}},{13061,0,0,3000,{500,35,200}},{13062,0,0,4000,{500,35,200}}],%% 攻击策略所用技能
		get_up_skill = [{13060,0,0,3000,{500,35,200}},{13061,0,0,3000,{500,35,200}},{13062,0,0,4000,{500,35,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11307)->
	#d_battle_ai{
		ai_id        = 11307,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13070,0,0,5000,{300,25,200}},{13071,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13070,0,0,5000,{300,25,200}},{13071,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11308)->
	#d_battle_ai{
		ai_id        = 11308,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13080,0,0,5000,{500,25,200}},{13081,0,0,5000,{500,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13080,0,0,5000,{500,25,200}},{13081,0,0,5000,{500,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11309)->
	#d_battle_ai{
		ai_id        = 11309,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13090,0,0,5000,{250,25,200}},{13091,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13090,0,0,5000,{250,25,200}},{13091,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11310)->
	#d_battle_ai{
		ai_id        = 11310,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13100,0,0,5000,{800,25,200}},{13101,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13100,0,0,5000,{800,25,200}},{13101,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11311)->
	#d_battle_ai{
		ai_id        = 11311,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13110,0,0,5000,{300,25,200}},{13111,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13110,0,0,5000,{300,25,200}},{13111,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11312)->
	#d_battle_ai{
		ai_id        = 11312,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13120,0,0,5000,{200,25,200}},{13121,0,0,5000,{600,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13120,0,0,5000,{200,25,200}},{13121,0,0,5000,{600,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11313)->
	#d_battle_ai{
		ai_id        = 11313,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13130,0,0,5000,{200,25,200}},{13131,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13130,0,0,5000,{200,25,200}},{13131,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11314)->
	#d_battle_ai{
		ai_id        = 11314,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13140,0,0,5000,{800,25,200}},{13141,0,0,5000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13140,0,0,5000,{800,25,200}},{13141,0,0,5000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11315)->
	#d_battle_ai{
		ai_id        = 11315,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13150,0,0,5000,{200,25,200}},{13151,0,0,5000,{600,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13150,0,0,5000,{200,25,200}},{13151,0,0,5000,{600,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11316)->
	#d_battle_ai{
		ai_id        = 11316,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13160,0,0,5000,{200,25,200}},{13161,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13160,0,0,5000,{200,25,200}},{13161,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11317)->
	#d_battle_ai{
		ai_id        = 11317,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13170,0,0,5000,{800,25,200}},{13171,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13170,0,0,5000,{800,25,200}},{13171,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11318)->
	#d_battle_ai{
		ai_id        = 11318,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13180,0,0,5000,{800,25,200}},{13181,0,0,5000,{600,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13180,0,0,5000,{800,25,200}},{13181,0,0,5000,{600,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11319)->
	#d_battle_ai{
		ai_id        = 11319,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13190,0,0,5000,{200,25,200}},{13191,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13190,0,0,5000,{200,25,200}},{13191,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11320)->
	#d_battle_ai{
		ai_id        = 11320,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13200,0,0,3000,{250,25,200}},{13201,0,0,3000,{250,25,200}},{13202,0,0,4000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13200,0,0,3000,{250,25,200}},{13201,0,0,3000,{250,25,200}},{13202,0,0,4000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11321)->
	#d_battle_ai{
		ai_id        = 11321,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13210,0,0,5000,{800,25,200}},{13211,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13210,0,0,5000,{800,25,200}},{13211,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11322)->
	#d_battle_ai{
		ai_id        = 11322,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13220,0,0,5000,{800,25,200}},{13221,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13220,0,0,5000,{800,25,200}},{13221,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11323)->
	#d_battle_ai{
		ai_id        = 11323,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13230,0,0,5000,{800,25,200}},{13231,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13230,0,0,5000,{800,25,200}},{13231,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11324)->
	#d_battle_ai{
		ai_id        = 11324,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13240,0,0,3000,{800,25,200}},{13241,0,0,3000,{400,25,200}},{13242,0,0,4000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13240,0,0,3000,{800,25,200}},{13241,0,0,3000,{400,25,200}},{13242,0,0,4000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11325)->
	#d_battle_ai{
		ai_id        = 11325,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13250,0,0,5000,{400,25,200}},{13251,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13250,0,0,5000,{400,25,200}},{13251,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11326)->
	#d_battle_ai{
		ai_id        = 11326,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13260,0,0,5000,{800,25,200}},{13261,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13260,0,0,5000,{800,25,200}},{13261,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11327)->
	#d_battle_ai{
		ai_id        = 11327,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13270,0,0,5000,{800,25,200}},{13271,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13270,0,0,5000,{800,25,200}},{13271,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11328)->
	#d_battle_ai{
		ai_id        = 11328,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13280,0,0,5000,{800,25,200}},{13281,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13280,0,0,5000,{800,25,200}},{13281,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11329)->
	#d_battle_ai{
		ai_id        = 11329,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13290,0,0,5000,{800,25,200}},{13291,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13290,0,0,5000,{800,25,200}},{13291,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11330)->
	#d_battle_ai{
		ai_id        = 11330,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13300,0,0,5000,{250,25,200}},{13301,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13300,0,0,5000,{250,25,200}},{13301,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11331)->
	#d_battle_ai{
		ai_id        = 11331,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13310,0,0,5000,{800,25,200}},{13311,0,0,5000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13310,0,0,5000,{800,25,200}},{13311,0,0,5000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11332)->
	#d_battle_ai{
		ai_id        = 11332,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13320,0,0,5000,{800,25,200}},{13321,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13320,0,0,5000,{800,25,200}},{13321,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11333)->
	#d_battle_ai{
		ai_id        = 11333,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13330,0,0,5000,{800,25,200}},{13331,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13330,0,0,5000,{800,25,200}},{13331,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11334)->
	#d_battle_ai{
		ai_id        = 11334,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13340,0,0,5000,{800,25,200}},{13341,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13340,0,0,5000,{800,25,200}},{13341,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11335)->
	#d_battle_ai{
		ai_id        = 11335,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13350,0,0,5000,{800,25,200}},{13351,0,0,5000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13350,0,0,5000,{800,25,200}},{13351,0,0,5000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11336)->
	#d_battle_ai{
		ai_id        = 11336,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13360,0,0,5000,{120,25,200}},{13361,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13360,0,0,5000,{120,25,200}},{13361,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11337)->
	#d_battle_ai{
		ai_id        = 11337,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13370,0,0,5000,{800,25,200}},{13371,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13370,0,0,5000,{800,25,200}},{13371,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11338)->
	#d_battle_ai{
		ai_id        = 11338,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13380,0,0,5000,{120,25,200}},{13381,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13380,0,0,5000,{120,25,200}},{13381,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11339)->
	#d_battle_ai{
		ai_id        = 11339,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13390,0,0,5000,{120,25,200}},{13391,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13390,0,0,5000,{120,25,200}},{13391,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11340)->
	#d_battle_ai{
		ai_id        = 11340,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13400,0,0,5000,{120,25,200}},{13401,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13400,0,0,5000,{120,25,200}},{13401,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11341)->
	#d_battle_ai{
		ai_id        = 11341,           %% 11QQ
		reaction_time = 0.6,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2,            %% 攻击间隔时间（秒）
		attack_skill = [{13410,0,0,5000,{800,25,200}},{13411,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13410,0,0,5000,{800,25,200}},{13411,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,3,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11501)->
	#d_battle_ai{
		ai_id        = 11501,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15010,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15010,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11502)->
	#d_battle_ai{
		ai_id        = 11502,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15020,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15020,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11503)->
	#d_battle_ai{
		ai_id        = 11503,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15030,0,0,10000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15030,0,0,10000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 4000            %% 起身策略随机
	};
get(11504)->
	#d_battle_ai{
		ai_id        = 11504,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15040,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15040,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11505)->
	#d_battle_ai{
		ai_id        = 11505,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15050,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15050,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11506)->
	#d_battle_ai{
		ai_id        = 11506,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15060,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15060,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11507)->
	#d_battle_ai{
		ai_id        = 11507,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15070,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15070,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11508)->
	#d_battle_ai{
		ai_id        = 11508,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15080,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15080,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11509)->
	#d_battle_ai{
		ai_id        = 11509,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15090,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15090,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11510)->
	#d_battle_ai{
		ai_id        = 11510,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15100,0,0,10000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15100,0,0,10000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 4000            %% 起身策略随机
	};
get(11511)->
	#d_battle_ai{
		ai_id        = 11511,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15110,0,0,10000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15110,0,0,10000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 4000            %% 起身策略随机
	};
get(11512)->
	#d_battle_ai{
		ai_id        = 11512,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15120,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15120,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11513)->
	#d_battle_ai{
		ai_id        = 11513,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15130,0,0,10000,{500,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15130,0,0,10000,{500,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(11514)->
	#d_battle_ai{
		ai_id        = 11514,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15140,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15140,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11515)->
	#d_battle_ai{
		ai_id        = 11515,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15150,0,0,10000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15150,0,0,10000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 4000            %% 起身策略随机
	};
get(11516)->
	#d_battle_ai{
		ai_id        = 11516,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15160,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15160,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11517)->
	#d_battle_ai{
		ai_id        = 11517,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15170,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15170,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11518)->
	#d_battle_ai{
		ai_id        = 11518,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15180,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15180,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11519)->
	#d_battle_ai{
		ai_id        = 11519,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15190,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15190,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11520)->
	#d_battle_ai{
		ai_id        = 11520,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15200,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15200,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(11521)->
	#d_battle_ai{
		ai_id        = 11521,           %% 11QQ
		reaction_time = 0.7,            %% 反应时间（秒）
		view         = 2000,            %% 视野范围半径（象素）
		attack_interval = 2.5,          %% 攻击间隔时间（秒）
		attack_skill = [{15210,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{15210,0,0,10000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,4,4,4],       %% 随机类型
		rand_x       = 600,             %% 随机x
		rand_y       = 120,             %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12301)->
	#d_battle_ai{
		ai_id        = 12301,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13010,0,0,5000,{120,25,200}},{13011,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13010,0,0,5000,{120,25,200}},{13011,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12302)->
	#d_battle_ai{
		ai_id        = 12302,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13020,0,0,5000,{120,25,200}},{13021,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13020,0,0,5000,{120,25,200}},{13021,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12303)->
	#d_battle_ai{
		ai_id        = 12303,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13030,0,0,5000,{200,25,200}},{13031,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13030,0,0,5000,{200,25,200}},{13031,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12304)->
	#d_battle_ai{
		ai_id        = 12304,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13040,0,0,5000,{300,25,200}},{13041,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13040,0,0,5000,{300,25,200}},{13041,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12305)->
	#d_battle_ai{
		ai_id        = 12305,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13050,0,0,5000,{400,25,200}},{13051,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13050,0,0,5000,{400,25,200}},{13051,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12306)->
	#d_battle_ai{
		ai_id        = 12306,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13060,0,0,3000,{500,35,200}},{13061,0,0,3000,{500,35,200}},{13062,0,0,4000,{500,35,200}}],%% 攻击策略所用技能
		get_up_skill = [{13060,0,0,3000,{500,35,200}},{13061,0,0,3000,{500,35,200}},{13062,0,0,4000,{500,35,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12307)->
	#d_battle_ai{
		ai_id        = 12307,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13070,0,0,5000,{300,25,200}},{13071,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13070,0,0,5000,{300,25,200}},{13071,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12308)->
	#d_battle_ai{
		ai_id        = 12308,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13080,0,0,5000,{500,25,200}},{13081,0,0,5000,{500,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13080,0,0,5000,{500,25,200}},{13081,0,0,5000,{500,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12309)->
	#d_battle_ai{
		ai_id        = 12309,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13090,0,0,5000,{250,25,200}},{13091,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13090,0,0,5000,{250,25,200}},{13091,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12310)->
	#d_battle_ai{
		ai_id        = 12310,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13100,0,0,5000,{800,25,200}},{13101,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13100,0,0,5000,{800,25,200}},{13101,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12311)->
	#d_battle_ai{
		ai_id        = 12311,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13110,0,0,5000,{300,25,200}},{13111,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13110,0,0,5000,{300,25,200}},{13111,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12312)->
	#d_battle_ai{
		ai_id        = 12312,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13120,0,0,5000,{200,25,200}},{13121,0,0,5000,{600,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13120,0,0,5000,{200,25,200}},{13121,0,0,5000,{600,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12313)->
	#d_battle_ai{
		ai_id        = 12313,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13130,0,0,5000,{200,25,200}},{13131,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13130,0,0,5000,{200,25,200}},{13131,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12314)->
	#d_battle_ai{
		ai_id        = 12314,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13140,0,0,5000,{800,25,200}},{13141,0,0,5000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13140,0,0,5000,{800,25,200}},{13141,0,0,5000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12315)->
	#d_battle_ai{
		ai_id        = 12315,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13150,0,0,5000,{200,25,200}},{13151,0,0,5000,{600,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13150,0,0,5000,{200,25,200}},{13151,0,0,5000,{600,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12316)->
	#d_battle_ai{
		ai_id        = 12316,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13160,0,0,5000,{200,25,200}},{13161,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13160,0,0,5000,{200,25,200}},{13161,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12317)->
	#d_battle_ai{
		ai_id        = 12317,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13170,0,0,5000,{800,25,200}},{13171,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13170,0,0,5000,{800,25,200}},{13171,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12318)->
	#d_battle_ai{
		ai_id        = 12318,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13180,0,0,5000,{800,25,200}},{13181,0,0,5000,{600,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13180,0,0,5000,{800,25,200}},{13181,0,0,5000,{600,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12319)->
	#d_battle_ai{
		ai_id        = 12319,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13190,0,0,5000,{200,25,200}},{13191,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13190,0,0,5000,{200,25,200}},{13191,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12320)->
	#d_battle_ai{
		ai_id        = 12320,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13200,0,0,3000,{250,25,200}},{13201,0,0,3000,{250,25,200}},{13202,0,0,4000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13200,0,0,3000,{250,25,200}},{13201,0,0,3000,{250,25,200}},{13202,0,0,4000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12321)->
	#d_battle_ai{
		ai_id        = 12321,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13210,0,0,5000,{800,25,200}},{13211,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13210,0,0,5000,{800,25,200}},{13211,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12322)->
	#d_battle_ai{
		ai_id        = 12322,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13220,0,0,5000,{800,25,200}},{13221,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13220,0,0,5000,{800,25,200}},{13221,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12323)->
	#d_battle_ai{
		ai_id        = 12323,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13230,0,0,5000,{800,25,200}},{13231,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13230,0,0,5000,{800,25,200}},{13231,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12324)->
	#d_battle_ai{
		ai_id        = 12324,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13240,0,0,3000,{800,25,200}},{13241,0,0,3000,{400,25,200}},{13242,0,0,4000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13240,0,0,3000,{800,25,200}},{13241,0,0,3000,{400,25,200}},{13242,0,0,4000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12325)->
	#d_battle_ai{
		ai_id        = 12325,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13250,0,0,5000,{400,25,200}},{13251,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13250,0,0,5000,{400,25,200}},{13251,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12326)->
	#d_battle_ai{
		ai_id        = 12326,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13260,0,0,5000,{800,25,200}},{13261,0,0,5000,{200,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13260,0,0,5000,{800,25,200}},{13261,0,0,5000,{200,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12327)->
	#d_battle_ai{
		ai_id        = 12327,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13270,0,0,5000,{800,25,200}},{13271,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13270,0,0,5000,{800,25,200}},{13271,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12328)->
	#d_battle_ai{
		ai_id        = 12328,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13280,0,0,5000,{800,25,200}},{13281,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13280,0,0,5000,{800,25,200}},{13281,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12329)->
	#d_battle_ai{
		ai_id        = 12329,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13290,0,0,5000,{800,25,200}},{13291,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13290,0,0,5000,{800,25,200}},{13291,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12330)->
	#d_battle_ai{
		ai_id        = 12330,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13300,0,0,5000,{250,25,200}},{13301,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13300,0,0,5000,{250,25,200}},{13301,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12331)->
	#d_battle_ai{
		ai_id        = 12331,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13310,0,0,5000,{800,25,200}},{13311,0,0,5000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13310,0,0,5000,{800,25,200}},{13311,0,0,5000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12332)->
	#d_battle_ai{
		ai_id        = 12332,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13320,0,0,5000,{800,25,200}},{13321,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13320,0,0,5000,{800,25,200}},{13321,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12333)->
	#d_battle_ai{
		ai_id        = 12333,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13330,0,0,5000,{800,25,200}},{13331,0,0,5000,{250,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13330,0,0,5000,{800,25,200}},{13331,0,0,5000,{250,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12334)->
	#d_battle_ai{
		ai_id        = 12334,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13340,0,0,5000,{800,25,200}},{13341,0,0,5000,{300,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13340,0,0,5000,{800,25,200}},{13341,0,0,5000,{300,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12335)->
	#d_battle_ai{
		ai_id        = 12335,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13350,0,0,5000,{800,25,200}},{13351,0,0,5000,{400,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13350,0,0,5000,{800,25,200}},{13351,0,0,5000,{400,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12336)->
	#d_battle_ai{
		ai_id        = 12336,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13360,0,0,5000,{120,25,200}},{13361,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13360,0,0,5000,{120,25,200}},{13361,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12337)->
	#d_battle_ai{
		ai_id        = 12337,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13370,0,0,5000,{800,25,200}},{13371,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13370,0,0,5000,{800,25,200}},{13371,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12338)->
	#d_battle_ai{
		ai_id        = 12338,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13380,0,0,5000,{120,25,200}},{13381,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13380,0,0,5000,{120,25,200}},{13381,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12339)->
	#d_battle_ai{
		ai_id        = 12339,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13390,0,0,5000,{120,25,200}},{13391,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13390,0,0,5000,{120,25,200}},{13391,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12340)->
	#d_battle_ai{
		ai_id        = 12340,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13400,0,0,5000,{120,25,200}},{13401,0,0,5000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13400,0,0,5000,{120,25,200}},{13401,0,0,5000,{120,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12341)->
	#d_battle_ai{
		ai_id        = 12341,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{13410,0,0,5000,{800,25,200}},{13411,0,0,5000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [{13410,0,0,5000,{800,25,200}},{13411,0,0,5000,{800,25,200}}],%% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12501)->
	#d_battle_ai{
		ai_id        = 12501,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15010,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12502)->
	#d_battle_ai{
		ai_id        = 12502,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15020,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12503)->
	#d_battle_ai{
		ai_id        = 12503,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15030,0,0,10000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 4000            %% 起身策略随机
	};
get(12504)->
	#d_battle_ai{
		ai_id        = 12504,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15040,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12505)->
	#d_battle_ai{
		ai_id        = 12505,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15050,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12506)->
	#d_battle_ai{
		ai_id        = 12506,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15060,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12507)->
	#d_battle_ai{
		ai_id        = 12507,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15070,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12508)->
	#d_battle_ai{
		ai_id        = 12508,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15080,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12509)->
	#d_battle_ai{
		ai_id        = 12509,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15090,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12510)->
	#d_battle_ai{
		ai_id        = 12510,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15100,0,0,10000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 4000            %% 起身策略随机
	};
get(12511)->
	#d_battle_ai{
		ai_id        = 12511,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15110,0,0,10000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 4000            %% 起身策略随机
	};
get(12512)->
	#d_battle_ai{
		ai_id        = 12512,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15120,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12513)->
	#d_battle_ai{
		ai_id        = 12513,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15130,0,0,10000,{500,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 0               %% 起身策略随机
	};
get(12514)->
	#d_battle_ai{
		ai_id        = 12514,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15140,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12515)->
	#d_battle_ai{
		ai_id        = 12515,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15150,0,0,10000,{800,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 4000            %% 起身策略随机
	};
get(12516)->
	#d_battle_ai{
		ai_id        = 12516,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15160,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12517)->
	#d_battle_ai{
		ai_id        = 12517,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15170,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12518)->
	#d_battle_ai{
		ai_id        = 12518,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15180,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12519)->
	#d_battle_ai{
		ai_id        = 12519,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15190,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12520)->
	#d_battle_ai{
		ai_id        = 12520,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15200,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(12521)->
	#d_battle_ai{
		ai_id        = 12521,           %% 11QQ
		reaction_time = 3,              %% 反应时间（秒）
		view         = 300,             %% 视野范围半径（象素）
		attack_interval = 3,            %% 攻击间隔时间（秒）
		attack_skill = [{15210,0,0,10000,{120,25,200}}],%% 攻击策略所用技能
		get_up_skill = [],              %% 起身策略所用技能
		is_area      = 1,               %% 是否产生特殊区域
		special_area = {0,0,100,50,2000},%% 特殊区域范围
		rand_type    = [1,1,1,1],       %% 随机类型
		rand_x       = 0,               %% 随机x
		rand_y       = 0,               %% 随机y
		get_up_rand  = 7500            %% 起身策略随机
	};
get(_)->?null.
