-module(data_equip_enchant).
-include("../include/comm.hrl").

-export([get/2]).

% 
get(11,1)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 1,               %% 增加百分比
		step_value   = 50,              %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,2)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 2,               %% 增加百分比
		step_value   = 100,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,3)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 3,               %% 增加百分比
		step_value   = 150,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,4)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 4,               %% 增加百分比
		step_value   = 200,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,5)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 5,               %% 增加百分比
		step_value   = 250,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,6)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 6,               %% 增加百分比
		step_value   = 300,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,7)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 7,               %% 增加百分比
		step_value   = 350,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,8)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 8,               %% 增加百分比
		step_value   = 400,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,9)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 9,               %% 增加百分比
		step_value   = 450,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,10)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 10,              %% 增加百分比
		step_value   = 500,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,11)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 11,              %% 增加百分比
		step_value   = 550,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,12)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 12,              %% 增加百分比
		step_value   = 600,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,13)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 13,              %% 增加百分比
		step_value   = 650,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,14)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 14,              %% 增加百分比
		step_value   = 700,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,15)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 15,              %% 增加百分比
		step_value   = 750,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,16)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 16,              %% 增加百分比
		step_value   = 800,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,17)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 17,              %% 增加百分比
		step_value   = 850,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,18)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 18,              %% 增加百分比
		step_value   = 900,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,19)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 19,              %% 增加百分比
		step_value   = 950,             %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,20)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 20,              %% 增加百分比
		step_value   = 1000,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,21)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 21,              %% 增加百分比
		step_value   = 1100,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,22)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 22,              %% 增加百分比
		step_value   = 1200,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,23)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 23,              %% 增加百分比
		step_value   = 1300,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,24)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 24,              %% 增加百分比
		step_value   = 1400,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,25)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 25,              %% 增加百分比
		step_value   = 1500,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,26)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 26,              %% 增加百分比
		step_value   = 1600,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,27)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 27,              %% 增加百分比
		step_value   = 1700,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,28)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 28,              %% 增加百分比
		step_value   = 1800,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,29)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 29,              %% 增加百分比
		step_value   = 1900,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,30)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 30,              %% 增加百分比
		step_value   = 2000,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,31)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 31,              %% 增加百分比
		step_value   = 2100,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,32)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 32,              %% 增加百分比
		step_value   = 2200,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,33)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 33,              %% 增加百分比
		step_value   = 2300,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,34)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 34,              %% 增加百分比
		step_value   = 2400,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,35)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 35,              %% 增加百分比
		step_value   = 2500,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,36)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 36,              %% 增加百分比
		step_value   = 2600,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,37)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 37,              %% 增加百分比
		step_value   = 2700,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,38)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 38,              %% 增加百分比
		step_value   = 2800,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,39)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 39,              %% 增加百分比
		step_value   = 2900,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,40)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 40,              %% 增加百分比
		step_value   = 3000,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,41)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 41,              %% 增加百分比
		step_value   = 3200,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,42)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 42,              %% 增加百分比
		step_value   = 3400,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,43)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 43,              %% 增加百分比
		step_value   = 3600,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,44)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 44,              %% 增加百分比
		step_value   = 3800,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,45)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 45,              %% 增加百分比
		step_value   = 4000,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,46)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 46,              %% 增加百分比
		step_value   = 4200,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,47)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 47,              %% 增加百分比
		step_value   = 4400,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,48)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 48,              %% 增加百分比
		step_value   = 4600,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,49)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 49,              %% 增加百分比
		step_value   = 4800,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,50)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 50,              %% 增加百分比
		step_value   = 5000,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,51)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 51,              %% 增加百分比
		step_value   = 5200,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,52)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 52,              %% 增加百分比
		step_value   = 5400,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,53)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 53,              %% 增加百分比
		step_value   = 5600,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,54)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 54,              %% 增加百分比
		step_value   = 5800,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,55)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 55,              %% 增加百分比
		step_value   = 6000,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,56)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 56,              %% 增加百分比
		step_value   = 6200,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,57)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 57,              %% 增加百分比
		step_value   = 6400,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,58)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 58,              %% 增加百分比
		step_value   = 6600,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,59)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 59,              %% 增加百分比
		step_value   = 6800,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,60)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 60,              %% 增加百分比
		step_value   = 7000,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,61)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 61,              %% 增加百分比
		step_value   = 7200,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,62)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 62,              %% 增加百分比
		step_value   = 7400,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,63)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 63,              %% 增加百分比
		step_value   = 7600,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,64)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 64,              %% 增加百分比
		step_value   = 7800,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,65)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 65,              %% 增加百分比
		step_value   = 8000,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,66)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 66,              %% 增加百分比
		step_value   = 8200,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,67)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 67,              %% 增加百分比
		step_value   = 8400,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,68)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 68,              %% 增加百分比
		step_value   = 8600,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,69)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 69,              %% 增加百分比
		step_value   = 8800,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,70)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 70,              %% 增加百分比
		step_value   = 9000,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,71)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 71,              %% 增加百分比
		step_value   = 9200,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,72)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 72,              %% 增加百分比
		step_value   = 9400,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,73)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 73,              %% 增加百分比
		step_value   = 9600,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,74)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 74,              %% 增加百分比
		step_value   = 9800,            %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,75)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 75,              %% 增加百分比
		step_value   = 10000,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,76)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 76,              %% 增加百分比
		step_value   = 10200,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,77)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 77,              %% 增加百分比
		step_value   = 10400,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,78)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 78,              %% 增加百分比
		step_value   = 10600,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,79)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 79,              %% 增加百分比
		step_value   = 10800,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,80)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 80,              %% 增加百分比
		step_value   = 11000,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,81)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 81,              %% 增加百分比
		step_value   = 11200,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,82)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 82,              %% 增加百分比
		step_value   = 11400,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,83)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 83,              %% 增加百分比
		step_value   = 11600,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,84)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 84,              %% 增加百分比
		step_value   = 11800,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,85)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 85,              %% 增加百分比
		step_value   = 12000,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,86)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 86,              %% 增加百分比
		step_value   = 12200,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,87)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 87,              %% 增加百分比
		step_value   = 12400,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,88)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 88,              %% 增加百分比
		step_value   = 12600,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,89)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 89,              %% 增加百分比
		step_value   = 12800,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,90)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 90,              %% 增加百分比
		step_value   = 13000,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,91)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 91,              %% 增加百分比
		step_value   = 13200,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,92)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 92,              %% 增加百分比
		step_value   = 13400,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,93)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 93,              %% 增加百分比
		step_value   = 13600,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,94)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 94,              %% 增加百分比
		step_value   = 13800,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,95)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 95,              %% 增加百分比
		step_value   = 14000,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,96)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 96,              %% 增加百分比
		step_value   = 14200,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,97)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 97,              %% 增加百分比
		step_value   = 14400,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,98)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 98,              %% 增加百分比
		step_value   = 14600,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,99)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 99,              %% 增加百分比
		step_value   = 14800,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(11,100)->
	#d_enchant{
		type_sub     = 11,              %% 装备子类型
		step         = 100,             %% 增加百分比
		step_value   = 15000,           %% 升阶值
		goods        = 34005,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,1)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 1,               %% 增加百分比
		step_value   = 50,              %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,2)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 2,               %% 增加百分比
		step_value   = 100,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,3)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 3,               %% 增加百分比
		step_value   = 150,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,4)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 4,               %% 增加百分比
		step_value   = 200,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,5)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 5,               %% 增加百分比
		step_value   = 250,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,6)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 6,               %% 增加百分比
		step_value   = 300,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,7)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 7,               %% 增加百分比
		step_value   = 350,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,8)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 8,               %% 增加百分比
		step_value   = 400,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,9)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 9,               %% 增加百分比
		step_value   = 450,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,10)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 10,              %% 增加百分比
		step_value   = 500,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,11)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 11,              %% 增加百分比
		step_value   = 550,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,12)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 12,              %% 增加百分比
		step_value   = 600,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,13)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 13,              %% 增加百分比
		step_value   = 650,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,14)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 14,              %% 增加百分比
		step_value   = 700,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,15)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 15,              %% 增加百分比
		step_value   = 750,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,16)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 16,              %% 增加百分比
		step_value   = 800,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,17)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 17,              %% 增加百分比
		step_value   = 850,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,18)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 18,              %% 增加百分比
		step_value   = 900,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,19)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 19,              %% 增加百分比
		step_value   = 950,             %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,20)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 20,              %% 增加百分比
		step_value   = 1000,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,21)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 21,              %% 增加百分比
		step_value   = 1100,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,22)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 22,              %% 增加百分比
		step_value   = 1200,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,23)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 23,              %% 增加百分比
		step_value   = 1300,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,24)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 24,              %% 增加百分比
		step_value   = 1400,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,25)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 25,              %% 增加百分比
		step_value   = 1500,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,26)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 26,              %% 增加百分比
		step_value   = 1600,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,27)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 27,              %% 增加百分比
		step_value   = 1700,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,28)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 28,              %% 增加百分比
		step_value   = 1800,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,29)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 29,              %% 增加百分比
		step_value   = 1900,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,30)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 30,              %% 增加百分比
		step_value   = 2000,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,31)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 31,              %% 增加百分比
		step_value   = 2100,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,32)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 32,              %% 增加百分比
		step_value   = 2200,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,33)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 33,              %% 增加百分比
		step_value   = 2300,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,34)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 34,              %% 增加百分比
		step_value   = 2400,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,35)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 35,              %% 增加百分比
		step_value   = 2500,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,36)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 36,              %% 增加百分比
		step_value   = 2600,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,37)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 37,              %% 增加百分比
		step_value   = 2700,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,38)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 38,              %% 增加百分比
		step_value   = 2800,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,39)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 39,              %% 增加百分比
		step_value   = 2900,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,40)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 40,              %% 增加百分比
		step_value   = 3000,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,41)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 41,              %% 增加百分比
		step_value   = 3200,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,42)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 42,              %% 增加百分比
		step_value   = 3400,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,43)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 43,              %% 增加百分比
		step_value   = 3600,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,44)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 44,              %% 增加百分比
		step_value   = 3800,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,45)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 45,              %% 增加百分比
		step_value   = 4000,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,46)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 46,              %% 增加百分比
		step_value   = 4200,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,47)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 47,              %% 增加百分比
		step_value   = 4400,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,48)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 48,              %% 增加百分比
		step_value   = 4600,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,49)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 49,              %% 增加百分比
		step_value   = 4800,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,50)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 50,              %% 增加百分比
		step_value   = 5000,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,51)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 51,              %% 增加百分比
		step_value   = 5200,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,52)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 52,              %% 增加百分比
		step_value   = 5400,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,53)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 53,              %% 增加百分比
		step_value   = 5600,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,54)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 54,              %% 增加百分比
		step_value   = 5800,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,55)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 55,              %% 增加百分比
		step_value   = 6000,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,56)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 56,              %% 增加百分比
		step_value   = 6200,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,57)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 57,              %% 增加百分比
		step_value   = 6400,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,58)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 58,              %% 增加百分比
		step_value   = 6600,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,59)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 59,              %% 增加百分比
		step_value   = 6800,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,60)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 60,              %% 增加百分比
		step_value   = 7000,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,61)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 61,              %% 增加百分比
		step_value   = 7200,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,62)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 62,              %% 增加百分比
		step_value   = 7400,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,63)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 63,              %% 增加百分比
		step_value   = 7600,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,64)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 64,              %% 增加百分比
		step_value   = 7800,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,65)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 65,              %% 增加百分比
		step_value   = 8000,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,66)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 66,              %% 增加百分比
		step_value   = 8200,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,67)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 67,              %% 增加百分比
		step_value   = 8400,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,68)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 68,              %% 增加百分比
		step_value   = 8600,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,69)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 69,              %% 增加百分比
		step_value   = 8800,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,70)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 70,              %% 增加百分比
		step_value   = 9000,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,71)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 71,              %% 增加百分比
		step_value   = 9200,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,72)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 72,              %% 增加百分比
		step_value   = 9400,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,73)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 73,              %% 增加百分比
		step_value   = 9600,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,74)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 74,              %% 增加百分比
		step_value   = 9800,            %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,75)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 75,              %% 增加百分比
		step_value   = 10000,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,76)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 76,              %% 增加百分比
		step_value   = 10200,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,77)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 77,              %% 增加百分比
		step_value   = 10400,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,78)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 78,              %% 增加百分比
		step_value   = 10600,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,79)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 79,              %% 增加百分比
		step_value   = 10800,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,80)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 80,              %% 增加百分比
		step_value   = 11000,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,81)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 81,              %% 增加百分比
		step_value   = 11200,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,82)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 82,              %% 增加百分比
		step_value   = 11400,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,83)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 83,              %% 增加百分比
		step_value   = 11600,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,84)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 84,              %% 增加百分比
		step_value   = 11800,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,85)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 85,              %% 增加百分比
		step_value   = 12000,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,86)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 86,              %% 增加百分比
		step_value   = 12200,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,87)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 87,              %% 增加百分比
		step_value   = 12400,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,88)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 88,              %% 增加百分比
		step_value   = 12600,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,89)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 89,              %% 增加百分比
		step_value   = 12800,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,90)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 90,              %% 增加百分比
		step_value   = 13000,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,91)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 91,              %% 增加百分比
		step_value   = 13200,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,92)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 92,              %% 增加百分比
		step_value   = 13400,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,93)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 93,              %% 增加百分比
		step_value   = 13600,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,94)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 94,              %% 增加百分比
		step_value   = 13800,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,95)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 95,              %% 增加百分比
		step_value   = 14000,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,96)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 96,              %% 增加百分比
		step_value   = 14200,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,97)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 97,              %% 增加百分比
		step_value   = 14400,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,98)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 98,              %% 增加百分比
		step_value   = 14600,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,99)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 99,              %% 增加百分比
		step_value   = 14800,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(12,100)->
	#d_enchant{
		type_sub     = 12,              %% 装备子类型
		step         = 100,             %% 增加百分比
		step_value   = 15000,           %% 升阶值
		goods        = 34009,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,1)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 1,               %% 增加百分比
		step_value   = 50,              %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,2)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 2,               %% 增加百分比
		step_value   = 100,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,3)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 3,               %% 增加百分比
		step_value   = 150,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,4)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 4,               %% 增加百分比
		step_value   = 200,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,5)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 5,               %% 增加百分比
		step_value   = 250,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,6)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 6,               %% 增加百分比
		step_value   = 300,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,7)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 7,               %% 增加百分比
		step_value   = 350,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,8)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 8,               %% 增加百分比
		step_value   = 400,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,9)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 9,               %% 增加百分比
		step_value   = 450,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,10)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 10,              %% 增加百分比
		step_value   = 500,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,11)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 11,              %% 增加百分比
		step_value   = 550,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,12)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 12,              %% 增加百分比
		step_value   = 600,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,13)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 13,              %% 增加百分比
		step_value   = 650,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,14)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 14,              %% 增加百分比
		step_value   = 700,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,15)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 15,              %% 增加百分比
		step_value   = 750,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,16)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 16,              %% 增加百分比
		step_value   = 800,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,17)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 17,              %% 增加百分比
		step_value   = 850,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,18)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 18,              %% 增加百分比
		step_value   = 900,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,19)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 19,              %% 增加百分比
		step_value   = 950,             %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,20)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 20,              %% 增加百分比
		step_value   = 1000,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,21)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 21,              %% 增加百分比
		step_value   = 1100,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,22)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 22,              %% 增加百分比
		step_value   = 1200,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,23)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 23,              %% 增加百分比
		step_value   = 1300,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,24)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 24,              %% 增加百分比
		step_value   = 1400,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,25)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 25,              %% 增加百分比
		step_value   = 1500,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,26)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 26,              %% 增加百分比
		step_value   = 1600,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,27)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 27,              %% 增加百分比
		step_value   = 1700,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,28)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 28,              %% 增加百分比
		step_value   = 1800,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,29)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 29,              %% 增加百分比
		step_value   = 1900,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,30)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 30,              %% 增加百分比
		step_value   = 2000,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,31)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 31,              %% 增加百分比
		step_value   = 2100,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,32)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 32,              %% 增加百分比
		step_value   = 2200,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,33)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 33,              %% 增加百分比
		step_value   = 2300,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,34)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 34,              %% 增加百分比
		step_value   = 2400,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,35)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 35,              %% 增加百分比
		step_value   = 2500,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,36)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 36,              %% 增加百分比
		step_value   = 2600,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,37)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 37,              %% 增加百分比
		step_value   = 2700,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,38)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 38,              %% 增加百分比
		step_value   = 2800,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,39)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 39,              %% 增加百分比
		step_value   = 2900,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,40)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 40,              %% 增加百分比
		step_value   = 3000,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,41)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 41,              %% 增加百分比
		step_value   = 3200,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,42)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 42,              %% 增加百分比
		step_value   = 3400,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,43)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 43,              %% 增加百分比
		step_value   = 3600,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,44)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 44,              %% 增加百分比
		step_value   = 3800,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,45)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 45,              %% 增加百分比
		step_value   = 4000,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,46)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 46,              %% 增加百分比
		step_value   = 4200,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,47)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 47,              %% 增加百分比
		step_value   = 4400,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,48)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 48,              %% 增加百分比
		step_value   = 4600,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,49)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 49,              %% 增加百分比
		step_value   = 4800,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,50)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 50,              %% 增加百分比
		step_value   = 5000,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,51)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 51,              %% 增加百分比
		step_value   = 5200,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,52)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 52,              %% 增加百分比
		step_value   = 5400,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,53)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 53,              %% 增加百分比
		step_value   = 5600,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,54)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 54,              %% 增加百分比
		step_value   = 5800,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,55)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 55,              %% 增加百分比
		step_value   = 6000,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,56)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 56,              %% 增加百分比
		step_value   = 6200,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,57)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 57,              %% 增加百分比
		step_value   = 6400,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,58)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 58,              %% 增加百分比
		step_value   = 6600,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,59)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 59,              %% 增加百分比
		step_value   = 6800,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,60)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 60,              %% 增加百分比
		step_value   = 7000,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,61)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 61,              %% 增加百分比
		step_value   = 7200,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,62)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 62,              %% 增加百分比
		step_value   = 7400,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,63)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 63,              %% 增加百分比
		step_value   = 7600,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,64)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 64,              %% 增加百分比
		step_value   = 7800,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,65)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 65,              %% 增加百分比
		step_value   = 8000,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,66)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 66,              %% 增加百分比
		step_value   = 8200,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,67)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 67,              %% 增加百分比
		step_value   = 8400,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,68)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 68,              %% 增加百分比
		step_value   = 8600,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,69)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 69,              %% 增加百分比
		step_value   = 8800,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,70)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 70,              %% 增加百分比
		step_value   = 9000,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,71)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 71,              %% 增加百分比
		step_value   = 9200,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,72)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 72,              %% 增加百分比
		step_value   = 9400,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,73)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 73,              %% 增加百分比
		step_value   = 9600,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,74)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 74,              %% 增加百分比
		step_value   = 9800,            %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,75)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 75,              %% 增加百分比
		step_value   = 10000,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,76)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 76,              %% 增加百分比
		step_value   = 10200,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,77)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 77,              %% 增加百分比
		step_value   = 10400,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,78)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 78,              %% 增加百分比
		step_value   = 10600,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,79)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 79,              %% 增加百分比
		step_value   = 10800,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,80)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 80,              %% 增加百分比
		step_value   = 11000,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,81)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 81,              %% 增加百分比
		step_value   = 11200,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,82)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 82,              %% 增加百分比
		step_value   = 11400,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,83)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 83,              %% 增加百分比
		step_value   = 11600,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,84)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 84,              %% 增加百分比
		step_value   = 11800,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,85)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 85,              %% 增加百分比
		step_value   = 12000,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,86)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 86,              %% 增加百分比
		step_value   = 12200,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,87)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 87,              %% 增加百分比
		step_value   = 12400,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,88)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 88,              %% 增加百分比
		step_value   = 12600,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,89)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 89,              %% 增加百分比
		step_value   = 12800,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,90)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 90,              %% 增加百分比
		step_value   = 13000,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,91)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 91,              %% 增加百分比
		step_value   = 13200,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,92)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 92,              %% 增加百分比
		step_value   = 13400,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,93)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 93,              %% 增加百分比
		step_value   = 13600,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,94)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 94,              %% 增加百分比
		step_value   = 13800,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,95)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 95,              %% 增加百分比
		step_value   = 14000,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,96)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 96,              %% 增加百分比
		step_value   = 14200,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,97)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 97,              %% 增加百分比
		step_value   = 14400,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,98)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 98,              %% 增加百分比
		step_value   = 14600,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,99)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 99,              %% 增加百分比
		step_value   = 14800,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(13,100)->
	#d_enchant{
		type_sub     = 13,              %% 装备子类型
		step         = 100,             %% 增加百分比
		step_value   = 15000,           %% 升阶值
		goods        = 34021,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,1)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 1,               %% 增加百分比
		step_value   = 50,              %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,2)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 2,               %% 增加百分比
		step_value   = 100,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,3)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 3,               %% 增加百分比
		step_value   = 150,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,4)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 4,               %% 增加百分比
		step_value   = 200,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,5)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 5,               %% 增加百分比
		step_value   = 250,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,6)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 6,               %% 增加百分比
		step_value   = 300,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,7)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 7,               %% 增加百分比
		step_value   = 350,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,8)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 8,               %% 增加百分比
		step_value   = 400,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,9)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 9,               %% 增加百分比
		step_value   = 450,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,10)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 10,              %% 增加百分比
		step_value   = 500,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,11)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 11,              %% 增加百分比
		step_value   = 550,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,12)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 12,              %% 增加百分比
		step_value   = 600,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,13)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 13,              %% 增加百分比
		step_value   = 650,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,14)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 14,              %% 增加百分比
		step_value   = 700,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,15)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 15,              %% 增加百分比
		step_value   = 750,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,16)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 16,              %% 增加百分比
		step_value   = 800,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,17)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 17,              %% 增加百分比
		step_value   = 850,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,18)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 18,              %% 增加百分比
		step_value   = 900,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,19)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 19,              %% 增加百分比
		step_value   = 950,             %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,20)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 20,              %% 增加百分比
		step_value   = 1000,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,21)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 21,              %% 增加百分比
		step_value   = 1100,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,22)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 22,              %% 增加百分比
		step_value   = 1200,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,23)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 23,              %% 增加百分比
		step_value   = 1300,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,24)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 24,              %% 增加百分比
		step_value   = 1400,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,25)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 25,              %% 增加百分比
		step_value   = 1500,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,26)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 26,              %% 增加百分比
		step_value   = 1600,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,27)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 27,              %% 增加百分比
		step_value   = 1700,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,28)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 28,              %% 增加百分比
		step_value   = 1800,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,29)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 29,              %% 增加百分比
		step_value   = 1900,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,30)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 30,              %% 增加百分比
		step_value   = 2000,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,31)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 31,              %% 增加百分比
		step_value   = 2100,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,32)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 32,              %% 增加百分比
		step_value   = 2200,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,33)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 33,              %% 增加百分比
		step_value   = 2300,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,34)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 34,              %% 增加百分比
		step_value   = 2400,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,35)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 35,              %% 增加百分比
		step_value   = 2500,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,36)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 36,              %% 增加百分比
		step_value   = 2600,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,37)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 37,              %% 增加百分比
		step_value   = 2700,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,38)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 38,              %% 增加百分比
		step_value   = 2800,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,39)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 39,              %% 增加百分比
		step_value   = 2900,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,40)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 40,              %% 增加百分比
		step_value   = 3000,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,41)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 41,              %% 增加百分比
		step_value   = 3200,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,42)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 42,              %% 增加百分比
		step_value   = 3400,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,43)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 43,              %% 增加百分比
		step_value   = 3600,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,44)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 44,              %% 增加百分比
		step_value   = 3800,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,45)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 45,              %% 增加百分比
		step_value   = 4000,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,46)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 46,              %% 增加百分比
		step_value   = 4200,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,47)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 47,              %% 增加百分比
		step_value   = 4400,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,48)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 48,              %% 增加百分比
		step_value   = 4600,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,49)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 49,              %% 增加百分比
		step_value   = 4800,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,50)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 50,              %% 增加百分比
		step_value   = 5000,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,51)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 51,              %% 增加百分比
		step_value   = 5200,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,52)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 52,              %% 增加百分比
		step_value   = 5400,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,53)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 53,              %% 增加百分比
		step_value   = 5600,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,54)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 54,              %% 增加百分比
		step_value   = 5800,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,55)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 55,              %% 增加百分比
		step_value   = 6000,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,56)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 56,              %% 增加百分比
		step_value   = 6200,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,57)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 57,              %% 增加百分比
		step_value   = 6400,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,58)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 58,              %% 增加百分比
		step_value   = 6600,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,59)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 59,              %% 增加百分比
		step_value   = 6800,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,60)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 60,              %% 增加百分比
		step_value   = 7000,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,61)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 61,              %% 增加百分比
		step_value   = 7200,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,62)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 62,              %% 增加百分比
		step_value   = 7400,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,63)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 63,              %% 增加百分比
		step_value   = 7600,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,64)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 64,              %% 增加百分比
		step_value   = 7800,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,65)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 65,              %% 增加百分比
		step_value   = 8000,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,66)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 66,              %% 增加百分比
		step_value   = 8200,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,67)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 67,              %% 增加百分比
		step_value   = 8400,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,68)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 68,              %% 增加百分比
		step_value   = 8600,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,69)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 69,              %% 增加百分比
		step_value   = 8800,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,70)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 70,              %% 增加百分比
		step_value   = 9000,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,71)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 71,              %% 增加百分比
		step_value   = 9200,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,72)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 72,              %% 增加百分比
		step_value   = 9400,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,73)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 73,              %% 增加百分比
		step_value   = 9600,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,74)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 74,              %% 增加百分比
		step_value   = 9800,            %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,75)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 75,              %% 增加百分比
		step_value   = 10000,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,76)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 76,              %% 增加百分比
		step_value   = 10200,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,77)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 77,              %% 增加百分比
		step_value   = 10400,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,78)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 78,              %% 增加百分比
		step_value   = 10600,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,79)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 79,              %% 增加百分比
		step_value   = 10800,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,80)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 80,              %% 增加百分比
		step_value   = 11000,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,81)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 81,              %% 增加百分比
		step_value   = 11200,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,82)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 82,              %% 增加百分比
		step_value   = 11400,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,83)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 83,              %% 增加百分比
		step_value   = 11600,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,84)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 84,              %% 增加百分比
		step_value   = 11800,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,85)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 85,              %% 增加百分比
		step_value   = 12000,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,86)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 86,              %% 增加百分比
		step_value   = 12200,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,87)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 87,              %% 增加百分比
		step_value   = 12400,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,88)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 88,              %% 增加百分比
		step_value   = 12600,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,89)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 89,              %% 增加百分比
		step_value   = 12800,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,90)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 90,              %% 增加百分比
		step_value   = 13000,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,91)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 91,              %% 增加百分比
		step_value   = 13200,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,92)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 92,              %% 增加百分比
		step_value   = 13400,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,93)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 93,              %% 增加百分比
		step_value   = 13600,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,94)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 94,              %% 增加百分比
		step_value   = 13800,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,95)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 95,              %% 增加百分比
		step_value   = 14000,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,96)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 96,              %% 增加百分比
		step_value   = 14200,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,97)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 97,              %% 增加百分比
		step_value   = 14400,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,98)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 98,              %% 增加百分比
		step_value   = 14600,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,99)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 99,              %% 增加百分比
		step_value   = 14800,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(14,100)->
	#d_enchant{
		type_sub     = 14,              %% 装备子类型
		step         = 100,             %% 增加百分比
		step_value   = 15000,           %% 升阶值
		goods        = 34013,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,1)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 1,               %% 增加百分比
		step_value   = 50,              %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,2)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 2,               %% 增加百分比
		step_value   = 100,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,3)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 3,               %% 增加百分比
		step_value   = 150,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,4)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 4,               %% 增加百分比
		step_value   = 200,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,5)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 5,               %% 增加百分比
		step_value   = 250,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,6)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 6,               %% 增加百分比
		step_value   = 300,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,7)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 7,               %% 增加百分比
		step_value   = 350,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,8)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 8,               %% 增加百分比
		step_value   = 400,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,9)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 9,               %% 增加百分比
		step_value   = 450,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,10)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 10,              %% 增加百分比
		step_value   = 500,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,11)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 11,              %% 增加百分比
		step_value   = 550,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,12)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 12,              %% 增加百分比
		step_value   = 600,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,13)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 13,              %% 增加百分比
		step_value   = 650,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,14)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 14,              %% 增加百分比
		step_value   = 700,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,15)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 15,              %% 增加百分比
		step_value   = 750,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,16)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 16,              %% 增加百分比
		step_value   = 800,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,17)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 17,              %% 增加百分比
		step_value   = 850,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,18)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 18,              %% 增加百分比
		step_value   = 900,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,19)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 19,              %% 增加百分比
		step_value   = 950,             %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,20)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 20,              %% 增加百分比
		step_value   = 1000,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,21)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 21,              %% 增加百分比
		step_value   = 1100,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,22)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 22,              %% 增加百分比
		step_value   = 1200,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,23)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 23,              %% 增加百分比
		step_value   = 1300,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,24)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 24,              %% 增加百分比
		step_value   = 1400,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,25)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 25,              %% 增加百分比
		step_value   = 1500,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,26)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 26,              %% 增加百分比
		step_value   = 1600,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,27)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 27,              %% 增加百分比
		step_value   = 1700,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,28)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 28,              %% 增加百分比
		step_value   = 1800,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,29)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 29,              %% 增加百分比
		step_value   = 1900,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,30)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 30,              %% 增加百分比
		step_value   = 2000,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,31)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 31,              %% 增加百分比
		step_value   = 2100,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,32)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 32,              %% 增加百分比
		step_value   = 2200,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,33)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 33,              %% 增加百分比
		step_value   = 2300,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,34)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 34,              %% 增加百分比
		step_value   = 2400,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,35)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 35,              %% 增加百分比
		step_value   = 2500,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,36)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 36,              %% 增加百分比
		step_value   = 2600,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,37)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 37,              %% 增加百分比
		step_value   = 2700,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,38)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 38,              %% 增加百分比
		step_value   = 2800,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,39)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 39,              %% 增加百分比
		step_value   = 2900,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,40)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 40,              %% 增加百分比
		step_value   = 3000,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,41)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 41,              %% 增加百分比
		step_value   = 3200,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,42)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 42,              %% 增加百分比
		step_value   = 3400,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,43)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 43,              %% 增加百分比
		step_value   = 3600,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,44)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 44,              %% 增加百分比
		step_value   = 3800,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,45)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 45,              %% 增加百分比
		step_value   = 4000,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,46)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 46,              %% 增加百分比
		step_value   = 4200,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,47)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 47,              %% 增加百分比
		step_value   = 4400,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,48)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 48,              %% 增加百分比
		step_value   = 4600,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,49)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 49,              %% 增加百分比
		step_value   = 4800,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,50)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 50,              %% 增加百分比
		step_value   = 5000,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,51)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 51,              %% 增加百分比
		step_value   = 5200,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,52)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 52,              %% 增加百分比
		step_value   = 5400,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,53)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 53,              %% 增加百分比
		step_value   = 5600,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,54)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 54,              %% 增加百分比
		step_value   = 5800,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,55)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 55,              %% 增加百分比
		step_value   = 6000,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,56)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 56,              %% 增加百分比
		step_value   = 6200,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,57)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 57,              %% 增加百分比
		step_value   = 6400,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,58)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 58,              %% 增加百分比
		step_value   = 6600,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,59)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 59,              %% 增加百分比
		step_value   = 6800,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,60)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 60,              %% 增加百分比
		step_value   = 7000,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,61)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 61,              %% 增加百分比
		step_value   = 7200,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,62)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 62,              %% 增加百分比
		step_value   = 7400,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,63)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 63,              %% 增加百分比
		step_value   = 7600,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,64)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 64,              %% 增加百分比
		step_value   = 7800,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,65)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 65,              %% 增加百分比
		step_value   = 8000,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,66)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 66,              %% 增加百分比
		step_value   = 8200,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,67)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 67,              %% 增加百分比
		step_value   = 8400,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,68)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 68,              %% 增加百分比
		step_value   = 8600,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,69)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 69,              %% 增加百分比
		step_value   = 8800,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,70)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 70,              %% 增加百分比
		step_value   = 9000,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,71)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 71,              %% 增加百分比
		step_value   = 9200,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,72)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 72,              %% 增加百分比
		step_value   = 9400,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,73)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 73,              %% 增加百分比
		step_value   = 9600,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,74)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 74,              %% 增加百分比
		step_value   = 9800,            %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,75)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 75,              %% 增加百分比
		step_value   = 10000,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,76)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 76,              %% 增加百分比
		step_value   = 10200,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,77)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 77,              %% 增加百分比
		step_value   = 10400,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,78)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 78,              %% 增加百分比
		step_value   = 10600,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,79)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 79,              %% 增加百分比
		step_value   = 10800,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,80)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 80,              %% 增加百分比
		step_value   = 11000,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,81)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 81,              %% 增加百分比
		step_value   = 11200,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,82)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 82,              %% 增加百分比
		step_value   = 11400,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,83)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 83,              %% 增加百分比
		step_value   = 11600,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,84)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 84,              %% 增加百分比
		step_value   = 11800,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,85)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 85,              %% 增加百分比
		step_value   = 12000,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,86)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 86,              %% 增加百分比
		step_value   = 12200,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,87)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 87,              %% 增加百分比
		step_value   = 12400,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,88)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 88,              %% 增加百分比
		step_value   = 12600,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,89)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 89,              %% 增加百分比
		step_value   = 12800,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,90)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 90,              %% 增加百分比
		step_value   = 13000,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,91)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 91,              %% 增加百分比
		step_value   = 13200,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,92)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 92,              %% 增加百分比
		step_value   = 13400,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,93)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 93,              %% 增加百分比
		step_value   = 13600,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,94)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 94,              %% 增加百分比
		step_value   = 13800,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,95)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 95,              %% 增加百分比
		step_value   = 14000,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,96)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 96,              %% 增加百分比
		step_value   = 14200,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,97)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 97,              %% 增加百分比
		step_value   = 14400,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,98)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 98,              %% 增加百分比
		step_value   = 14600,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,99)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 99,              %% 增加百分比
		step_value   = 14800,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(15,100)->
	#d_enchant{
		type_sub     = 15,              %% 装备子类型
		step         = 100,             %% 增加百分比
		step_value   = 15000,           %% 升阶值
		goods        = 34017,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,1)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 1,               %% 增加百分比
		step_value   = 50,              %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,2)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 2,               %% 增加百分比
		step_value   = 100,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,3)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 3,               %% 增加百分比
		step_value   = 150,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,4)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 4,               %% 增加百分比
		step_value   = 200,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,5)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 5,               %% 增加百分比
		step_value   = 250,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,6)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 6,               %% 增加百分比
		step_value   = 300,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,7)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 7,               %% 增加百分比
		step_value   = 350,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,8)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 8,               %% 增加百分比
		step_value   = 400,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,9)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 9,               %% 增加百分比
		step_value   = 450,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,10)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 10,              %% 增加百分比
		step_value   = 500,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,11)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 11,              %% 增加百分比
		step_value   = 550,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,12)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 12,              %% 增加百分比
		step_value   = 600,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,13)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 13,              %% 增加百分比
		step_value   = 650,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,14)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 14,              %% 增加百分比
		step_value   = 700,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,15)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 15,              %% 增加百分比
		step_value   = 750,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,16)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 16,              %% 增加百分比
		step_value   = 800,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,17)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 17,              %% 增加百分比
		step_value   = 850,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,18)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 18,              %% 增加百分比
		step_value   = 900,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,19)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 19,              %% 增加百分比
		step_value   = 950,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,20)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 20,              %% 增加百分比
		step_value   = 1000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,21)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 21,              %% 增加百分比
		step_value   = 1100,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,22)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 22,              %% 增加百分比
		step_value   = 1200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,23)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 23,              %% 增加百分比
		step_value   = 1300,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,24)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 24,              %% 增加百分比
		step_value   = 1400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,25)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 25,              %% 增加百分比
		step_value   = 1500,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,26)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 26,              %% 增加百分比
		step_value   = 1600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,27)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 27,              %% 增加百分比
		step_value   = 1700,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,28)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 28,              %% 增加百分比
		step_value   = 1800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,29)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 29,              %% 增加百分比
		step_value   = 1900,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,30)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 30,              %% 增加百分比
		step_value   = 2000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,31)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 31,              %% 增加百分比
		step_value   = 2100,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,32)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 32,              %% 增加百分比
		step_value   = 2200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,33)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 33,              %% 增加百分比
		step_value   = 2300,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,34)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 34,              %% 增加百分比
		step_value   = 2400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,35)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 35,              %% 增加百分比
		step_value   = 2500,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,36)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 36,              %% 增加百分比
		step_value   = 2600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,37)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 37,              %% 增加百分比
		step_value   = 2700,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,38)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 38,              %% 增加百分比
		step_value   = 2800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,39)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 39,              %% 增加百分比
		step_value   = 2900,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,40)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 40,              %% 增加百分比
		step_value   = 3000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,41)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 41,              %% 增加百分比
		step_value   = 3200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,42)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 42,              %% 增加百分比
		step_value   = 3400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,43)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 43,              %% 增加百分比
		step_value   = 3600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,44)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 44,              %% 增加百分比
		step_value   = 3800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,45)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 45,              %% 增加百分比
		step_value   = 4000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,46)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 46,              %% 增加百分比
		step_value   = 4200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,47)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 47,              %% 增加百分比
		step_value   = 4400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,48)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 48,              %% 增加百分比
		step_value   = 4600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,49)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 49,              %% 增加百分比
		step_value   = 4800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,50)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 50,              %% 增加百分比
		step_value   = 5000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,51)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 51,              %% 增加百分比
		step_value   = 5200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,52)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 52,              %% 增加百分比
		step_value   = 5400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,53)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 53,              %% 增加百分比
		step_value   = 5600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,54)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 54,              %% 增加百分比
		step_value   = 5800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,55)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 55,              %% 增加百分比
		step_value   = 6000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,56)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 56,              %% 增加百分比
		step_value   = 6200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,57)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 57,              %% 增加百分比
		step_value   = 6400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,58)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 58,              %% 增加百分比
		step_value   = 6600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,59)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 59,              %% 增加百分比
		step_value   = 6800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,60)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 60,              %% 增加百分比
		step_value   = 7000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,61)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 61,              %% 增加百分比
		step_value   = 7200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,62)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 62,              %% 增加百分比
		step_value   = 7400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,63)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 63,              %% 增加百分比
		step_value   = 7600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,64)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 64,              %% 增加百分比
		step_value   = 7800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,65)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 65,              %% 增加百分比
		step_value   = 8000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,66)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 66,              %% 增加百分比
		step_value   = 8200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,67)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 67,              %% 增加百分比
		step_value   = 8400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,68)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 68,              %% 增加百分比
		step_value   = 8600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,69)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 69,              %% 增加百分比
		step_value   = 8800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,70)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 70,              %% 增加百分比
		step_value   = 9000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,71)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 71,              %% 增加百分比
		step_value   = 9200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,72)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 72,              %% 增加百分比
		step_value   = 9400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,73)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 73,              %% 增加百分比
		step_value   = 9600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,74)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 74,              %% 增加百分比
		step_value   = 9800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,75)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 75,              %% 增加百分比
		step_value   = 10000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,76)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 76,              %% 增加百分比
		step_value   = 10200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,77)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 77,              %% 增加百分比
		step_value   = 10400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,78)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 78,              %% 增加百分比
		step_value   = 10600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,79)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 79,              %% 增加百分比
		step_value   = 10800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,80)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 80,              %% 增加百分比
		step_value   = 11000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,81)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 81,              %% 增加百分比
		step_value   = 11200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,82)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 82,              %% 增加百分比
		step_value   = 11400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,83)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 83,              %% 增加百分比
		step_value   = 11600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,84)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 84,              %% 增加百分比
		step_value   = 11800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,85)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 85,              %% 增加百分比
		step_value   = 12000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,86)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 86,              %% 增加百分比
		step_value   = 12200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,87)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 87,              %% 增加百分比
		step_value   = 12400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,88)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 88,              %% 增加百分比
		step_value   = 12600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,89)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 89,              %% 增加百分比
		step_value   = 12800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,90)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 90,              %% 增加百分比
		step_value   = 13000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,91)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 91,              %% 增加百分比
		step_value   = 13200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,92)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 92,              %% 增加百分比
		step_value   = 13400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,93)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 93,              %% 增加百分比
		step_value   = 13600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,94)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 94,              %% 增加百分比
		step_value   = 13800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,95)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 95,              %% 增加百分比
		step_value   = 14000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,96)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 96,              %% 增加百分比
		step_value   = 14200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,97)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 97,              %% 增加百分比
		step_value   = 14400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,98)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 98,              %% 增加百分比
		step_value   = 14600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,99)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 99,              %% 增加百分比
		step_value   = 14800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(31,100)->
	#d_enchant{
		type_sub     = 31,              %% 装备子类型
		step         = 100,             %% 增加百分比
		step_value   = 15000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,1)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 1,               %% 增加百分比
		step_value   = 50,              %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,2)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 2,               %% 增加百分比
		step_value   = 100,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,3)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 3,               %% 增加百分比
		step_value   = 150,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,4)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 4,               %% 增加百分比
		step_value   = 200,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,5)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 5,               %% 增加百分比
		step_value   = 250,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,6)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 6,               %% 增加百分比
		step_value   = 300,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,7)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 7,               %% 增加百分比
		step_value   = 350,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,8)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 8,               %% 增加百分比
		step_value   = 400,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,9)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 9,               %% 增加百分比
		step_value   = 450,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,10)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 10,              %% 增加百分比
		step_value   = 500,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,11)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 11,              %% 增加百分比
		step_value   = 550,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,12)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 12,              %% 增加百分比
		step_value   = 600,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,13)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 13,              %% 增加百分比
		step_value   = 650,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,14)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 14,              %% 增加百分比
		step_value   = 700,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,15)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 15,              %% 增加百分比
		step_value   = 750,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,16)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 16,              %% 增加百分比
		step_value   = 800,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,17)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 17,              %% 增加百分比
		step_value   = 850,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,18)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 18,              %% 增加百分比
		step_value   = 900,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,19)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 19,              %% 增加百分比
		step_value   = 950,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,20)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 20,              %% 增加百分比
		step_value   = 1000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,21)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 21,              %% 增加百分比
		step_value   = 1100,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,22)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 22,              %% 增加百分比
		step_value   = 1200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,23)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 23,              %% 增加百分比
		step_value   = 1300,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,24)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 24,              %% 增加百分比
		step_value   = 1400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,25)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 25,              %% 增加百分比
		step_value   = 1500,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,26)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 26,              %% 增加百分比
		step_value   = 1600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,27)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 27,              %% 增加百分比
		step_value   = 1700,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,28)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 28,              %% 增加百分比
		step_value   = 1800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,29)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 29,              %% 增加百分比
		step_value   = 1900,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,30)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 30,              %% 增加百分比
		step_value   = 2000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,31)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 31,              %% 增加百分比
		step_value   = 2100,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,32)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 32,              %% 增加百分比
		step_value   = 2200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,33)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 33,              %% 增加百分比
		step_value   = 2300,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,34)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 34,              %% 增加百分比
		step_value   = 2400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,35)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 35,              %% 增加百分比
		step_value   = 2500,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,36)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 36,              %% 增加百分比
		step_value   = 2600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,37)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 37,              %% 增加百分比
		step_value   = 2700,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,38)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 38,              %% 增加百分比
		step_value   = 2800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,39)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 39,              %% 增加百分比
		step_value   = 2900,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,40)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 40,              %% 增加百分比
		step_value   = 3000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,41)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 41,              %% 增加百分比
		step_value   = 3200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,42)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 42,              %% 增加百分比
		step_value   = 3400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,43)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 43,              %% 增加百分比
		step_value   = 3600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,44)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 44,              %% 增加百分比
		step_value   = 3800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,45)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 45,              %% 增加百分比
		step_value   = 4000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,46)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 46,              %% 增加百分比
		step_value   = 4200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,47)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 47,              %% 增加百分比
		step_value   = 4400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,48)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 48,              %% 增加百分比
		step_value   = 4600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,49)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 49,              %% 增加百分比
		step_value   = 4800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,50)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 50,              %% 增加百分比
		step_value   = 5000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,51)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 51,              %% 增加百分比
		step_value   = 5200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,52)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 52,              %% 增加百分比
		step_value   = 5400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,53)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 53,              %% 增加百分比
		step_value   = 5600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,54)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 54,              %% 增加百分比
		step_value   = 5800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,55)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 55,              %% 增加百分比
		step_value   = 6000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,56)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 56,              %% 增加百分比
		step_value   = 6200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,57)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 57,              %% 增加百分比
		step_value   = 6400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,58)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 58,              %% 增加百分比
		step_value   = 6600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,59)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 59,              %% 增加百分比
		step_value   = 6800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,60)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 60,              %% 增加百分比
		step_value   = 7000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,61)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 61,              %% 增加百分比
		step_value   = 7200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,62)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 62,              %% 增加百分比
		step_value   = 7400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,63)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 63,              %% 增加百分比
		step_value   = 7600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,64)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 64,              %% 增加百分比
		step_value   = 7800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,65)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 65,              %% 增加百分比
		step_value   = 8000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,66)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 66,              %% 增加百分比
		step_value   = 8200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,67)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 67,              %% 增加百分比
		step_value   = 8400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,68)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 68,              %% 增加百分比
		step_value   = 8600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,69)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 69,              %% 增加百分比
		step_value   = 8800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,70)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 70,              %% 增加百分比
		step_value   = 9000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,71)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 71,              %% 增加百分比
		step_value   = 9200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,72)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 72,              %% 增加百分比
		step_value   = 9400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,73)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 73,              %% 增加百分比
		step_value   = 9600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,74)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 74,              %% 增加百分比
		step_value   = 9800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,75)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 75,              %% 增加百分比
		step_value   = 10000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,76)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 76,              %% 增加百分比
		step_value   = 10200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,77)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 77,              %% 增加百分比
		step_value   = 10400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,78)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 78,              %% 增加百分比
		step_value   = 10600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,79)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 79,              %% 增加百分比
		step_value   = 10800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,80)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 80,              %% 增加百分比
		step_value   = 11000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,81)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 81,              %% 增加百分比
		step_value   = 11200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,82)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 82,              %% 增加百分比
		step_value   = 11400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,83)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 83,              %% 增加百分比
		step_value   = 11600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,84)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 84,              %% 增加百分比
		step_value   = 11800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,85)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 85,              %% 增加百分比
		step_value   = 12000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,86)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 86,              %% 增加百分比
		step_value   = 12200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,87)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 87,              %% 增加百分比
		step_value   = 12400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,88)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 88,              %% 增加百分比
		step_value   = 12600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,89)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 89,              %% 增加百分比
		step_value   = 12800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,90)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 90,              %% 增加百分比
		step_value   = 13000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,91)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 91,              %% 增加百分比
		step_value   = 13200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,92)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 92,              %% 增加百分比
		step_value   = 13400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,93)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 93,              %% 增加百分比
		step_value   = 13600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,94)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 94,              %% 增加百分比
		step_value   = 13800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,95)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 95,              %% 增加百分比
		step_value   = 14000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,96)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 96,              %% 增加百分比
		step_value   = 14200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,97)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 97,              %% 增加百分比
		step_value   = 14400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,98)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 98,              %% 增加百分比
		step_value   = 14600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,99)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 99,              %% 增加百分比
		step_value   = 14800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(32,100)->
	#d_enchant{
		type_sub     = 32,              %% 装备子类型
		step         = 100,             %% 增加百分比
		step_value   = 15000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,1)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 1,               %% 增加百分比
		step_value   = 50,              %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,2)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 2,               %% 增加百分比
		step_value   = 100,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,3)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 3,               %% 增加百分比
		step_value   = 150,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,4)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 4,               %% 增加百分比
		step_value   = 200,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,5)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 5,               %% 增加百分比
		step_value   = 250,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,6)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 6,               %% 增加百分比
		step_value   = 300,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,7)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 7,               %% 增加百分比
		step_value   = 350,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,8)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 8,               %% 增加百分比
		step_value   = 400,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,9)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 9,               %% 增加百分比
		step_value   = 450,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,10)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 10,              %% 增加百分比
		step_value   = 500,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,11)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 11,              %% 增加百分比
		step_value   = 550,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,12)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 12,              %% 增加百分比
		step_value   = 600,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,13)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 13,              %% 增加百分比
		step_value   = 650,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,14)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 14,              %% 增加百分比
		step_value   = 700,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,15)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 15,              %% 增加百分比
		step_value   = 750,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,16)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 16,              %% 增加百分比
		step_value   = 800,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,17)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 17,              %% 增加百分比
		step_value   = 850,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,18)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 18,              %% 增加百分比
		step_value   = 900,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,19)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 19,              %% 增加百分比
		step_value   = 950,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,20)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 20,              %% 增加百分比
		step_value   = 1000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,21)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 21,              %% 增加百分比
		step_value   = 1100,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,22)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 22,              %% 增加百分比
		step_value   = 1200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,23)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 23,              %% 增加百分比
		step_value   = 1300,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,24)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 24,              %% 增加百分比
		step_value   = 1400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,25)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 25,              %% 增加百分比
		step_value   = 1500,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,26)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 26,              %% 增加百分比
		step_value   = 1600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,27)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 27,              %% 增加百分比
		step_value   = 1700,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,28)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 28,              %% 增加百分比
		step_value   = 1800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,29)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 29,              %% 增加百分比
		step_value   = 1900,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,30)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 30,              %% 增加百分比
		step_value   = 2000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,31)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 31,              %% 增加百分比
		step_value   = 2100,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,32)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 32,              %% 增加百分比
		step_value   = 2200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,33)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 33,              %% 增加百分比
		step_value   = 2300,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,34)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 34,              %% 增加百分比
		step_value   = 2400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,35)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 35,              %% 增加百分比
		step_value   = 2500,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,36)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 36,              %% 增加百分比
		step_value   = 2600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,37)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 37,              %% 增加百分比
		step_value   = 2700,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,38)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 38,              %% 增加百分比
		step_value   = 2800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,39)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 39,              %% 增加百分比
		step_value   = 2900,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,40)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 40,              %% 增加百分比
		step_value   = 3000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,41)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 41,              %% 增加百分比
		step_value   = 3200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,42)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 42,              %% 增加百分比
		step_value   = 3400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,43)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 43,              %% 增加百分比
		step_value   = 3600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,44)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 44,              %% 增加百分比
		step_value   = 3800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,45)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 45,              %% 增加百分比
		step_value   = 4000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,46)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 46,              %% 增加百分比
		step_value   = 4200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,47)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 47,              %% 增加百分比
		step_value   = 4400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,48)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 48,              %% 增加百分比
		step_value   = 4600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,49)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 49,              %% 增加百分比
		step_value   = 4800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,50)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 50,              %% 增加百分比
		step_value   = 5000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,51)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 51,              %% 增加百分比
		step_value   = 5200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,52)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 52,              %% 增加百分比
		step_value   = 5400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,53)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 53,              %% 增加百分比
		step_value   = 5600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,54)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 54,              %% 增加百分比
		step_value   = 5800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,55)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 55,              %% 增加百分比
		step_value   = 6000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,56)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 56,              %% 增加百分比
		step_value   = 6200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,57)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 57,              %% 增加百分比
		step_value   = 6400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,58)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 58,              %% 增加百分比
		step_value   = 6600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,59)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 59,              %% 增加百分比
		step_value   = 6800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,60)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 60,              %% 增加百分比
		step_value   = 7000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,61)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 61,              %% 增加百分比
		step_value   = 7200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,62)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 62,              %% 增加百分比
		step_value   = 7400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,63)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 63,              %% 增加百分比
		step_value   = 7600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,64)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 64,              %% 增加百分比
		step_value   = 7800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,65)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 65,              %% 增加百分比
		step_value   = 8000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,66)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 66,              %% 增加百分比
		step_value   = 8200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,67)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 67,              %% 增加百分比
		step_value   = 8400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,68)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 68,              %% 增加百分比
		step_value   = 8600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,69)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 69,              %% 增加百分比
		step_value   = 8800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,70)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 70,              %% 增加百分比
		step_value   = 9000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,71)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 71,              %% 增加百分比
		step_value   = 9200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,72)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 72,              %% 增加百分比
		step_value   = 9400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,73)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 73,              %% 增加百分比
		step_value   = 9600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,74)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 74,              %% 增加百分比
		step_value   = 9800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,75)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 75,              %% 增加百分比
		step_value   = 10000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,76)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 76,              %% 增加百分比
		step_value   = 10200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,77)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 77,              %% 增加百分比
		step_value   = 10400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,78)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 78,              %% 增加百分比
		step_value   = 10600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,79)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 79,              %% 增加百分比
		step_value   = 10800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,80)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 80,              %% 增加百分比
		step_value   = 11000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,81)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 81,              %% 增加百分比
		step_value   = 11200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,82)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 82,              %% 增加百分比
		step_value   = 11400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,83)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 83,              %% 增加百分比
		step_value   = 11600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,84)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 84,              %% 增加百分比
		step_value   = 11800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,85)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 85,              %% 增加百分比
		step_value   = 12000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,86)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 86,              %% 增加百分比
		step_value   = 12200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,87)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 87,              %% 增加百分比
		step_value   = 12400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,88)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 88,              %% 增加百分比
		step_value   = 12600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,89)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 89,              %% 增加百分比
		step_value   = 12800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,90)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 90,              %% 增加百分比
		step_value   = 13000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,91)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 91,              %% 增加百分比
		step_value   = 13200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,92)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 92,              %% 增加百分比
		step_value   = 13400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,93)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 93,              %% 增加百分比
		step_value   = 13600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,94)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 94,              %% 增加百分比
		step_value   = 13800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,95)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 95,              %% 增加百分比
		step_value   = 14000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,96)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 96,              %% 增加百分比
		step_value   = 14200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,97)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 97,              %% 增加百分比
		step_value   = 14400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,98)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 98,              %% 增加百分比
		step_value   = 14600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,99)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 99,              %% 增加百分比
		step_value   = 14800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(33,100)->
	#d_enchant{
		type_sub     = 33,              %% 装备子类型
		step         = 100,             %% 增加百分比
		step_value   = 15000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,1)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 1,               %% 增加百分比
		step_value   = 50,              %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,2)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 2,               %% 增加百分比
		step_value   = 100,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,3)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 3,               %% 增加百分比
		step_value   = 150,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,4)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 4,               %% 增加百分比
		step_value   = 200,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,5)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 5,               %% 增加百分比
		step_value   = 250,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,6)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 6,               %% 增加百分比
		step_value   = 300,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,7)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 7,               %% 增加百分比
		step_value   = 350,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,8)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 8,               %% 增加百分比
		step_value   = 400,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,9)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 9,               %% 增加百分比
		step_value   = 450,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,10)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 10,              %% 增加百分比
		step_value   = 500,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,11)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 11,              %% 增加百分比
		step_value   = 550,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,12)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 12,              %% 增加百分比
		step_value   = 600,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,13)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 13,              %% 增加百分比
		step_value   = 650,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,14)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 14,              %% 增加百分比
		step_value   = 700,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,15)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 15,              %% 增加百分比
		step_value   = 750,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,16)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 16,              %% 增加百分比
		step_value   = 800,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,17)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 17,              %% 增加百分比
		step_value   = 850,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,18)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 18,              %% 增加百分比
		step_value   = 900,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,19)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 19,              %% 增加百分比
		step_value   = 950,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,20)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 20,              %% 增加百分比
		step_value   = 1000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,21)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 21,              %% 增加百分比
		step_value   = 1100,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,22)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 22,              %% 增加百分比
		step_value   = 1200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,23)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 23,              %% 增加百分比
		step_value   = 1300,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,24)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 24,              %% 增加百分比
		step_value   = 1400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,25)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 25,              %% 增加百分比
		step_value   = 1500,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,26)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 26,              %% 增加百分比
		step_value   = 1600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,27)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 27,              %% 增加百分比
		step_value   = 1700,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,28)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 28,              %% 增加百分比
		step_value   = 1800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,29)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 29,              %% 增加百分比
		step_value   = 1900,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,30)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 30,              %% 增加百分比
		step_value   = 2000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,31)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 31,              %% 增加百分比
		step_value   = 2100,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,32)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 32,              %% 增加百分比
		step_value   = 2200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,33)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 33,              %% 增加百分比
		step_value   = 2300,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,34)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 34,              %% 增加百分比
		step_value   = 2400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,35)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 35,              %% 增加百分比
		step_value   = 2500,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,36)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 36,              %% 增加百分比
		step_value   = 2600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,37)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 37,              %% 增加百分比
		step_value   = 2700,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,38)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 38,              %% 增加百分比
		step_value   = 2800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,39)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 39,              %% 增加百分比
		step_value   = 2900,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,40)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 40,              %% 增加百分比
		step_value   = 3000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,41)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 41,              %% 增加百分比
		step_value   = 3200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,42)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 42,              %% 增加百分比
		step_value   = 3400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,43)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 43,              %% 增加百分比
		step_value   = 3600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,44)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 44,              %% 增加百分比
		step_value   = 3800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,45)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 45,              %% 增加百分比
		step_value   = 4000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,46)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 46,              %% 增加百分比
		step_value   = 4200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,47)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 47,              %% 增加百分比
		step_value   = 4400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,48)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 48,              %% 增加百分比
		step_value   = 4600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,49)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 49,              %% 增加百分比
		step_value   = 4800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,50)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 50,              %% 增加百分比
		step_value   = 5000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,51)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 51,              %% 增加百分比
		step_value   = 5200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,52)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 52,              %% 增加百分比
		step_value   = 5400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,53)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 53,              %% 增加百分比
		step_value   = 5600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,54)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 54,              %% 增加百分比
		step_value   = 5800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,55)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 55,              %% 增加百分比
		step_value   = 6000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,56)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 56,              %% 增加百分比
		step_value   = 6200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,57)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 57,              %% 增加百分比
		step_value   = 6400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,58)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 58,              %% 增加百分比
		step_value   = 6600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,59)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 59,              %% 增加百分比
		step_value   = 6800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,60)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 60,              %% 增加百分比
		step_value   = 7000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,61)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 61,              %% 增加百分比
		step_value   = 7200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,62)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 62,              %% 增加百分比
		step_value   = 7400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,63)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 63,              %% 增加百分比
		step_value   = 7600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,64)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 64,              %% 增加百分比
		step_value   = 7800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,65)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 65,              %% 增加百分比
		step_value   = 8000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,66)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 66,              %% 增加百分比
		step_value   = 8200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,67)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 67,              %% 增加百分比
		step_value   = 8400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,68)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 68,              %% 增加百分比
		step_value   = 8600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,69)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 69,              %% 增加百分比
		step_value   = 8800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,70)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 70,              %% 增加百分比
		step_value   = 9000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,71)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 71,              %% 增加百分比
		step_value   = 9200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,72)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 72,              %% 增加百分比
		step_value   = 9400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,73)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 73,              %% 增加百分比
		step_value   = 9600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,74)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 74,              %% 增加百分比
		step_value   = 9800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,75)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 75,              %% 增加百分比
		step_value   = 10000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,76)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 76,              %% 增加百分比
		step_value   = 10200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,77)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 77,              %% 增加百分比
		step_value   = 10400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,78)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 78,              %% 增加百分比
		step_value   = 10600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,79)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 79,              %% 增加百分比
		step_value   = 10800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,80)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 80,              %% 增加百分比
		step_value   = 11000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,81)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 81,              %% 增加百分比
		step_value   = 11200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,82)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 82,              %% 增加百分比
		step_value   = 11400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,83)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 83,              %% 增加百分比
		step_value   = 11600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,84)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 84,              %% 增加百分比
		step_value   = 11800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,85)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 85,              %% 增加百分比
		step_value   = 12000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,86)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 86,              %% 增加百分比
		step_value   = 12200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,87)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 87,              %% 增加百分比
		step_value   = 12400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,88)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 88,              %% 增加百分比
		step_value   = 12600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,89)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 89,              %% 增加百分比
		step_value   = 12800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,90)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 90,              %% 增加百分比
		step_value   = 13000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,91)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 91,              %% 增加百分比
		step_value   = 13200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,92)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 92,              %% 增加百分比
		step_value   = 13400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,93)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 93,              %% 增加百分比
		step_value   = 13600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,94)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 94,              %% 增加百分比
		step_value   = 13800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,95)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 95,              %% 增加百分比
		step_value   = 14000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,96)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 96,              %% 增加百分比
		step_value   = 14200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,97)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 97,              %% 增加百分比
		step_value   = 14400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,98)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 98,              %% 增加百分比
		step_value   = 14600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,99)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 99,              %% 增加百分比
		step_value   = 14800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(34,100)->
	#d_enchant{
		type_sub     = 34,              %% 装备子类型
		step         = 100,             %% 增加百分比
		step_value   = 15000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,1)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 1,               %% 增加百分比
		step_value   = 50,              %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,2)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 2,               %% 增加百分比
		step_value   = 100,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,3)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 3,               %% 增加百分比
		step_value   = 150,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,4)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 4,               %% 增加百分比
		step_value   = 200,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,5)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 5,               %% 增加百分比
		step_value   = 250,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,6)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 6,               %% 增加百分比
		step_value   = 300,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,7)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 7,               %% 增加百分比
		step_value   = 350,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,8)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 8,               %% 增加百分比
		step_value   = 400,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,9)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 9,               %% 增加百分比
		step_value   = 450,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,10)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 10,              %% 增加百分比
		step_value   = 500,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,11)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 11,              %% 增加百分比
		step_value   = 550,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,12)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 12,              %% 增加百分比
		step_value   = 600,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,13)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 13,              %% 增加百分比
		step_value   = 650,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,14)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 14,              %% 增加百分比
		step_value   = 700,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,15)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 15,              %% 增加百分比
		step_value   = 750,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,16)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 16,              %% 增加百分比
		step_value   = 800,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,17)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 17,              %% 增加百分比
		step_value   = 850,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,18)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 18,              %% 增加百分比
		step_value   = 900,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,19)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 19,              %% 增加百分比
		step_value   = 950,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,20)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 20,              %% 增加百分比
		step_value   = 1000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,21)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 21,              %% 增加百分比
		step_value   = 1100,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,22)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 22,              %% 增加百分比
		step_value   = 1200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,23)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 23,              %% 增加百分比
		step_value   = 1300,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,24)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 24,              %% 增加百分比
		step_value   = 1400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,25)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 25,              %% 增加百分比
		step_value   = 1500,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,26)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 26,              %% 增加百分比
		step_value   = 1600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,27)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 27,              %% 增加百分比
		step_value   = 1700,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,28)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 28,              %% 增加百分比
		step_value   = 1800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,29)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 29,              %% 增加百分比
		step_value   = 1900,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,30)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 30,              %% 增加百分比
		step_value   = 2000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,31)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 31,              %% 增加百分比
		step_value   = 2100,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,32)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 32,              %% 增加百分比
		step_value   = 2200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,33)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 33,              %% 增加百分比
		step_value   = 2300,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,34)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 34,              %% 增加百分比
		step_value   = 2400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,35)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 35,              %% 增加百分比
		step_value   = 2500,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,36)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 36,              %% 增加百分比
		step_value   = 2600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,37)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 37,              %% 增加百分比
		step_value   = 2700,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,38)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 38,              %% 增加百分比
		step_value   = 2800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,39)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 39,              %% 增加百分比
		step_value   = 2900,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,40)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 40,              %% 增加百分比
		step_value   = 3000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,41)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 41,              %% 增加百分比
		step_value   = 3200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,42)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 42,              %% 增加百分比
		step_value   = 3400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,43)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 43,              %% 增加百分比
		step_value   = 3600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,44)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 44,              %% 增加百分比
		step_value   = 3800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,45)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 45,              %% 增加百分比
		step_value   = 4000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,46)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 46,              %% 增加百分比
		step_value   = 4200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,47)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 47,              %% 增加百分比
		step_value   = 4400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,48)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 48,              %% 增加百分比
		step_value   = 4600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,49)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 49,              %% 增加百分比
		step_value   = 4800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,50)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 50,              %% 增加百分比
		step_value   = 5000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,51)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 51,              %% 增加百分比
		step_value   = 5200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,52)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 52,              %% 增加百分比
		step_value   = 5400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,53)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 53,              %% 增加百分比
		step_value   = 5600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,54)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 54,              %% 增加百分比
		step_value   = 5800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,55)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 55,              %% 增加百分比
		step_value   = 6000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,56)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 56,              %% 增加百分比
		step_value   = 6200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,57)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 57,              %% 增加百分比
		step_value   = 6400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,58)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 58,              %% 增加百分比
		step_value   = 6600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,59)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 59,              %% 增加百分比
		step_value   = 6800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,60)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 60,              %% 增加百分比
		step_value   = 7000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,61)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 61,              %% 增加百分比
		step_value   = 7200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,62)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 62,              %% 增加百分比
		step_value   = 7400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,63)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 63,              %% 增加百分比
		step_value   = 7600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,64)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 64,              %% 增加百分比
		step_value   = 7800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,65)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 65,              %% 增加百分比
		step_value   = 8000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,66)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 66,              %% 增加百分比
		step_value   = 8200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,67)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 67,              %% 增加百分比
		step_value   = 8400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,68)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 68,              %% 增加百分比
		step_value   = 8600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,69)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 69,              %% 增加百分比
		step_value   = 8800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,70)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 70,              %% 增加百分比
		step_value   = 9000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,71)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 71,              %% 增加百分比
		step_value   = 9200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,72)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 72,              %% 增加百分比
		step_value   = 9400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,73)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 73,              %% 增加百分比
		step_value   = 9600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,74)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 74,              %% 增加百分比
		step_value   = 9800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,75)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 75,              %% 增加百分比
		step_value   = 10000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,76)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 76,              %% 增加百分比
		step_value   = 10200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,77)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 77,              %% 增加百分比
		step_value   = 10400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,78)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 78,              %% 增加百分比
		step_value   = 10600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,79)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 79,              %% 增加百分比
		step_value   = 10800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,80)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 80,              %% 增加百分比
		step_value   = 11000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,81)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 81,              %% 增加百分比
		step_value   = 11200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,82)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 82,              %% 增加百分比
		step_value   = 11400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,83)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 83,              %% 增加百分比
		step_value   = 11600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,84)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 84,              %% 增加百分比
		step_value   = 11800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,85)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 85,              %% 增加百分比
		step_value   = 12000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,86)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 86,              %% 增加百分比
		step_value   = 12200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,87)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 87,              %% 增加百分比
		step_value   = 12400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,88)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 88,              %% 增加百分比
		step_value   = 12600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,89)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 89,              %% 增加百分比
		step_value   = 12800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,90)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 90,              %% 增加百分比
		step_value   = 13000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,91)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 91,              %% 增加百分比
		step_value   = 13200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,92)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 92,              %% 增加百分比
		step_value   = 13400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,93)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 93,              %% 增加百分比
		step_value   = 13600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,94)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 94,              %% 增加百分比
		step_value   = 13800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,95)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 95,              %% 增加百分比
		step_value   = 14000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,96)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 96,              %% 增加百分比
		step_value   = 14200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,97)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 97,              %% 增加百分比
		step_value   = 14400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,98)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 98,              %% 增加百分比
		step_value   = 14600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,99)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 99,              %% 增加百分比
		step_value   = 14800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(35,100)->
	#d_enchant{
		type_sub     = 35,              %% 装备子类型
		step         = 100,             %% 增加百分比
		step_value   = 15000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,1)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 1,               %% 增加百分比
		step_value   = 50,              %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,2)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 2,               %% 增加百分比
		step_value   = 100,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,3)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 3,               %% 增加百分比
		step_value   = 150,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,4)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 4,               %% 增加百分比
		step_value   = 200,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,5)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 5,               %% 增加百分比
		step_value   = 250,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,6)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 6,               %% 增加百分比
		step_value   = 300,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,7)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 7,               %% 增加百分比
		step_value   = 350,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,8)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 8,               %% 增加百分比
		step_value   = 400,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,9)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 9,               %% 增加百分比
		step_value   = 450,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,10)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 10,              %% 增加百分比
		step_value   = 500,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 5,               %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,11)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 11,              %% 增加百分比
		step_value   = 550,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,12)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 12,              %% 增加百分比
		step_value   = 600,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,13)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 13,              %% 增加百分比
		step_value   = 650,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,14)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 14,              %% 增加百分比
		step_value   = 700,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,15)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 15,              %% 增加百分比
		step_value   = 750,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,16)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 16,              %% 增加百分比
		step_value   = 800,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,17)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 17,              %% 增加百分比
		step_value   = 850,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,18)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 18,              %% 增加百分比
		step_value   = 900,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,19)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 19,              %% 增加百分比
		step_value   = 950,             %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,20)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 20,              %% 增加百分比
		step_value   = 1000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 10,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,21)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 21,              %% 增加百分比
		step_value   = 1100,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,22)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 22,              %% 增加百分比
		step_value   = 1200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,23)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 23,              %% 增加百分比
		step_value   = 1300,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,24)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 24,              %% 增加百分比
		step_value   = 1400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,25)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 25,              %% 增加百分比
		step_value   = 1500,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,26)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 26,              %% 增加百分比
		step_value   = 1600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,27)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 27,              %% 增加百分比
		step_value   = 1700,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,28)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 28,              %% 增加百分比
		step_value   = 1800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,29)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 29,              %% 增加百分比
		step_value   = 1900,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,30)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 30,              %% 增加百分比
		step_value   = 2000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 15,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,31)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 31,              %% 增加百分比
		step_value   = 2100,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,32)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 32,              %% 增加百分比
		step_value   = 2200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,33)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 33,              %% 增加百分比
		step_value   = 2300,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,34)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 34,              %% 增加百分比
		step_value   = 2400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,35)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 35,              %% 增加百分比
		step_value   = 2500,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,36)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 36,              %% 增加百分比
		step_value   = 2600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,37)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 37,              %% 增加百分比
		step_value   = 2700,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,38)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 38,              %% 增加百分比
		step_value   = 2800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,39)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 39,              %% 增加百分比
		step_value   = 2900,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,40)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 40,              %% 增加百分比
		step_value   = 3000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 20,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,41)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 41,              %% 增加百分比
		step_value   = 3200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,42)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 42,              %% 增加百分比
		step_value   = 3400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,43)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 43,              %% 增加百分比
		step_value   = 3600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,44)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 44,              %% 增加百分比
		step_value   = 3800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,45)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 45,              %% 增加百分比
		step_value   = 4000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,46)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 46,              %% 增加百分比
		step_value   = 4200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,47)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 47,              %% 增加百分比
		step_value   = 4400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,48)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 48,              %% 增加百分比
		step_value   = 4600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,49)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 49,              %% 增加百分比
		step_value   = 4800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,50)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 50,              %% 增加百分比
		step_value   = 5000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 25,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,51)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 51,              %% 增加百分比
		step_value   = 5200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,52)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 52,              %% 增加百分比
		step_value   = 5400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,53)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 53,              %% 增加百分比
		step_value   = 5600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,54)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 54,              %% 增加百分比
		step_value   = 5800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,55)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 55,              %% 增加百分比
		step_value   = 6000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,56)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 56,              %% 增加百分比
		step_value   = 6200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,57)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 57,              %% 增加百分比
		step_value   = 6400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,58)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 58,              %% 增加百分比
		step_value   = 6600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,59)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 59,              %% 增加百分比
		step_value   = 6800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,60)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 60,              %% 增加百分比
		step_value   = 7000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 30,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,61)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 61,              %% 增加百分比
		step_value   = 7200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,62)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 62,              %% 增加百分比
		step_value   = 7400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,63)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 63,              %% 增加百分比
		step_value   = 7600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,64)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 64,              %% 增加百分比
		step_value   = 7800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,65)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 65,              %% 增加百分比
		step_value   = 8000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,66)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 66,              %% 增加百分比
		step_value   = 8200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,67)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 67,              %% 增加百分比
		step_value   = 8400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,68)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 68,              %% 增加百分比
		step_value   = 8600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,69)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 69,              %% 增加百分比
		step_value   = 8800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,70)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 70,              %% 增加百分比
		step_value   = 9000,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 35,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,71)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 71,              %% 增加百分比
		step_value   = 9200,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,72)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 72,              %% 增加百分比
		step_value   = 9400,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,73)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 73,              %% 增加百分比
		step_value   = 9600,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,74)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 74,              %% 增加百分比
		step_value   = 9800,            %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,75)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 75,              %% 增加百分比
		step_value   = 10000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,76)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 76,              %% 增加百分比
		step_value   = 10200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,77)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 77,              %% 增加百分比
		step_value   = 10400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,78)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 78,              %% 增加百分比
		step_value   = 10600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,79)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 79,              %% 增加百分比
		step_value   = 10800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,80)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 80,              %% 增加百分比
		step_value   = 11000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 40,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,81)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 81,              %% 增加百分比
		step_value   = 11200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,82)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 82,              %% 增加百分比
		step_value   = 11400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,83)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 83,              %% 增加百分比
		step_value   = 11600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,84)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 84,              %% 增加百分比
		step_value   = 11800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,85)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 85,              %% 增加百分比
		step_value   = 12000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,86)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 86,              %% 增加百分比
		step_value   = 12200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,87)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 87,              %% 增加百分比
		step_value   = 12400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,88)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 88,              %% 增加百分比
		step_value   = 12600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,89)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 89,              %% 增加百分比
		step_value   = 12800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,90)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 90,              %% 增加百分比
		step_value   = 13000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 45,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,91)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 91,              %% 增加百分比
		step_value   = 13200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,92)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 92,              %% 增加百分比
		step_value   = 13400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,93)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 93,              %% 增加百分比
		step_value   = 13600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,94)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 94,              %% 增加百分比
		step_value   = 13800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,95)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 95,              %% 增加百分比
		step_value   = 14000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,96)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 96,              %% 增加百分比
		step_value   = 14200,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,97)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 97,              %% 增加百分比
		step_value   = 14400,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,98)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 98,              %% 增加百分比
		step_value   = 14600,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,99)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 99,              %% 增加百分比
		step_value   = 14800,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(36,100)->
	#d_enchant{
		type_sub     = 36,              %% 装备子类型
		step         = 100,             %% 增加百分比
		step_value   = 15000,           %% 升阶值
		goods        = 34001,           %% 材料升阶
		money        = 50,              %% 消耗银币
		odds         = [{1,5600},{2,4000},{4,150},{6,100},{8,100},{10,50}]%% 升阶倍数，机率
	};
get(_,_)->?null.
