<?php  $sheets = array (
  0 => 
  array (
    'title' => 'Sheet2',
    'data' => 
    array (
      0 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
        3 => NULL,
        4 => NULL,
        5 => NULL,
        6 => NULL,
      ),
      1 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
        3 => NULL,
        4 => NULL,
        5 => NULL,
        6 => NULL,
      ),
      2 => 
      array (
        0 => '-',
        1 => '“-”开头为注',
        2 => '',
        3 => NULL,
        4 => NULL,
        5 => NULL,
        6 => NULL,
      ),
      3 => 
      array (
        0 => '-',
        1 => '技能动画类型：1=从左到右，2=敌方，3=自身,0=无',
        2 => '',
        3 => NULL,
        4 => NULL,
        5 => NULL,
        6 => NULL,
      ),
      4 => 
      array (
        0 => '-',
        1 => '技能特效表，暂无对应',
        2 => '',
        3 => NULL,
        4 => NULL,
        5 => NULL,
        6 => NULL,
      ),
      5 => 
      array (
        0 => 'REM',
        1 => '特效-战斗(技能)',
        2 => '',
        3 => '',
        4 => '',
        5 => '',
        6 => '',
      ),
      6 => 
      array (
        0 => 'REM',
        1 => '类型:1=>施放技能/攻击方   
     2=>被受技能/受击方   
     3=>全屏效果/其它大面积   
     4=>连继(如:射箭等轨道)效果   
     5=>酝酿(如:蓄能等停顿)效果',
        2 => '',
        3 => NULL,
        4 => NULL,
        5 => NULL,
        6 => NULL,
      ),
      7 => 
      array (
        0 => 'REM',
        1 => '',
        2 => '',
        3 => NULL,
        4 => NULL,
        5 => NULL,
        6 => NULL,
      ),
      8 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
        3 => NULL,
        4 => NULL,
        5 => NULL,
        6 => NULL,
      ),
      9 => 
      array (
        0 => 'FIELDS',
        1 => 'type_name',
        2 => 'type_id',
        3 => 'effect_id',
        4 => 'img_count',
        5 => 'anima_type',
        6 => 'effect_name',
      ),
      10 => 
      array (
        0 => 'NAME',
        1 => '类型名称',
        2 => '素材分类',
        3 => '技能特效ID',
        4 => '技能图片数量',
        5 => '技能动画类型',
        6 => '特效名称',
      ),
      11 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 101,
        4 => 8,
        5 => 2,
        6 => '玄冥护甲',
      ),
      12 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 202,
        4 => 8,
        5 => 2,
        6 => '斗魂惊云',
      ),
      13 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 103,
        4 => 8,
        5 => 2,
        6 => '天火神罩',
      ),
      14 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 215,
        4 => 8,
        5 => 1,
        6 => '乘风破浪',
      ),
      15 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 227,
        4 => 8,
        5 => 2,
        6 => '迅杀',
      ),
      16 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 232,
        4 => 12,
        5 => 2,
        6 => '血色沸腾',
      ),
      17 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 212,
        4 => 8,
        5 => 3,
        6 => '春之圣疗',
      ),
      18 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 217,
        4 => 8,
        5 => 2,
        6 => '突袭',
      ),
      19 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 204,
        4 => 8,
        5 => 2,
        6 => '星光护翼',
      ),
      20 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 232,
        4 => 12,
        5 => 2,
        6 => '斗破苍穹',
      ),
      21 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 233,
        4 => 8,
        5 => 1,
        6 => '浩气震天',
      ),
      22 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 108,
        4 => 12,
        5 => 1,
        6 => '破甲',
      ),
      23 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 212,
        4 => 8,
        5 => 3,
        6 => '妙手回春',
      ),
      24 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 215,
        4 => 8,
        5 => 1,
        6 => '碎风飞箭',
      ),
      25 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 206,
        4 => 12,
        5 => 2,
        6 => '幻影迷踪',
      ),
      26 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 223,
        4 => 8,
        5 => 2,
        6 => '凌波微步',
      ),
      27 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 217,
        4 => 8,
        5 => 2,
        6 => '迎风千刃',
      ),
      28 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 228,
        4 => 8,
        5 => 1,
        6 => '雷云啸',
      ),
      29 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 205,
        4 => 12,
        5 => 2,
        6 => '原形毕露',
      ),
      30 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 233,
        4 => 8,
        5 => 1,
        6 => '天颜威怒',
      ),
      31 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 216,
        4 => 8,
        5 => 1,
        6 => '回旋劲刺',
      ),
      32 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 222,
        4 => 8,
        5 => 2,
        6 => '玉步轻影',
      ),
      33 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 227,
        4 => 8,
        5 => 2,
        6 => '兽王箭',
      ),
      34 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 112,
        4 => 8,
        5 => 1,
        6 => '天神怒吼',
      ),
      35 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 228,
        4 => 8,
        5 => 1,
        6 => '无所遁形',
      ),
      36 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 213,
        4 => 8,
        5 => 2,
        6 => '贼眉鼠眼',
      ),
      37 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 114,
        4 => 12,
        5 => 2,
        6 => '霸气侧漏',
      ),
      38 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 222,
        4 => 8,
        5 => 2,
        6 => '痛苦之源',
      ),
      39 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 115,
        4 => 12,
        5 => 2,
        6 => '仙灵附体',
      ),
      40 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 233,
        4 => 8,
        5 => 1,
        6 => '天音爆破',
      ),
      41 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 232,
        4 => 12,
        5 => 2,
        6 => '驭剑焚天',
      ),
      42 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 214,
        4 => 8,
        5 => 1,
        6 => '叶叶飘零',
      ),
      43 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 212,
        4 => 8,
        5 => 3,
        6 => '上善若水',
      ),
      44 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 206,
        4 => 12,
        5 => 2,
        6 => '黯夜迷香',
      ),
      45 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 103,
        4 => 8,
        5 => 2,
        6 => '空谷幽兰',
      ),
      46 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 210,
        4 => 12,
        5 => 2,
        6 => '冰蓝音波',
      ),
      47 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 223,
        4 => 8,
        5 => 2,
        6 => '色即是空',
      ),
      48 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 215,
        4 => 8,
        5 => 1,
        6 => '反击',
      ),
      49 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 208,
        4 => 8,
        5 => 2,
        6 => '岩盾',
      ),
      50 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 109,
        4 => 12,
        5 => 2,
        6 => '铁布衫',
      ),
      51 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 208,
        4 => 8,
        5 => 2,
        6 => '金甲护体',
      ),
      52 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 214,
        4 => 8,
        5 => 1,
        6 => '阴阳盾',
      ),
      53 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 228,
        4 => 8,
        5 => 1,
        6 => '风遁',
      ),
      54 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 204,
        4 => 8,
        5 => 2,
        6 => '迷踪',
      ),
      55 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 113,
        4 => 8,
        5 => 1,
        6 => '影之箭',
      ),
      56 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 104,
        4 => 8,
        5 => 1,
        6 => '迷闪烁',
      ),
      57 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 106,
        4 => 8,
        5 => 2,
        6 => '石化',
      ),
      58 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 205,
        4 => 12,
        5 => 2,
        6 => '岩盾',
      ),
      59 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 202,
        4 => 8,
        5 => 2,
        6 => '百步杀',
      ),
      60 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 227,
        4 => 8,
        5 => 2,
        6 => '风暴锤',
      ),
      61 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 224,
        4 => 8,
        5 => 2,
        6 => '强击',
      ),
      62 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 230,
        4 => 8,
        5 => 2,
        6 => '惊雷术',
      ),
      63 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 102,
        4 => 8,
        5 => 1,
        6 => '霹雳斩',
      ),
      64 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 107,
        4 => 12,
        5 => 2,
        6 => '血祀',
      ),
      65 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 230,
        4 => 8,
        5 => 2,
        6 => '惊雷术',
      ),
      66 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 219,
        4 => 8,
        5 => 2,
        6 => '聚灵',
      ),
      67 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 209,
        4 => 10,
        5 => 2,
        6 => '突刺',
      ),
      68 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 110,
        4 => 12,
        5 => 2,
        6 => '刚箭',
      ),
      69 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 111,
        4 => 12,
        5 => 2,
        6 => '苍羽箭',
      ),
      70 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 113,
        4 => 8,
        5 => 1,
        6 => '水云箭',
      ),
      71 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 217,
        4 => 8,
        5 => 2,
        6 => '龙牙箭',
      ),
      72 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 104,
        4 => 8,
        5 => 1,
        6 => '愤怒一击',
      ),
      73 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 105,
        4 => 12,
        5 => 2,
        6 => '狂野',
      ),
      74 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 216,
        4 => 8,
        5 => 1,
        6 => '鬼神之怒',
      ),
      75 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 217,
        4 => 8,
        5 => 2,
        6 => '零式',
      ),
      76 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 209,
        4 => 8,
        5 => 1,
        6 => '赤月杀',
      ),
      77 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 215,
        4 => 8,
        5 => 1,
        6 => '会心一击',
      ),
      78 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 208,
        4 => 8,
        5 => 2,
        6 => '排山击',
      ),
      79 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 204,
        4 => 8,
        5 => 2,
        6 => '苍痕术',
      ),
      80 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 224,
        4 => 8,
        5 => 2,
        6 => '琉璃波',
      ),
      81 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 108,
        4 => 12,
        5 => 1,
        6 => '裂甲',
      ),
      82 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 113,
        4 => 8,
        5 => 1,
        6 => '破竹',
      ),
      83 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 213,
        4 => 8,
        5 => 2,
        6 => '沉醉',
      ),
      84 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 109,
        4 => 12,
        5 => 2,
        6 => '迷梦',
      ),
      85 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 114,
        4 => 12,
        5 => 2,
        6 => '昏睡',
      ),
      86 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 106,
        4 => 8,
        5 => 2,
        6 => '火燎',
      ),
      87 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 212,
        4 => 8,
        5 => 3,
        6 => '治愈术',
      ),
      88 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 212,
        4 => 8,
        5 => 3,
        6 => '回春术',
      ),
      89 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 212,
        4 => 8,
        5 => 3,
        6 => '滋养',
      ),
      90 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 212,
        4 => 8,
        5 => 3,
        6 => '续命术',
      ),
      91 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 115,
        4 => 12,
        5 => 2,
        6 => '大地怒吼',
      ),
      92 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 210,
        4 => 12,
        5 => 2,
        6 => '疯狂连斩',
      ),
      93 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 228,
        4 => 8,
        5 => 1,
        6 => '漫天飞雨',
      ),
      94 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 227,
        4 => 8,
        5 => 2,
        6 => '流星落',
      ),
      95 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 233,
        4 => 8,
        5 => 1,
        6 => '飞空摘星',
      ),
      96 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 111,
        4 => 12,
        5 => 2,
        6 => '惊涛海岸',
      ),
      97 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 112,
        4 => 8,
        5 => 1,
        6 => '恐惧流',
      ),
      98 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 230,
        4 => 8,
        5 => 2,
        6 => '毁天灭地',
      ),
      99 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 217,
        4 => 8,
        5 => 2,
        6 => '箭雨流星',
      ),
      100 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 214,
        4 => 8,
        5 => 1,
        6 => '万箭齐发',
      ),
      101 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 206,
        4 => 12,
        5 => 2,
        6 => '燕南归',
      ),
      102 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 105,
        4 => 12,
        5 => 2,
        6 => '鹰击长空',
      ),
      103 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 102,
        4 => 8,
        5 => 1,
        6 => '破阵子',
      ),
      104 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 113,
        4 => 8,
        5 => 1,
        6 => '势如破竹',
      ),
      105 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 213,
        4 => 8,
        5 => 2,
        6 => '寂灭破 ',
      ),
      106 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 115,
        4 => 12,
        5 => 2,
        6 => '九幽烈焰',
      ),
      107 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 108,
        4 => 12,
        5 => 1,
        6 => '次元杀',
      ),
      108 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 223,
        4 => 8,
        5 => 2,
        6 => '暴风空间',
      ),
      109 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 207,
        4 => 8,
        5 => 3,
        6 => '五气归元',
      ),
      110 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 109,
        4 => 12,
        5 => 2,
        6 => '定风波',
      ),
      111 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 205,
        4 => 12,
        5 => 2,
        6 => '天机算',
      ),
      112 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 101,
        4 => 8,
        5 => 2,
        6 => '碧空星落',
      ),
      113 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 102,
        4 => 8,
        5 => 1,
        6 => '残风引月',
      ),
      114 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 217,
        4 => 8,
        5 => 2,
        6 => '未雨绸缪',
      ),
      115 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 104,
        4 => 8,
        5 => 1,
        6 => '抽刀断水',
      ),
      116 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 105,
        4 => 12,
        5 => 2,
        6 => '平沙落雁',
      ),
      117 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 111,
        4 => 12,
        5 => 2,
        6 => '玉璧珠联',
      ),
      118 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 107,
        4 => 12,
        5 => 2,
        6 => '一呼百应',
      ),
      119 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 108,
        4 => 12,
        5 => 1,
        6 => '以退为进',
      ),
      120 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 109,
        4 => 12,
        5 => 2,
        6 => '绝杀',
      ),
      121 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 110,
        4 => 12,
        5 => 2,
        6 => '络灵印',
      ),
      122 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 204,
        4 => 8,
        5 => 2,
        6 => '混元轰',
      ),
      123 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 114,
        4 => 12,
        5 => 2,
        6 => '灵冰诀',
      ),
      124 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 113,
        4 => 8,
        5 => 1,
        6 => '烈火归元',
      ),
      125 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 206,
        4 => 12,
        5 => 2,
        6 => '捕风捉影',
      ),
      126 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 233,
        4 => 8,
        5 => 1,
        6 => '玄机变',
      ),
      127 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 202,
        4 => 8,
        5 => 2,
        6 => '过河拆桥',
      ),
      128 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 115,
        4 => 12,
        5 => 2,
        6 => '惊雷闪',
      ),
      129 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 213,
        4 => 8,
        5 => 2,
        6 => '天机幻',
      ),
      130 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 222,
        4 => 8,
        5 => 2,
        6 => '天蚕术',
      ),
      131 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 219,
        4 => 8,
        5 => 2,
        6 => '春风化雨',
      ),
      132 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 230,
        4 => 8,
        5 => 2,
        6 => '元始梵咒',
      ),
      133 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 208,
        4 => 8,
        5 => 2,
        6 => '海底捞月',
      ),
      134 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 232,
        4 => 12,
        5 => 2,
        6 => '防不胜防',
      ),
      135 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 224,
        4 => 8,
        5 => 2,
        6 => '惊世迷音',
      ),
      136 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 112,
        4 => 8,
        5 => 1,
        6 => '泰山压顶',
      ),
      137 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 215,
        4 => 8,
        5 => 1,
        6 => '峰回路转',
      ),
      138 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 216,
        4 => 8,
        5 => 1,
        6 => '迦蓝圣焰',
      ),
      139 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 215,
        4 => 8,
        5 => 1,
        6 => '擎天破',
      ),
      140 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 115,
        4 => 12,
        5 => 2,
        6 => '暗影星象',
      ),
      141 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 103,
        4 => 8,
        5 => 2,
        6 => '十方俱灭',
      ),
      142 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 106,
        4 => 8,
        5 => 2,
        6 => '殊途同归',
      ),
      143 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 206,
        4 => 12,
        5 => 2,
        6 => '偷天换日',
      ),
      144 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 216,
        4 => 8,
        5 => 1,
        6 => '天逆',
      ),
      145 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 205,
        4 => 12,
        5 => 2,
        6 => '厚积薄发',
      ),
      146 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 219,
        4 => 8,
        5 => 2,
        6 => '丹阳圣术',
      ),
      147 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 209,
        4 => 10,
        5 => 2,
        6 => '幻影无双',
      ),
      148 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 227,
        4 => 8,
        5 => 2,
        6 => '天火流星',
      ),
      149 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 228,
        4 => 8,
        5 => 1,
        6 => '醉春风',
      ),
      150 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 216,
        4 => 8,
        5 => 1,
        6 => '落风回雪',
      ),
      151 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 234,
        4 => 8,
        5 => 2,
        6 => '真元咒',
      ),
      152 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 212,
        4 => 8,
        5 => 2,
        6 => '推波助澜',
      ),
      153 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 222,
        4 => 8,
        5 => 2,
        6 => '化茧破蝶',
      ),
      154 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 233,
        4 => 8,
        5 => 1,
        6 => '焚天音波',
      ),
      155 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 219,
        4 => 8,
        5 => 2,
        6 => '阳春白雪',
      ),
      156 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 230,
        4 => 8,
        5 => 2,
        6 => '梦之迷光',
      ),
      157 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 213,
        4 => 8,
        5 => 2,
        6 => '冥音净化',
      ),
      158 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 228,
        4 => 8,
        5 => 1,
        6 => '星沉地动',
      ),
      159 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 111,
        4 => 12,
        5 => 2,
        6 => '排山倒海',
      ),
      160 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 220,
        4 => 8,
        5 => 3,
        6 => '天芒',
      ),
      161 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 106,
        4 => 8,
        5 => 2,
        6 => '傲气',
      ),
      162 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 202,
        4 => 8,
        5 => 2,
        6 => '续命',
      ),
      163 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 108,
        4 => 12,
        5 => 1,
        6 => '压制',
      ),
      164 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 105,
        4 => 12,
        5 => 2,
        6 => '撒旦',
      ),
      165 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 216,
        4 => 8,
        5 => 1,
        6 => '坚韧',
      ),
      166 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 208,
        4 => 8,
        5 => 2,
        6 => '弹指神通',
      ),
      167 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 215,
        4 => 8,
        5 => 1,
        6 => '水漫金山',
      ),
      168 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 210,
        4 => 12,
        5 => 2,
        6 => '一斧当关',
      ),
      169 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 110,
        4 => 12,
        5 => 2,
        6 => '入梦伏龙',
      ),
      170 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 232,
        4 => 12,
        5 => 2,
        6 => '焚心刀法',
      ),
      171 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 228,
        4 => 8,
        5 => 1,
        6 => '三味神风',
      ),
      172 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 212,
        4 => 8,
        5 => 3,
        6 => '枯木逢春',
      ),
      173 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 223,
        4 => 8,
        5 => 2,
        6 => '未卜先知',
      ),
      174 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 233,
        4 => 8,
        5 => 1,
        6 => '黑面赤胆',
      ),
      175 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 110,
        4 => 12,
        5 => 2,
        6 => '闹海降龙',
      ),
      176 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 233,
        4 => 8,
        5 => 1,
        6 => '撒手锏',
      ),
      177 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 103,
        4 => 8,
        5 => 2,
        6 => '大鹏展翅',
      ),
      178 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 212,
        4 => 8,
        5 => 3,
        6 => '潜灵养性',
      ),
      179 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 205,
        4 => 12,
        5 => 2,
        6 => '天罗地网',
      ),
      180 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 224,
        4 => 8,
        5 => 2,
        6 => '魂飞魄散',
      ),
      181 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 222,
        4 => 8,
        5 => 2,
        6 => '隐仙术',
      ),
      182 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 214,
        4 => 8,
        5 => 1,
        6 => '飞箭兰香',
      ),
      183 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 219,
        4 => 8,
        5 => 2,
        6 => '紫铃生烟',
      ),
      184 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 216,
        4 => 8,
        5 => 1,
        6 => '飞蛾扑火',
      ),
      185 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 204,
        4 => 8,
        5 => 2,
        6 => '功成身退',
      ),
      186 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 106,
        4 => 8,
        5 => 2,
        6 => '天罡三斧',
      ),
      187 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 202,
        4 => 8,
        5 => 2,
        6 => '追魂夺命',
      ),
      188 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 107,
        4 => 12,
        5 => 2,
        6 => '趁火打劫',
      ),
      189 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 216,
        4 => 8,
        5 => 1,
        6 => '快刀斩麻',
      ),
      190 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 101,
        4 => 8,
        5 => 2,
        6 => '轻云蔽月',
      ),
      191 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 222,
        4 => 8,
        5 => 2,
        6 => '闭月羞花',
      ),
      192 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 102,
        4 => 8,
        5 => 1,
        6 => '一锤定音',
      ),
      193 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 115,
        4 => 12,
        5 => 2,
        6 => '狐颜媚色',
      ),
      194 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 204,
        4 => 8,
        5 => 2,
        6 => '流沙狂潮',
      ),
      195 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 113,
        4 => 8,
        5 => 1,
        6 => '剑走偏锋',
      ),
      196 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 109,
        4 => 12,
        5 => 2,
        6 => '法天象地',
      ),
      197 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 108,
        4 => 12,
        5 => 1,
        6 => '九转玄功',
      ),
      198 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 112,
        4 => 8,
        5 => 1,
        6 => '倒打一耙',
      ),
      199 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 232,
        4 => 12,
        5 => 2,
        6 => '三昧真火',
      ),
      200 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 115,
        4 => 12,
        5 => 2,
        6 => '三尸化身',
      ),
      201 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 213,
        4 => 8,
        5 => 2,
        6 => '九天揽月',
      ),
      202 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 111,
        4 => 12,
        5 => 2,
        6 => '开元盛世',
      ),
      203 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 104,
        4 => 8,
        5 => 1,
        6 => '偷龙转凤',
      ),
      204 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 114,
        4 => 12,
        5 => 2,
        6 => '金蝉脱壳',
      ),
      205 => 
      array (
        0 => 'VALUE',
        1 => '被受技能/受击方',
        2 => 1,
        3 => 234,
        4 => 8,
        5 => 2,
        6 => '七十二变',
      ),
      206 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 501,
        4 => 6,
        5 => 1,
        6 => '战灵女普通攻击',
      ),
      207 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 502,
        4 => 6,
        5 => 1,
        6 => '战灵男普通攻击',
      ),
      208 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 503,
        4 => 6,
        5 => 1,
        6 => '神策普通攻击',
      ),
      209 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 504,
        4 => 6,
        5 => 1,
        6 => '箭羽普通攻击',
      ),
      210 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 401,
        4 => 9,
        5 => 0,
        6 => '白烟',
      ),
      211 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 402,
        4 => 9,
        5 => 0,
        6 => '黑烟',
      ),
      212 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 203,
        4 => 8,
        5 => 3,
        6 => '加攻击',
      ),
      213 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 231,
        4 => 8,
        5 => 3,
        6 => '加防御',
      ),
      214 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 211,
        4 => 8,
        5 => 3,
        6 => '加速度',
      ),
      215 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 218,
        4 => 14,
        5 => 3,
        6 => '加暴击',
      ),
      216 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 201,
        4 => 8,
        5 => 3,
        6 => '加命中',
      ),
      217 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 207,
        4 => 8,
        5 => 3,
        6 => '加闪避',
      ),
      218 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 225,
        4 => 8,
        5 => 3,
        6 => '加格挡',
      ),
      219 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 226,
        4 => 12,
        5 => 3,
        6 => '加破击',
      ),
      220 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 229,
        4 => 6,
        5 => 3,
        6 => '免疫',
      ),
      221 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 212,
        4 => 8,
        5 => 3,
        6 => '加血',
      ),
      222 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 220,
        4 => 8,
        5 => 3,
        6 => '加士气',
      ),
      223 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 221,
        4 => 8,
        5 => 3,
        6 => '换位置',
      ),
      224 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 601,
        4 => 8,
        5 => 2,
        6 => '中毒',
      ),
      225 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 602,
        4 => 8,
        5 => 2,
        6 => '眩晕',
      ),
      226 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 603,
        4 => 8,
        5 => 2,
        6 => '睡眠',
      ),
      227 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 604,
        4 => 8,
        5 => 2,
        6 => '混乱',
      ),
      228 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 605,
        4 => 12,
        5 => 2,
        6 => '士气满',
      ),
      229 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 106,
        4 => 8,
        5 => 2,
        6 => '雷塔封咒',
      ),
      230 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 214,
        4 => 8,
        5 => 1,
        6 => '乘风破浪',
      ),
      231 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 219,
        4 => 8,
        5 => 2,
        6 => '暗影留香',
      ),
      232 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 209,
        4 => 10,
        5 => 2,
        6 => '九九归一',
      ),
      233 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 234,
        4 => 8,
        5 => 2,
        6 => '七十二变',
      ),
      234 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 216,
        4 => 8,
        5 => 1,
        6 => '煽风点火',
      ),
      235 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 204,
        4 => 8,
        5 => 2,
        6 => '青莲仙术',
      ),
      236 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 225,
        4 => 8,
        5 => 2,
        6 => '灭世战佛',
      ),
      237 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 221,
        4 => 8,
        5 => 2,
        6 => '通天净坛',
      ),
      238 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 107,
        4 => 12,
        5 => 2,
        6 => '菩提金身',
      ),
      239 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 208,
        4 => 8,
        5 => 2,
        6 => '牛气冲天',
      ),
      240 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 112,
        4 => 8,
        5 => 1,
        6 => '无法无天',
      ),
      241 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 209,
        4 => 10,
        5 => 2,
        6 => '赏善罚恶',
      ),
      242 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 231,
        4 => 8,
        5 => 2,
        6 => '以和服人',
      ),
      243 => 
      array (
        0 => 'VALUE',
        1 => '施放技能/攻击方',
        2 => 1,
        3 => 221,
        4 => 8,
        5 => 2,
        6 => '贵妃醉酒',
      ),
    ),
  ),
);?>