<?php  $sheets = array (
  0 => 
  array (
    'title' => '伙伴 ID格式(3xxxx)',
    'data' => 
    array (
      0 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      1 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      2 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      3 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      4 => 
      array (
        0 => 'REM',
        1 => 'NPC头像',
        2 => '',
        3 => '',
      ),
      5 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => '',
        3 => NULL,
      ),
      6 => 
      array (
        0 => 'REM',
        1 => 'ID格式:1xxxx',
        2 => '',
        3 => '',
      ),
      7 => 
      array (
        0 => 'FIELDS',
        1 => 'head_name',
        2 => 'head_type',
        3 => 'head_id',
      ),
      8 => 
      array (
        0 => 'REM',
        1 => '头像名称',
        2 => '类型',
        3 => '头像ID',
      ),
      9 => 
      array (
        0 => 'VALUE',
        1 => '郭靖',
        2 => 1,
        3 => 11010,
      ),
      10 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      11 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      12 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      13 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      14 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      15 => 
      array (
        0 => 'REM',
        1 => '怪物头像',
        2 => '',
        3 => '',
      ),
      16 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
        3 => '',
      ),
      17 => 
      array (
        0 => 'REM',
        1 => 'ID格式:2xxxx',
        2 => '',
        3 => '',
      ),
      18 => 
      array (
        0 => 'REM',
        1 => 'head_name',
        2 => 'head_type',
        3 => 'head_id',
      ),
      19 => 
      array (
        0 => 'REM',
        1 => '头像名称',
        2 => '类型',
        3 => '头像ID',
      ),
      20 => 
      array (
        0 => 'VALUE',
        1 => '郭靖',
        2 => 2,
        3 => 21010,
      ),
      21 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      22 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      23 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      24 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      25 => 
      array (
        0 => 'REM',
        1 => '伙伴头像',
        2 => '',
        3 => '',
      ),
      26 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
        3 => '',
      ),
      27 => 
      array (
        0 => 'REM',
        1 => 'ID格式:3xxxx',
        2 => '',
        3 => '',
      ),
      28 => 
      array (
        0 => 'REM',
        1 => 'head_name',
        2 => 'head_type',
        3 => 'head_id',
      ),
      29 => 
      array (
        0 => 'REM',
        1 => '头像名称',
        2 => '类型',
        3 => '头像ID',
      ),
      30 => 
      array (
        0 => 'VALUE',
        1 => '郭靖',
        2 => 3,
        3 => 31010,
      ),
      31 => 
      array (
        0 => 'VALUE',
        1 => '白素贞',
        2 => 3,
        3 => 31020,
      ),
      32 => 
      array (
        0 => 'VALUE',
        1 => '巨灵神',
        2 => 3,
        3 => 31030,
      ),
      33 => 
      array (
        0 => 'VALUE',
        1 => '东华帝君',
        2 => 3,
        3 => 31040,
      ),
      34 => 
      array (
        0 => 'VALUE',
        1 => '紫霞仙子',
        2 => 3,
        3 => 31050,
      ),
      35 => 
      array (
        0 => 'VALUE',
        1 => '金吒',
        2 => 3,
        3 => 31060,
      ),
      36 => 
      array (
        0 => 'VALUE',
        1 => '魏征',
        2 => 3,
        3 => 31070,
      ),
      37 => 
      array (
        0 => 'VALUE',
        1 => '袁天罡',
        2 => 3,
        3 => 31080,
      ),
      38 => 
      array (
        0 => 'VALUE',
        1 => '李渊',
        2 => 3,
        3 => 31090,
      ),
      39 => 
      array (
        0 => 'VALUE',
        1 => '高翠兰',
        2 => 3,
        3 => 31100,
      ),
      40 => 
      array (
        0 => 'VALUE',
        1 => '狮驼王',
        2 => 3,
        3 => 31110,
      ),
      41 => 
      array (
        0 => 'VALUE',
        1 => '黄风怪',
        2 => 3,
        3 => 31120,
      ),
      42 => 
      array (
        0 => 'VALUE',
        1 => '蛟魔王',
        2 => 3,
        3 => 31130,
      ),
      43 => 
      array (
        0 => 'VALUE',
        1 => '赛太岁',
        2 => 3,
        3 => 31140,
      ),
      44 => 
      array (
        0 => 'VALUE',
        1 => '小白龙',
        2 => 3,
        3 => 31150,
      ),
      45 => 
      array (
        0 => 'VALUE',
        1 => '哪吒',
        2 => 3,
        3 => 31160,
      ),
      46 => 
      array (
        0 => 'VALUE',
        1 => '嫦娥',
        2 => 3,
        3 => 31170,
      ),
      47 => 
      array (
        0 => 'VALUE',
        1 => '秦广王',
        2 => 3,
        3 => 31180,
      ),
      48 => 
      array (
        0 => 'VALUE',
        1 => '沙僧',
        2 => 3,
        3 => 31190,
      ),
      49 => 
      array (
        0 => 'VALUE',
        1 => '秦琼',
        2 => 3,
        3 => 31200,
      ),
      50 => 
      array (
        0 => 'VALUE',
        1 => '尉迟恭',
        2 => 3,
        3 => 31210,
      ),
      51 => 
      array (
        0 => 'VALUE',
        1 => '百花羞',
        2 => 3,
        3 => 31220,
      ),
      52 => 
      array (
        0 => 'VALUE',
        1 => '程咬金',
        2 => 3,
        3 => 31230,
      ),
      53 => 
      array (
        0 => 'VALUE',
        1 => '李元霸',
        2 => 3,
        3 => 31240,
      ),
      54 => 
      array (
        0 => 'VALUE',
        1 => '蜘蛛精',
        2 => 3,
        3 => 31250,
      ),
      55 => 
      array (
        0 => 'VALUE',
        1 => '金翅雕',
        2 => 3,
        3 => 31260,
      ),
      56 => 
      array (
        0 => 'VALUE',
        1 => '黑熊精',
        2 => 3,
        3 => 31270,
      ),
      57 => 
      array (
        0 => 'VALUE',
        1 => '黄袍怪',
        2 => 3,
        3 => 31280,
      ),
      58 => 
      array (
        0 => 'VALUE',
        1 => '玉面狐',
        2 => 3,
        3 => 31290,
      ),
      59 => 
      array (
        0 => 'VALUE',
        1 => '二郎神',
        2 => 3,
        3 => 31300,
      ),
      60 => 
      array (
        0 => 'VALUE',
        1 => '猪八戒',
        2 => 3,
        3 => 31310,
      ),
      61 => 
      array (
        0 => 'VALUE',
        1 => '九天玄女',
        2 => 3,
        3 => 31320,
      ),
      62 => 
      array (
        0 => 'VALUE',
        1 => '李世民',
        2 => 3,
        3 => 31330,
      ),
      63 => 
      array (
        0 => 'VALUE',
        1 => '武则天',
        2 => 3,
        3 => 31340,
      ),
      64 => 
      array (
        0 => 'VALUE',
        1 => '宇文拓',
        2 => 3,
        3 => 31350,
      ),
      65 => 
      array (
        0 => 'VALUE',
        1 => '牛魔王',
        2 => 3,
        3 => 31360,
      ),
      66 => 
      array (
        0 => 'VALUE',
        1 => '红孩儿',
        2 => 3,
        3 => 31370,
      ),
      67 => 
      array (
        0 => 'VALUE',
        1 => '白骨精',
        2 => 3,
        3 => 31380,
      ),
      68 => 
      array (
        0 => 'VALUE',
        1 => '唐僧',
        2 => 3,
        3 => 31390,
      ),
      69 => 
      array (
        0 => 'VALUE',
        1 => '孙悟空',
        2 => 3,
        3 => 31400,
      ),
      70 => 
      array (
        0 => 'VALUE',
        1 => '托塔天王',
        2 => 3,
        3 => 31410,
      ),
      71 => 
      array (
        0 => 'VALUE',
        1 => '玉皇大帝',
        2 => 3,
        3 => 31420,
      ),
      72 => 
      array (
        0 => 'VALUE',
        1 => '红拂女',
        2 => 3,
        3 => 31430,
      ),
      73 => 
      array (
        0 => 'VALUE',
        1 => '九头虫',
        2 => 3,
        3 => 31440,
      ),
      74 => 
      array (
        0 => 'VALUE',
        1 => '铁扇公主',
        2 => 3,
        3 => 31450,
      ),
      75 => 
      array (
        0 => 'VALUE',
        1 => '武媚才人',
        2 => 3,
        3 => 31460,
      ),
      76 => 
      array (
        0 => 'VALUE',
        1 => '李白',
        2 => 3,
        3 => 31470,
      ),
      77 => 
      array (
        0 => 'VALUE',
        1 => '五仙女',
        2 => 3,
        3 => 31480,
      ),
      78 => 
      array (
        0 => 'VALUE',
        1 => '观音菩萨',
        2 => 3,
        3 => 31490,
      ),
      79 => 
      array (
        0 => 'VALUE',
        1 => '斗战胜佛',
        2 => 3,
        3 => 31500,
      ),
      80 => 
      array (
        0 => 'VALUE',
        1 => '净坛使者',
        2 => 3,
        3 => 31510,
      ),
      81 => 
      array (
        0 => 'VALUE',
        1 => '金身罗汉',
        2 => 3,
        3 => 31520,
      ),
      82 => 
      array (
        0 => 'VALUE',
        1 => '白莲花',
        2 => 3,
        3 => 31530,
      ),
      83 => 
      array (
        0 => 'VALUE',
        1 => '鬼影守卫',
        2 => 3,
        3 => 31540,
      ),
      84 => 
      array (
        0 => 'VALUE',
        1 => '黑袍',
        2 => 3,
        3 => 31550,
      ),
      85 => 
      array (
        0 => 'VALUE',
        1 => '六耳猕猴',
        2 => 3,
        3 => 31560,
      ),
      86 => 
      array (
        0 => 'VALUE',
        1 => '乔灵儿',
        2 => 3,
        3 => 31570,
      ),
      87 => 
      array (
        0 => 'VALUE',
        1 => '太白金星',
        2 => 3,
        3 => 31580,
      ),
      88 => 
      array (
        0 => 'VALUE',
        1 => '太乙真人',
        2 => 3,
        3 => 31590,
      ),
      89 => 
      array (
        0 => 'VALUE',
        1 => '吴刚',
        2 => 3,
        3 => 31600,
      ),
      90 => 
      array (
        0 => 'VALUE',
        1 => '杨贵妃',
        2 => 3,
        3 => 31610,
      ),
      91 => 
      array (
        0 => 'VALUE',
        1 => '独角兕',
        2 => 3,
        3 => 31620,
      ),
      92 => 
      array (
        0 => 'VALUE',
        1 => '金灵圣母',
        2 => 3,
        3 => 31630,
      ),
      93 => 
      array (
        0 => 'VALUE',
        1 => '无天',
        2 => 3,
        3 => 31640,
      ),
      94 => 
      array (
        0 => 'VALUE',
        1 => '阿修罗',
        2 => 3,
        3 => 31650,
      ),
      95 => 
      array (
        0 => 'VALUE',
        1 => '婉华仙子',
        2 => 3,
        3 => 31660,
      ),
      96 => 
      array (
        0 => 'VALUE',
        1 => '共工',
        2 => 3,
        3 => 31670,
      ),
      97 => 
      array (
        0 => 'VALUE',
        1 => '女娲',
        2 => 3,
        3 => 31680,
      ),
      98 => 
      array (
        0 => 'VALUE',
        1 => '后羿',
        2 => 3,
        3 => 31690,
      ),
      99 => 
      array (
        0 => 'VALUE',
        1 => '神秘人',
        2 => 3,
        3 => 31800,
      ),
    ),
  ),
);?>