<?php  $sheets = array (
  0 => 
  array (
    'title' => 'Sheet1',
    'data' => 
    array (
      0 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
      ),
      1 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
      ),
      2 => 
      array (
        0 => '-',
        1 => '“-”开头为注',
        2 => '',
      ),
      3 => 
      array (
        0 => 'REM',
        1 => 'Buff-技能效果图标',
        2 => '',
      ),
      4 => 
      array (
        0 => '',
        1 => '',
        2 => '',
      ),
      5 => 
      array (
        0 => 'FIELDS',
        1 => 'buff_name',
        2 => 'ms_id',
      ),
      6 => 
      array (
        0 => 'PLIST',
        1 => 'yes',
        2 => 'yes',
      ),
      7 => 
      array (
        0 => 'ERL',
        1 => 'no',
        2 => 'no',
      ),
      8 => 
      array (
        0 => 'NAME',
        1 => 'Buff名称',
        2 => 'Buff图标id',
      ),
      9 => 
      array (
        0 => 'VALUE',
        1 => '帮派BUFF',
        2 => 1,
      ),
      10 => 
      array (
        0 => 'VALUE',
        1 => '世界平均等级',
        2 => 2,
      ),
      11 => 
      array (
        0 => 'VALUE',
        1 => '天宫BUFF',
        2 => 3,
      ),
      12 => 
      array (
        0 => 'VALUE',
        1 => '攻击上升',
        2 => 10,
      ),
      13 => 
      array (
        0 => 'VALUE',
        1 => '攻击下降',
        2 => 15,
      ),
      14 => 
      array (
        0 => 'VALUE',
        1 => '防御上升',
        2 => 20,
      ),
      15 => 
      array (
        0 => 'VALUE',
        1 => '防御下降',
        2 => 25,
      ),
      16 => 
      array (
        0 => 'VALUE',
        1 => '速度上升',
        2 => 26,
      ),
      17 => 
      array (
        0 => 'VALUE',
        1 => '速度下降',
        2 => 27,
      ),
      18 => 
      array (
        0 => 'VALUE',
        1 => '暴击上升',
        2 => 30,
      ),
      19 => 
      array (
        0 => 'VALUE',
        1 => '暴击下降',
        2 => 35,
      ),
      20 => 
      array (
        0 => 'VALUE',
        1 => '命中上升',
        2 => 40,
      ),
      21 => 
      array (
        0 => 'VALUE',
        1 => '命中下降',
        2 => 45,
      ),
      22 => 
      array (
        0 => 'VALUE',
        1 => '躲避上升',
        2 => 50,
      ),
      23 => 
      array (
        0 => 'VALUE',
        1 => '躲避下降',
        2 => 55,
      ),
      24 => 
      array (
        0 => 'VALUE',
        1 => '格挡上升',
        2 => 60,
      ),
      25 => 
      array (
        0 => 'VALUE',
        1 => '格挡下降',
        2 => 65,
      ),
      26 => 
      array (
        0 => 'VALUE',
        1 => '破击上升',
        2 => 70,
      ),
      27 => 
      array (
        0 => 'VALUE',
        1 => '破击下降',
        2 => 75,
      ),
      28 => 
      array (
        0 => 'VALUE',
        1 => '每回合回血',
        2 => 80,
      ),
      29 => 
      array (
        0 => 'VALUE',
        1 => '中毒',
        2 => 85,
      ),
      30 => 
      array (
        0 => 'VALUE',
        1 => '烧伤',
        2 => 90,
      ),
      31 => 
      array (
        0 => 'VALUE',
        1 => '眩晕',
        2 => 100,
      ),
      32 => 
      array (
        0 => 'VALUE',
        1 => '免疫眩晕',
        2 => 110,
      ),
      33 => 
      array (
        0 => 'VALUE',
        1 => '降低治疗效果',
        2 => 115,
      ),
      34 => 
      array (
        0 => 'VALUE',
        1 => '每回合降士气',
        2 => 120,
      ),
      35 => 
      array (
        0 => 'VALUE',
        1 => '合击上升',
        2 => 125,
      ),
      36 => 
      array (
        0 => 'VALUE',
        1 => '求援上升',
        2 => 130,
      ),
      37 => 
      array (
        0 => 'VALUE',
        1 => '位置变化',
        2 => 135,
      ),
      38 => 
      array (
        0 => 'VALUE',
        1 => '武器技-攻击上升',
        2 => 140,
      ),
      39 => 
      array (
        0 => 'VALUE',
        1 => '武器技-防御上升',
        2 => 145,
      ),
      40 => 
      array (
        0 => 'VALUE',
        1 => '帮派BUFF',
        2 => 150,
      ),
      41 => 
      array (
        0 => 'VALUE',
        1 => '天宫BUFF',
        2 => 155,
      ),
      42 => 
      array (
        0 => 'VALUE',
        1 => '攻击增加',
        2 => 160,
      ),
      43 => 
      array (
        0 => 'VALUE',
        1 => '防御增加',
        2 => 165,
      ),
      44 => 
      array (
        0 => 'VALUE',
        1 => '速度增加',
        2 => 170,
      ),
      45 => 
      array (
        0 => 'VALUE',
        1 => '气血增加',
        2 => 175,
      ),
      46 => 
      array (
        0 => 'VALUE',
        1 => '全能力增加',
        2 => 180,
      ),
      47 => 
      array (
        0 => 'VALUE',
        1 => '世界平均等级',
        2 => 185,
      ),
      48 => 
      array (
        0 => 'VALUE',
        1 => '免疫士气下降',
        2 => 190,
      ),
      49 => 
      array (
        0 => 'VALUE',
        1 => '加士气',
        2 => 195,
      ),
      50 => 
      array (
        0 => 'VALUE',
        1 => '减气血',
        2 => 200,
      ),
    ),
  ),
);?>