<?php  $sheets = array (
  0 => 
  array (
    'title' => 'Sheet2',
    'data' => 
    array (
      0 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
        3 => '',
        4 => '',
        5 => '',
        6 => NULL,
      ),
      1 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
        3 => '',
        4 => '',
        5 => '',
        6 => NULL,
      ),
      2 => 
      array (
        0 => '-',
        1 => '“-”开头为注',
        2 => '',
        3 => '',
        4 => '',
        5 => '',
        6 => NULL,
      ),
      3 => 
      array (
        0 => '-',
        1 => '类    型:1 => \'装备、武器\', 2 => \'首饰\' , 3 => \'法宝\'  4 => \'材料\'  5 => \'灵珠\' 6 => \'普通\'  7 => \'坐骑\'',
        2 => '',
        3 => '',
        4 => '',
        5 => '',
        6 => NULL,
      ),
      4 => 
      array (
        0 => '-',
        1 => '子    类：',
        2 => '请查阅物品类型表 => category.xlsx',
        3 => '',
        4 => '',
        5 => '',
        6 => NULL,
      ),
      5 => 
      array (
        0 => 'REM',
        1 => '物品图标',
        2 => '',
        3 => '',
        4 => '',
        5 => '',
        6 => NULL,
      ),
      6 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
        3 => '',
        4 => '',
        5 => '',
        6 => NULL,
      ),
      7 => 
      array (
        0 => 'FIELDS',
        1 => 'icon_name',
        2 => 'icon_id',
        3 => 'type',
        4 => 'type_sub',
        5 => 'explain',
        6 => NULL,
      ),
      8 => 
      array (
        0 => 'NAME',
        1 => '图标名称',
        2 => '图标ID',
        3 => '类型',
        4 => '子类型',
        5 => '分类说明',
        6 => NULL,
      ),
      9 => 
      array (
        0 => 'VALUE',
        1 => '浣碧皮帽',
        2 => 1001,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      10 => 
      array (
        0 => 'VALUE',
        1 => '鎏虹缕帽',
        2 => 1011,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      11 => 
      array (
        0 => 'VALUE',
        1 => '岚玥缕帽',
        2 => 1021,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      12 => 
      array (
        0 => 'VALUE',
        1 => '炫影缕帽',
        2 => 1031,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      13 => 
      array (
        0 => 'VALUE',
        1 => '焰赤羽帽',
        2 => 1041,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      14 => 
      array (
        0 => 'VALUE',
        1 => '逸辰羽帽',
        2 => 1051,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      15 => 
      array (
        0 => 'VALUE',
        1 => '飞邪绡帽',
        2 => 1056,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      16 => 
      array (
        0 => 'VALUE',
        1 => '虎魄云帽',
        2 => 1061,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      17 => 
      array (
        0 => 'VALUE',
        1 => '凤阙云帽',
        2 => 1071,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      18 => 
      array (
        0 => 'VALUE',
        1 => '龙绝云帽',
        2 => 1081,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      19 => 
      array (
        0 => 'VALUE',
        1 => '落霞旖帽',
        2 => 1091,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      20 => 
      array (
        0 => 'VALUE',
        1 => '惊云旖帽',
        2 => 1101,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      21 => 
      array (
        0 => 'VALUE',
        1 => '净雪旖帽',
        2 => 1111,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      22 => 
      array (
        0 => 'VALUE',
        1 => '血饮缁帽',
        2 => 1116,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      23 => 
      array (
        0 => 'VALUE',
        1 => '竞星霓帽',
        2 => 1121,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      24 => 
      array (
        0 => 'VALUE',
        1 => '幻月霓帽',
        2 => 1131,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      25 => 
      array (
        0 => 'VALUE',
        1 => '破日霓帽',
        2 => 1141,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      26 => 
      array (
        0 => 'VALUE',
        1 => '御皇纾帽',
        2 => 1146,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      27 => 
      array (
        0 => 'VALUE',
        1 => '锁心萦帽',
        2 => 1151,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      28 => 
      array (
        0 => 'VALUE',
        1 => '炼魂萦帽',
        2 => 1161,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      29 => 
      array (
        0 => 'VALUE',
        1 => '缚灵萦帽',
        2 => 1171,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      30 => 
      array (
        0 => 'VALUE',
        1 => '焚魔绮帽',
        2 => 1176,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      31 => 
      array (
        0 => 'VALUE',
        1 => '冥幽绫帽',
        2 => 1181,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      32 => 
      array (
        0 => 'VALUE',
        1 => '圣光绫帽',
        2 => 1191,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      33 => 
      array (
        0 => 'VALUE',
        1 => '灭元绫帽',
        2 => 1201,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      34 => 
      array (
        0 => 'VALUE',
        1 => '胜仙缳帽',
        2 => 1206,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      35 => 
      array (
        0 => 'VALUE',
        1 => '撼地绯帽',
        2 => 1211,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      36 => 
      array (
        0 => 'VALUE',
        1 => '裂天绯帽',
        2 => 1221,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      37 => 
      array (
        0 => 'VALUE',
        1 => '翔宇绯帽',
        2 => 1231,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      38 => 
      array (
        0 => 'VALUE',
        1 => '神诀绶帽',
        2 => 1236,
        3 => 1,
        4 => 11,
        5 => '装备/帽子',
        6 => NULL,
      ),
      39 => 
      array (
        0 => 'VALUE',
        1 => '浣碧布衣',
        2 => 2001,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      40 => 
      array (
        0 => 'VALUE',
        1 => '鎏虹缕衣',
        2 => 2011,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      41 => 
      array (
        0 => 'VALUE',
        1 => '岚玥缕衣',
        2 => 2021,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      42 => 
      array (
        0 => 'VALUE',
        1 => '炫影缕衣',
        2 => 2031,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      43 => 
      array (
        0 => 'VALUE',
        1 => '焰赤羽衣',
        2 => 2041,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      44 => 
      array (
        0 => 'VALUE',
        1 => '逸辰羽衣',
        2 => 2051,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      45 => 
      array (
        0 => 'VALUE',
        1 => '飞邪绡衣',
        2 => 2056,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      46 => 
      array (
        0 => 'VALUE',
        1 => '虎魄云衣',
        2 => 2061,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      47 => 
      array (
        0 => 'VALUE',
        1 => '凤阙云衣',
        2 => 2071,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      48 => 
      array (
        0 => 'VALUE',
        1 => '龙绝云衣',
        2 => 2081,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      49 => 
      array (
        0 => 'VALUE',
        1 => '落霞旖衣',
        2 => 2091,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      50 => 
      array (
        0 => 'VALUE',
        1 => '惊云旖衣',
        2 => 2101,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      51 => 
      array (
        0 => 'VALUE',
        1 => '净雪旖衣',
        2 => 2111,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      52 => 
      array (
        0 => 'VALUE',
        1 => '血饮缁衣',
        2 => 2116,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      53 => 
      array (
        0 => 'VALUE',
        1 => '竞星霓衣',
        2 => 2121,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      54 => 
      array (
        0 => 'VALUE',
        1 => '幻月霓衣',
        2 => 2131,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      55 => 
      array (
        0 => 'VALUE',
        1 => '破日霓衣',
        2 => 2141,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      56 => 
      array (
        0 => 'VALUE',
        1 => '御皇纾衣',
        2 => 2146,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      57 => 
      array (
        0 => 'VALUE',
        1 => '锁心萦衣',
        2 => 2151,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      58 => 
      array (
        0 => 'VALUE',
        1 => '炼魂萦衣',
        2 => 2161,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      59 => 
      array (
        0 => 'VALUE',
        1 => '缚灵萦衣',
        2 => 2171,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      60 => 
      array (
        0 => 'VALUE',
        1 => '焚魔绮衣',
        2 => 2176,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      61 => 
      array (
        0 => 'VALUE',
        1 => '冥幽绫衣',
        2 => 2181,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      62 => 
      array (
        0 => 'VALUE',
        1 => '圣光绫衣',
        2 => 2191,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      63 => 
      array (
        0 => 'VALUE',
        1 => '灭元绫衣',
        2 => 2201,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      64 => 
      array (
        0 => 'VALUE',
        1 => '胜仙缳衣',
        2 => 2206,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      65 => 
      array (
        0 => 'VALUE',
        1 => '撼地绯衣',
        2 => 2211,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      66 => 
      array (
        0 => 'VALUE',
        1 => '裂天绯衣',
        2 => 2221,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      67 => 
      array (
        0 => 'VALUE',
        1 => '翔宇绯衣',
        2 => 2231,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      68 => 
      array (
        0 => 'VALUE',
        1 => '神诀绶衣',
        2 => 2236,
        3 => 1,
        4 => 12,
        5 => '装备/衣服',
        6 => NULL,
      ),
      69 => 
      array (
        0 => 'VALUE',
        1 => '浣碧披风',
        2 => 3001,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      70 => 
      array (
        0 => 'VALUE',
        1 => '鎏虹坡风',
        2 => 3011,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      71 => 
      array (
        0 => 'VALUE',
        1 => '岚玥披风',
        2 => 3021,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      72 => 
      array (
        0 => 'VALUE',
        1 => '炫影披风',
        2 => 3031,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      73 => 
      array (
        0 => 'VALUE',
        1 => '焰赤披风',
        2 => 3041,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      74 => 
      array (
        0 => 'VALUE',
        1 => '逸辰披风',
        2 => 3051,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      75 => 
      array (
        0 => 'VALUE',
        1 => '飞邪披风',
        2 => 3056,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      76 => 
      array (
        0 => 'VALUE',
        1 => '虎魄坡风',
        2 => 3061,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      77 => 
      array (
        0 => 'VALUE',
        1 => '凤阙披风',
        2 => 3071,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      78 => 
      array (
        0 => 'VALUE',
        1 => '龙绝披风',
        2 => 3081,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      79 => 
      array (
        0 => 'VALUE',
        1 => '落霞披风',
        2 => 3091,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      80 => 
      array (
        0 => 'VALUE',
        1 => '惊云披风',
        2 => 3101,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      81 => 
      array (
        0 => 'VALUE',
        1 => '净雪披风',
        2 => 3111,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      82 => 
      array (
        0 => 'VALUE',
        1 => '血饮披风',
        2 => 3116,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      83 => 
      array (
        0 => 'VALUE',
        1 => '竞星披风',
        2 => 3121,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      84 => 
      array (
        0 => 'VALUE',
        1 => '幻月披风',
        2 => 3131,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      85 => 
      array (
        0 => 'VALUE',
        1 => '破日披风',
        2 => 3141,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      86 => 
      array (
        0 => 'VALUE',
        1 => '御皇披风',
        2 => 3146,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      87 => 
      array (
        0 => 'VALUE',
        1 => '锁心披风',
        2 => 3151,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      88 => 
      array (
        0 => 'VALUE',
        1 => '炼魂披风',
        2 => 3161,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      89 => 
      array (
        0 => 'VALUE',
        1 => '缚灵披风',
        2 => 3171,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      90 => 
      array (
        0 => 'VALUE',
        1 => '焚魔披风',
        2 => 3176,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      91 => 
      array (
        0 => 'VALUE',
        1 => '冥幽披风',
        2 => 3181,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      92 => 
      array (
        0 => 'VALUE',
        1 => '圣光披风',
        2 => 3191,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      93 => 
      array (
        0 => 'VALUE',
        1 => '灭元披风',
        2 => 3201,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      94 => 
      array (
        0 => 'VALUE',
        1 => '胜仙披风',
        2 => 3206,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      95 => 
      array (
        0 => 'VALUE',
        1 => '撼地披风',
        2 => 3211,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      96 => 
      array (
        0 => 'VALUE',
        1 => '裂天披风',
        2 => 3221,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      97 => 
      array (
        0 => 'VALUE',
        1 => '翔宇披风',
        2 => 3231,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      98 => 
      array (
        0 => 'VALUE',
        1 => '神诀披风',
        2 => 3236,
        3 => 1,
        4 => 13,
        5 => '装备/披风',
        6 => NULL,
      ),
      99 => 
      array (
        0 => 'VALUE',
        1 => '鎏虹腰带',
        2 => 4011,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      100 => 
      array (
        0 => 'VALUE',
        1 => '岚玥腰带',
        2 => 4021,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      101 => 
      array (
        0 => 'VALUE',
        1 => '炫影腰带',
        2 => 4031,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      102 => 
      array (
        0 => 'VALUE',
        1 => '焰赤腰带',
        2 => 4041,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      103 => 
      array (
        0 => 'VALUE',
        1 => '逸辰腰带',
        2 => 4051,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      104 => 
      array (
        0 => 'VALUE',
        1 => '飞邪腰带',
        2 => 4056,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      105 => 
      array (
        0 => 'VALUE',
        1 => '虎魄腰带',
        2 => 4061,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      106 => 
      array (
        0 => 'VALUE',
        1 => '凤阙腰带',
        2 => 4071,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      107 => 
      array (
        0 => 'VALUE',
        1 => '龙绝腰带',
        2 => 4081,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      108 => 
      array (
        0 => 'VALUE',
        1 => '落霞腰带',
        2 => 4091,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      109 => 
      array (
        0 => 'VALUE',
        1 => '惊云腰带',
        2 => 4101,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      110 => 
      array (
        0 => 'VALUE',
        1 => '净雪腰带',
        2 => 4111,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      111 => 
      array (
        0 => 'VALUE',
        1 => '血饮腰带',
        2 => 4116,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      112 => 
      array (
        0 => 'VALUE',
        1 => '竞星腰带',
        2 => 4121,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      113 => 
      array (
        0 => 'VALUE',
        1 => '幻月腰带',
        2 => 4131,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      114 => 
      array (
        0 => 'VALUE',
        1 => '破日腰带',
        2 => 4141,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      115 => 
      array (
        0 => 'VALUE',
        1 => '御皇腰带',
        2 => 4146,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      116 => 
      array (
        0 => 'VALUE',
        1 => '锁心腰带',
        2 => 4151,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      117 => 
      array (
        0 => 'VALUE',
        1 => '炼魂腰带',
        2 => 4161,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      118 => 
      array (
        0 => 'VALUE',
        1 => '缚灵腰带',
        2 => 4171,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      119 => 
      array (
        0 => 'VALUE',
        1 => '焚魔腰带',
        2 => 4176,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      120 => 
      array (
        0 => 'VALUE',
        1 => '冥幽腰带',
        2 => 4181,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      121 => 
      array (
        0 => 'VALUE',
        1 => '圣光腰带',
        2 => 4191,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      122 => 
      array (
        0 => 'VALUE',
        1 => '灭元腰带',
        2 => 4201,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      123 => 
      array (
        0 => 'VALUE',
        1 => '胜仙腰带',
        2 => 4206,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      124 => 
      array (
        0 => 'VALUE',
        1 => '撼地腰带',
        2 => 4211,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      125 => 
      array (
        0 => 'VALUE',
        1 => '裂天腰带',
        2 => 4221,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      126 => 
      array (
        0 => 'VALUE',
        1 => '翔宇腰带',
        2 => 4231,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      127 => 
      array (
        0 => 'VALUE',
        1 => '神诀腰带',
        2 => 4236,
        3 => 1,
        4 => 14,
        5 => '装备/腰带',
        6 => NULL,
      ),
      128 => 
      array (
        0 => 'VALUE',
        1 => '鎏虹缕靴',
        2 => 5011,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      129 => 
      array (
        0 => 'VALUE',
        1 => '岚玥缕靴',
        2 => 5021,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      130 => 
      array (
        0 => 'VALUE',
        1 => '炫影缕靴',
        2 => 5031,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      131 => 
      array (
        0 => 'VALUE',
        1 => '焰赤羽靴',
        2 => 5041,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      132 => 
      array (
        0 => 'VALUE',
        1 => '逸辰羽靴',
        2 => 5051,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      133 => 
      array (
        0 => 'VALUE',
        1 => '飞邪绡靴',
        2 => 5056,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      134 => 
      array (
        0 => 'VALUE',
        1 => '虎魄云靴',
        2 => 5061,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      135 => 
      array (
        0 => 'VALUE',
        1 => '凤阙云靴',
        2 => 5071,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      136 => 
      array (
        0 => 'VALUE',
        1 => '龙绝云靴',
        2 => 5081,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      137 => 
      array (
        0 => 'VALUE',
        1 => '落霞旖靴',
        2 => 5091,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      138 => 
      array (
        0 => 'VALUE',
        1 => '惊云旖靴',
        2 => 5101,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      139 => 
      array (
        0 => 'VALUE',
        1 => '净雪旖靴',
        2 => 5111,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      140 => 
      array (
        0 => 'VALUE',
        1 => '血饮缁靴',
        2 => 5116,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      141 => 
      array (
        0 => 'VALUE',
        1 => '竞星霓靴',
        2 => 5121,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      142 => 
      array (
        0 => 'VALUE',
        1 => '幻月霓靴',
        2 => 5131,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      143 => 
      array (
        0 => 'VALUE',
        1 => '破日霓靴',
        2 => 5141,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      144 => 
      array (
        0 => 'VALUE',
        1 => '御皇纾靴',
        2 => 5146,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      145 => 
      array (
        0 => 'VALUE',
        1 => '锁心萦靴',
        2 => 5151,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      146 => 
      array (
        0 => 'VALUE',
        1 => '炼魂萦靴',
        2 => 5161,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      147 => 
      array (
        0 => 'VALUE',
        1 => '缚灵萦靴',
        2 => 5171,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      148 => 
      array (
        0 => 'VALUE',
        1 => '焚魔绮靴',
        2 => 5176,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      149 => 
      array (
        0 => 'VALUE',
        1 => '冥幽绫靴',
        2 => 5181,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      150 => 
      array (
        0 => 'VALUE',
        1 => '圣光绫靴',
        2 => 5191,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      151 => 
      array (
        0 => 'VALUE',
        1 => '灭元绫靴',
        2 => 5201,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      152 => 
      array (
        0 => 'VALUE',
        1 => '胜仙缳靴',
        2 => 5206,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      153 => 
      array (
        0 => 'VALUE',
        1 => '撼地绯靴',
        2 => 5211,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      154 => 
      array (
        0 => 'VALUE',
        1 => '裂天绯靴',
        2 => 5221,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      155 => 
      array (
        0 => 'VALUE',
        1 => '翔宇绯靴',
        2 => 5231,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      156 => 
      array (
        0 => 'VALUE',
        1 => '神诀绶靴',
        2 => 5236,
        3 => 1,
        4 => 15,
        5 => '装备/靴子',
        6 => NULL,
      ),
      157 => 
      array (
        0 => 'VALUE',
        1 => '浣碧藤枪',
        2 => 6001,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      158 => 
      array (
        0 => 'VALUE',
        1 => '鎏虹卢枪',
        2 => 6011,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      159 => 
      array (
        0 => 'VALUE',
        1 => '岚玥卢枪',
        2 => 6021,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      160 => 
      array (
        0 => 'VALUE',
        1 => '炫影卢枪',
        2 => 6031,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      161 => 
      array (
        0 => 'VALUE',
        1 => '焰赤缨枪',
        2 => 6041,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      162 => 
      array (
        0 => 'VALUE',
        1 => '逸辰缨枪',
        2 => 6051,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      163 => 
      array (
        0 => 'VALUE',
        1 => '飞邪锋枪',
        2 => 6056,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      164 => 
      array (
        0 => 'VALUE',
        1 => '虎魄飞枪',
        2 => 6061,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      165 => 
      array (
        0 => 'VALUE',
        1 => '凤阙飞枪',
        2 => 6071,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      166 => 
      array (
        0 => 'VALUE',
        1 => '龙绝飞枪',
        2 => 6081,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      167 => 
      array (
        0 => 'VALUE',
        1 => '落霞钩枪',
        2 => 6091,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      168 => 
      array (
        0 => 'VALUE',
        1 => '惊云钩枪',
        2 => 6101,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      169 => 
      array (
        0 => 'VALUE',
        1 => '净雪钩枪',
        2 => 6111,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      170 => 
      array (
        0 => 'VALUE',
        1 => '血饮罡枪',
        2 => 6116,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      171 => 
      array (
        0 => 'VALUE',
        1 => '竞星魂枪',
        2 => 6121,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      172 => 
      array (
        0 => 'VALUE',
        1 => '幻月魂枪',
        2 => 6131,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      173 => 
      array (
        0 => 'VALUE',
        1 => '破日魂枪',
        2 => 6141,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      174 => 
      array (
        0 => 'VALUE',
        1 => '御皇刃枪',
        2 => 6146,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      175 => 
      array (
        0 => 'VALUE',
        1 => '锁心焰枪',
        2 => 6151,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      176 => 
      array (
        0 => 'VALUE',
        1 => '炼魂焰枪',
        2 => 6161,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      177 => 
      array (
        0 => 'VALUE',
        1 => '缚灵焰枪',
        2 => 6171,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      178 => 
      array (
        0 => 'VALUE',
        1 => '焚魔烈枪',
        2 => 6176,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      179 => 
      array (
        0 => 'VALUE',
        1 => '冥幽麟枪',
        2 => 6181,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      180 => 
      array (
        0 => 'VALUE',
        1 => '圣光麟枪',
        2 => 6191,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      181 => 
      array (
        0 => 'VALUE',
        1 => '灭元麟枪',
        2 => 6201,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      182 => 
      array (
        0 => 'VALUE',
        1 => '胜仙鲸枪',
        2 => 6206,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      183 => 
      array (
        0 => 'VALUE',
        1 => '撼地鲛枪',
        2 => 6211,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      184 => 
      array (
        0 => 'VALUE',
        1 => '裂天鲛枪',
        2 => 6221,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      185 => 
      array (
        0 => 'VALUE',
        1 => '翔宇鲛枪',
        2 => 6231,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      186 => 
      array (
        0 => 'VALUE',
        1 => '神诀钬枪',
        2 => 6236,
        3 => 1,
        4 => 31,
        5 => '装备/长枪',
        6 => NULL,
      ),
      187 => 
      array (
        0 => 'VALUE',
        1 => '浣碧弯弓',
        2 => 7001,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      188 => 
      array (
        0 => 'VALUE',
        1 => '鎏虹角弓',
        2 => 7011,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      189 => 
      array (
        0 => 'VALUE',
        1 => '岚玥角弓',
        2 => 7021,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      190 => 
      array (
        0 => 'VALUE',
        1 => '炫影角弓',
        2 => 7031,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      191 => 
      array (
        0 => 'VALUE',
        1 => '焰赤星弓',
        2 => 7041,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      192 => 
      array (
        0 => 'VALUE',
        1 => '逸辰星弓',
        2 => 7051,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      193 => 
      array (
        0 => 'VALUE',
        1 => '飞邪奇弓',
        2 => 7056,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      194 => 
      array (
        0 => 'VALUE',
        1 => '虎魄翎弓',
        2 => 7061,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      195 => 
      array (
        0 => 'VALUE',
        1 => '凤阙翎弓',
        2 => 7071,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      196 => 
      array (
        0 => 'VALUE',
        1 => '龙绝翎弓',
        2 => 7081,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      197 => 
      array (
        0 => 'VALUE',
        1 => '落霞寒弓',
        2 => 7091,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      198 => 
      array (
        0 => 'VALUE',
        1 => '惊云寒弓',
        2 => 7101,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      199 => 
      array (
        0 => 'VALUE',
        1 => '净雪寒弓',
        2 => 7111,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      200 => 
      array (
        0 => 'VALUE',
        1 => '血饮辰弓',
        2 => 7116,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      201 => 
      array (
        0 => 'VALUE',
        1 => '竞星冰弓',
        2 => 7121,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      202 => 
      array (
        0 => 'VALUE',
        1 => '幻月冰弓',
        2 => 7131,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      203 => 
      array (
        0 => 'VALUE',
        1 => '破日冰弓',
        2 => 7141,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      204 => 
      array (
        0 => 'VALUE',
        1 => '御皇鑫弓',
        2 => 7146,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      205 => 
      array (
        0 => 'VALUE',
        1 => '锁心晶弓',
        2 => 7151,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      206 => 
      array (
        0 => 'VALUE',
        1 => '炼魂晶弓',
        2 => 7161,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      207 => 
      array (
        0 => 'VALUE',
        1 => '缚灵晶弓',
        2 => 7171,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      208 => 
      array (
        0 => 'VALUE',
        1 => '焚魔煞弓',
        2 => 7176,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      209 => 
      array (
        0 => 'VALUE',
        1 => '冥幽玄弓',
        2 => 7181,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      210 => 
      array (
        0 => 'VALUE',
        1 => '圣光玄弓',
        2 => 7191,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      211 => 
      array (
        0 => 'VALUE',
        1 => '灭元玄弓',
        2 => 7201,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      212 => 
      array (
        0 => 'VALUE',
        1 => '胜仙擎弓',
        2 => 7206,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      213 => 
      array (
        0 => 'VALUE',
        1 => '撼地劲弓',
        2 => 7211,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      214 => 
      array (
        0 => 'VALUE',
        1 => '裂天劲弓',
        2 => 7221,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      215 => 
      array (
        0 => 'VALUE',
        1 => '翔宇劲弓',
        2 => 7231,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      216 => 
      array (
        0 => 'VALUE',
        1 => '神诀钰弓',
        2 => 7236,
        3 => 1,
        4 => 32,
        5 => '装备/弓箭',
        6 => NULL,
      ),
      217 => 
      array (
        0 => 'VALUE',
        1 => '浣碧权杖',
        2 => 8001,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      218 => 
      array (
        0 => 'VALUE',
        1 => '鎏虹法杖',
        2 => 8011,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      219 => 
      array (
        0 => 'VALUE',
        1 => '岚玥法杖',
        2 => 8021,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      220 => 
      array (
        0 => 'VALUE',
        1 => '炫影法杖',
        2 => 8031,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      221 => 
      array (
        0 => 'VALUE',
        1 => '焰赤冥杖',
        2 => 8041,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      222 => 
      array (
        0 => 'VALUE',
        1 => '逸辰冥杖',
        2 => 8051,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      223 => 
      array (
        0 => 'VALUE',
        1 => '飞邪煌杖',
        2 => 8056,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      224 => 
      array (
        0 => 'VALUE',
        1 => '虎魄神杖',
        2 => 8061,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      225 => 
      array (
        0 => 'VALUE',
        1 => '凤阙神杖',
        2 => 8071,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      226 => 
      array (
        0 => 'VALUE',
        1 => '龙绝神杖',
        2 => 8081,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      227 => 
      array (
        0 => 'VALUE',
        1 => '落霞禅杖',
        2 => 8091,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      228 => 
      array (
        0 => 'VALUE',
        1 => '惊云禅杖',
        2 => 8101,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      229 => 
      array (
        0 => 'VALUE',
        1 => '净雪禅杖',
        2 => 8111,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      230 => 
      array (
        0 => 'VALUE',
        1 => '血饮鸾杖',
        2 => 8116,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      231 => 
      array (
        0 => 'VALUE',
        1 => '竞星雷杖',
        2 => 8121,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      232 => 
      array (
        0 => 'VALUE',
        1 => '幻月雷杖',
        2 => 8131,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      233 => 
      array (
        0 => 'VALUE',
        1 => '破日雷杖',
        2 => 8141,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      234 => 
      array (
        0 => 'VALUE',
        1 => '御皇羚杖',
        2 => 8146,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      235 => 
      array (
        0 => 'VALUE',
        1 => '锁心弥杖',
        2 => 8151,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      236 => 
      array (
        0 => 'VALUE',
        1 => '炼魂弥杖',
        2 => 8161,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      237 => 
      array (
        0 => 'VALUE',
        1 => '缚灵弥杖',
        2 => 8171,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      238 => 
      array (
        0 => 'VALUE',
        1 => '焚魔煦杖',
        2 => 8176,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      239 => 
      array (
        0 => 'VALUE',
        1 => '冥幽凰杖',
        2 => 8181,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      240 => 
      array (
        0 => 'VALUE',
        1 => '圣光凰杖',
        2 => 8191,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      241 => 
      array (
        0 => 'VALUE',
        1 => '灭元凰杖',
        2 => 8201,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      242 => 
      array (
        0 => 'VALUE',
        1 => '胜仙螭杖',
        2 => 8206,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      243 => 
      array (
        0 => 'VALUE',
        1 => '撼地龙杖',
        2 => 8211,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      244 => 
      array (
        0 => 'VALUE',
        1 => '裂天龙杖',
        2 => 8221,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      245 => 
      array (
        0 => 'VALUE',
        1 => '翔宇龙杖',
        2 => 8231,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      246 => 
      array (
        0 => 'VALUE',
        1 => '神诀钨杖',
        2 => 8236,
        3 => 1,
        4 => 33,
        5 => '装备/法杖',
        6 => NULL,
      ),
      247 => 
      array (
        0 => 'VALUE',
        1 => '灵柔玉佩',
        2 => 10001,
        3 => 2,
        4 => 51,
        5 => '首饰/玉佩左',
        6 => NULL,
      ),
      248 => 
      array (
        0 => 'VALUE',
        1 => '银鹄玉佩',
        2 => 10011,
        3 => 2,
        4 => 51,
        5 => '首饰/玉佩左',
        6 => NULL,
      ),
      249 => 
      array (
        0 => 'VALUE',
        1 => '雪鸳玉佩',
        2 => 10021,
        3 => 2,
        4 => 51,
        5 => '首饰/玉佩左',
        6 => NULL,
      ),
      250 => 
      array (
        0 => 'VALUE',
        1 => '真雪玉佩',
        2 => 10031,
        3 => 2,
        4 => 51,
        5 => '首饰/玉佩左',
        6 => NULL,
      ),
      251 => 
      array (
        0 => 'VALUE',
        1 => '琉莺玉佩',
        2 => 10041,
        3 => 2,
        4 => 51,
        5 => '首饰/玉佩左',
        6 => NULL,
      ),
      252 => 
      array (
        0 => 'VALUE',
        1 => '碧鸾玉佩',
        2 => 10051,
        3 => 2,
        4 => 51,
        5 => '首饰/玉佩左',
        6 => NULL,
      ),
      253 => 
      array (
        0 => 'VALUE',
        1 => '真元玉佩',
        2 => 10061,
        3 => 2,
        4 => 51,
        5 => '首饰/玉佩左',
        6 => NULL,
      ),
      254 => 
      array (
        0 => 'VALUE',
        1 => '灵柔玉佩',
        2 => 10501,
        3 => 2,
        4 => 52,
        5 => '首饰/玉佩右',
        6 => NULL,
      ),
      255 => 
      array (
        0 => 'VALUE',
        1 => '银鹄玉佩',
        2 => 10511,
        3 => 2,
        4 => 52,
        5 => '首饰/玉佩右',
        6 => NULL,
      ),
      256 => 
      array (
        0 => 'VALUE',
        1 => '雪鸳玉佩',
        2 => 10521,
        3 => 2,
        4 => 52,
        5 => '首饰/玉佩右',
        6 => NULL,
      ),
      257 => 
      array (
        0 => 'VALUE',
        1 => '真雪玉佩',
        2 => 10531,
        3 => 2,
        4 => 52,
        5 => '首饰/玉佩右',
        6 => NULL,
      ),
      258 => 
      array (
        0 => 'VALUE',
        1 => '琉莺玉佩',
        2 => 10541,
        3 => 2,
        4 => 52,
        5 => '首饰/玉佩右',
        6 => NULL,
      ),
      259 => 
      array (
        0 => 'VALUE',
        1 => '碧鸾玉佩',
        2 => 10551,
        3 => 2,
        4 => 52,
        5 => '首饰/玉佩右',
        6 => NULL,
      ),
      260 => 
      array (
        0 => 'VALUE',
        1 => '真元玉佩',
        2 => 10561,
        3 => 2,
        4 => 52,
        5 => '首饰/玉佩右',
        6 => NULL,
      ),
      261 => 
      array (
        0 => 'VALUE',
        1 => '灵柔手镯',
        2 => 11001,
        3 => 2,
        4 => 53,
        5 => '首饰/手镯左',
        6 => NULL,
      ),
      262 => 
      array (
        0 => 'VALUE',
        1 => '银鹄手镯',
        2 => 11011,
        3 => 2,
        4 => 53,
        5 => '首饰/手镯左',
        6 => NULL,
      ),
      263 => 
      array (
        0 => 'VALUE',
        1 => '雪鸳手镯',
        2 => 11021,
        3 => 2,
        4 => 53,
        5 => '首饰/手镯左',
        6 => NULL,
      ),
      264 => 
      array (
        0 => 'VALUE',
        1 => '真雪手镯',
        2 => 11031,
        3 => 2,
        4 => 53,
        5 => '首饰/手镯左',
        6 => NULL,
      ),
      265 => 
      array (
        0 => 'VALUE',
        1 => '琉莺手镯',
        2 => 11041,
        3 => 2,
        4 => 53,
        5 => '首饰/手镯左',
        6 => NULL,
      ),
      266 => 
      array (
        0 => 'VALUE',
        1 => '碧鸾手镯',
        2 => 11051,
        3 => 2,
        4 => 53,
        5 => '首饰/手镯左',
        6 => NULL,
      ),
      267 => 
      array (
        0 => 'VALUE',
        1 => '真元手镯',
        2 => 11061,
        3 => 2,
        4 => 53,
        5 => '首饰/手镯左',
        6 => NULL,
      ),
      268 => 
      array (
        0 => 'VALUE',
        1 => '灵柔手镯',
        2 => 11501,
        3 => 2,
        4 => 54,
        5 => '首饰/手镯右',
        6 => NULL,
      ),
      269 => 
      array (
        0 => 'VALUE',
        1 => '银鹄手镯',
        2 => 11511,
        3 => 2,
        4 => 54,
        5 => '首饰/手镯右',
        6 => NULL,
      ),
      270 => 
      array (
        0 => 'VALUE',
        1 => '雪鸳手镯',
        2 => 11521,
        3 => 2,
        4 => 54,
        5 => '首饰/手镯右',
        6 => NULL,
      ),
      271 => 
      array (
        0 => 'VALUE',
        1 => '真雪手镯',
        2 => 11531,
        3 => 2,
        4 => 54,
        5 => '首饰/手镯右',
        6 => NULL,
      ),
      272 => 
      array (
        0 => 'VALUE',
        1 => '琉莺手镯',
        2 => 11541,
        3 => 2,
        4 => 54,
        5 => '首饰/手镯右',
        6 => NULL,
      ),
      273 => 
      array (
        0 => 'VALUE',
        1 => '碧鸾手镯',
        2 => 11551,
        3 => 2,
        4 => 54,
        5 => '首饰/手镯右',
        6 => NULL,
      ),
      274 => 
      array (
        0 => 'VALUE',
        1 => '真元手镯',
        2 => 11561,
        3 => 2,
        4 => 54,
        5 => '首饰/手镯右',
        6 => NULL,
      ),
      275 => 
      array (
        0 => 'VALUE',
        1 => '灵柔戒指',
        2 => 12001,
        3 => 2,
        4 => 55,
        5 => '首饰/戒指左',
        6 => NULL,
      ),
      276 => 
      array (
        0 => 'VALUE',
        1 => '银鹄戒指',
        2 => 12011,
        3 => 2,
        4 => 55,
        5 => '首饰/戒指左',
        6 => NULL,
      ),
      277 => 
      array (
        0 => 'VALUE',
        1 => '雪鸳戒指',
        2 => 12021,
        3 => 2,
        4 => 55,
        5 => '首饰/戒指左',
        6 => NULL,
      ),
      278 => 
      array (
        0 => 'VALUE',
        1 => '真雪戒指',
        2 => 12031,
        3 => 2,
        4 => 55,
        5 => '首饰/戒指左',
        6 => NULL,
      ),
      279 => 
      array (
        0 => 'VALUE',
        1 => '琉莺戒指',
        2 => 12041,
        3 => 2,
        4 => 55,
        5 => '首饰/戒指左',
        6 => NULL,
      ),
      280 => 
      array (
        0 => 'VALUE',
        1 => '碧鸾戒指',
        2 => 12051,
        3 => 2,
        4 => 55,
        5 => '首饰/戒指左',
        6 => NULL,
      ),
      281 => 
      array (
        0 => 'VALUE',
        1 => '真元戒指',
        2 => 12061,
        3 => 2,
        4 => 55,
        5 => '首饰/戒指左',
        6 => NULL,
      ),
      282 => 
      array (
        0 => 'VALUE',
        1 => '灵柔戒指',
        2 => 12501,
        3 => 2,
        4 => 56,
        5 => '首饰/戒指右',
        6 => NULL,
      ),
      283 => 
      array (
        0 => 'VALUE',
        1 => '银鹄戒指',
        2 => 12511,
        3 => 2,
        4 => 56,
        5 => '首饰/戒指右',
        6 => NULL,
      ),
      284 => 
      array (
        0 => 'VALUE',
        1 => '雪鸳戒指',
        2 => 12521,
        3 => 2,
        4 => 56,
        5 => '首饰/戒指右',
        6 => NULL,
      ),
      285 => 
      array (
        0 => 'VALUE',
        1 => '真雪戒指',
        2 => 12531,
        3 => 2,
        4 => 56,
        5 => '首饰/戒指右',
        6 => NULL,
      ),
      286 => 
      array (
        0 => 'VALUE',
        1 => '琉莺戒指',
        2 => 12541,
        3 => 2,
        4 => 56,
        5 => '首饰/戒指右',
        6 => NULL,
      ),
      287 => 
      array (
        0 => 'VALUE',
        1 => '碧鸾戒指',
        2 => 12551,
        3 => 2,
        4 => 56,
        5 => '首饰/戒指右',
        6 => NULL,
      ),
      288 => 
      array (
        0 => 'VALUE',
        1 => '真元戒指',
        2 => 12561,
        3 => 2,
        4 => 56,
        5 => '首饰/戒指右',
        6 => NULL,
      ),
      289 => 
      array (
        0 => 'VALUE',
        1 => '五色石',
        2 => 13001,
        3 => 3,
        4 => 71,
        5 => '法宝/青龙',
        6 => NULL,
      ),
      290 => 
      array (
        0 => 'VALUE',
        1 => '遁龙桩',
        2 => 13021,
        3 => 3,
        4 => 71,
        5 => '法宝/青龙',
        6 => NULL,
      ),
      291 => 
      array (
        0 => 'VALUE',
        1 => '七宝浮屠',
        2 => 13041,
        3 => 3,
        4 => 71,
        5 => '法宝/青龙',
        6 => NULL,
      ),
      292 => 
      array (
        0 => 'VALUE',
        1 => '定海珠',
        2 => 13061,
        3 => 3,
        4 => 71,
        5 => '法宝/青龙',
        6 => NULL,
      ),
      293 => 
      array (
        0 => 'VALUE',
        1 => '太极图',
        2 => 13081,
        3 => 3,
        4 => 71,
        5 => '法宝/青龙',
        6 => NULL,
      ),
      294 => 
      array (
        0 => 'VALUE',
        1 => '庆云金灯',
        2 => 13101,
        3 => 3,
        4 => 71,
        5 => '法宝/青龙',
        6 => NULL,
      ),
      295 => 
      array (
        0 => 'VALUE',
        1 => ' 宝莲灯',
        2 => 13121,
        3 => 3,
        4 => 71,
        5 => '法宝/青龙',
        6 => NULL,
      ),
      296 => 
      array (
        0 => 'VALUE',
        1 => '七宝妙树',
        2 => 13141,
        3 => 3,
        4 => 71,
        5 => '法宝/青龙',
        6 => NULL,
      ),
      297 => 
      array (
        0 => 'VALUE',
        1 => '金蛟剪',
        2 => 13501,
        3 => 3,
        4 => 72,
        5 => '法宝/白虎',
        6 => NULL,
      ),
      298 => 
      array (
        0 => 'VALUE',
        1 => '打神鞭',
        2 => 13521,
        3 => 3,
        4 => 72,
        5 => '法宝/白虎',
        6 => NULL,
      ),
      299 => 
      array (
        0 => 'VALUE',
        1 => '轩辕剑',
        2 => 13541,
        3 => 3,
        4 => 72,
        5 => '法宝/白虎',
        6 => NULL,
      ),
      300 => 
      array (
        0 => 'VALUE',
        1 => '射日弓',
        2 => 13561,
        3 => 3,
        4 => 72,
        5 => '法宝/白虎',
        6 => NULL,
      ),
      301 => 
      array (
        0 => 'VALUE',
        1 => '翻天印',
        2 => 13581,
        3 => 3,
        4 => 72,
        5 => '法宝/白虎',
        6 => NULL,
      ),
      302 => 
      array (
        0 => 'VALUE',
        1 => '金刚琢',
        2 => 13601,
        3 => 3,
        4 => 72,
        5 => '法宝/白虎',
        6 => NULL,
      ),
      303 => 
      array (
        0 => 'VALUE',
        1 => '三炫环',
        2 => 13621,
        3 => 3,
        4 => 72,
        5 => '法宝/白虎',
        6 => NULL,
      ),
      304 => 
      array (
        0 => 'VALUE',
        1 => '天蜈竹杖',
        2 => 13641,
        3 => 3,
        4 => 72,
        5 => '法宝/白虎',
        6 => NULL,
      ),
      305 => 
      array (
        0 => 'VALUE',
        1 => '孔雀翎',
        2 => 14001,
        3 => 3,
        4 => 73,
        5 => '法宝/朱雀',
        6 => NULL,
      ),
      306 => 
      array (
        0 => 'VALUE',
        1 => '云光帕',
        2 => 14021,
        3 => 3,
        4 => 73,
        5 => '法宝/朱雀',
        6 => NULL,
      ),
      307 => 
      array (
        0 => 'VALUE',
        1 => '焰光旗',
        2 => 14041,
        3 => 3,
        4 => 73,
        5 => '法宝/朱雀',
        6 => NULL,
      ),
      308 => 
      array (
        0 => 'VALUE',
        1 => '神焰扇',
        2 => 14061,
        3 => 3,
        4 => 73,
        5 => '法宝/朱雀',
        6 => NULL,
      ),
      309 => 
      array (
        0 => 'VALUE',
        1 => '芭蕉扇',
        2 => 14081,
        3 => 3,
        4 => 73,
        5 => '法宝/朱雀',
        6 => NULL,
      ),
      310 => 
      array (
        0 => 'VALUE',
        1 => '招妖幡',
        2 => 14101,
        3 => 3,
        4 => 73,
        5 => '法宝/朱雀',
        6 => NULL,
      ),
      311 => 
      array (
        0 => 'VALUE',
        1 => '接引宝幢',
        2 => 14121,
        3 => 3,
        4 => 73,
        5 => '法宝/朱雀',
        6 => NULL,
      ),
      312 => 
      array (
        0 => 'VALUE',
        1 => '风火蒲团',
        2 => 14141,
        3 => 3,
        4 => 73,
        5 => '法宝/朱雀',
        6 => NULL,
      ),
      313 => 
      array (
        0 => 'VALUE',
        1 => '阴阳镜',
        2 => 14501,
        3 => 3,
        4 => 74,
        5 => '法宝/玄武',
        6 => NULL,
      ),
      314 => 
      array (
        0 => 'VALUE',
        1 => '神农鼎',
        2 => 14521,
        3 => 3,
        4 => 74,
        5 => '法宝/玄武',
        6 => NULL,
      ),
      315 => 
      array (
        0 => 'VALUE',
        1 => '紫金铃',
        2 => 14541,
        3 => 3,
        4 => 74,
        5 => '法宝/玄武',
        6 => NULL,
      ),
      316 => 
      array (
        0 => 'VALUE',
        1 => '九黎壶',
        2 => 14561,
        3 => 3,
        4 => 74,
        5 => '法宝/玄武',
        6 => NULL,
      ),
      317 => 
      array (
        0 => 'VALUE',
        1 => '混元金斗',
        2 => 14581,
        3 => 3,
        4 => 74,
        5 => '法宝/玄武',
        6 => NULL,
      ),
      318 => 
      array (
        0 => 'VALUE',
        1 => '混沌钟',
        2 => 14601,
        3 => 3,
        4 => 74,
        5 => '法宝/玄武',
        6 => NULL,
      ),
      319 => 
      array (
        0 => 'VALUE',
        1 => '混元盒',
        2 => 14621,
        3 => 3,
        4 => 74,
        5 => '法宝/玄武',
        6 => NULL,
      ),
      320 => 
      array (
        0 => 'VALUE',
        1 => '玄黄塔',
        2 => 14641,
        3 => 3,
        4 => 74,
        5 => '法宝/玄武',
        6 => NULL,
      ),
      321 => 
      array (
        0 => 'VALUE',
        1 => '锦襕袈裟',
        2 => 15001,
        3 => 3,
        4 => 75,
        5 => '法宝/麒麟',
        6 => NULL,
      ),
      322 => 
      array (
        0 => 'VALUE',
        1 => '金缕衣',
        2 => 15021,
        3 => 3,
        4 => 75,
        5 => '法宝/麒麟',
        6 => NULL,
      ),
      323 => 
      array (
        0 => 'VALUE',
        1 => '混元伞',
        2 => 15041,
        3 => 3,
        4 => 75,
        5 => '法宝/麒麟',
        6 => NULL,
      ),
      324 => 
      array (
        0 => 'VALUE',
        1 => '魔罗伞',
        2 => 15061,
        3 => 3,
        4 => 75,
        5 => '法宝/麒麟',
        6 => NULL,
      ),
      325 => 
      array (
        0 => 'VALUE',
        1 => '龙神飞羽',
        2 => 15081,
        3 => 3,
        4 => 75,
        5 => '法宝/麒麟',
        6 => NULL,
      ),
      326 => 
      array (
        0 => 'VALUE',
        1 => '伏羲琴',
        2 => 15101,
        3 => 3,
        4 => 75,
        5 => '法宝/麒麟',
        6 => NULL,
      ),
      327 => 
      array (
        0 => 'VALUE',
        1 => '紫绶仙衣',
        2 => 15121,
        3 => 3,
        4 => 75,
        5 => '法宝/麒麟',
        6 => NULL,
      ),
      328 => 
      array (
        0 => 'VALUE',
        1 => '太上扁拐',
        2 => 15141,
        3 => 3,
        4 => 75,
        5 => '法宝/麒麟',
        6 => NULL,
      ),
      329 => 
      array (
        0 => 'VALUE',
        1 => '救命毫毛',
        2 => 15501,
        3 => 3,
        4 => 76,
        5 => '法宝/鲲鹏',
        6 => NULL,
      ),
      330 => 
      array (
        0 => 'VALUE',
        1 => '龙鼎玉玺',
        2 => 15521,
        3 => 3,
        4 => 76,
        5 => '法宝/鲲鹏',
        6 => NULL,
      ),
      331 => 
      array (
        0 => 'VALUE',
        1 => '血神心罗',
        2 => 15541,
        3 => 3,
        4 => 76,
        5 => '法宝/鲲鹏',
        6 => NULL,
      ),
      332 => 
      array (
        0 => 'VALUE',
        1 => '聚宝金盆',
        2 => 15561,
        3 => 3,
        4 => 76,
        5 => '法宝/鲲鹏',
        6 => NULL,
      ),
      333 => 
      array (
        0 => 'VALUE',
        1 => '紫金葫芦',
        2 => 15581,
        3 => 3,
        4 => 76,
        5 => '法宝/鲲鹏',
        6 => NULL,
      ),
      334 => 
      array (
        0 => 'VALUE',
        1 => '人参果树',
        2 => 15601,
        3 => 3,
        4 => 76,
        5 => '法宝/鲲鹏',
        6 => NULL,
      ),
      335 => 
      array (
        0 => 'VALUE',
        1 => '太清符',
        2 => 15621,
        3 => 3,
        4 => 76,
        5 => '法宝/鲲鹏',
        6 => NULL,
      ),
      336 => 
      array (
        0 => 'VALUE',
        1 => '地书',
        2 => 15641,
        3 => 3,
        4 => 76,
        5 => '法宝/鲲鹏',
        6 => NULL,
      ),
      337 => 
      array (
        0 => 'VALUE',
        1 => '华光矿石',
        2 => 17001,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      338 => 
      array (
        0 => 'VALUE',
        1 => '轻烟罗纱',
        2 => 17006,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      339 => 
      array (
        0 => 'VALUE',
        1 => '轻烟云锦',
        2 => 17011,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      340 => 
      array (
        0 => 'VALUE',
        1 => '轻烟绸缎',
        2 => 17016,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      341 => 
      array (
        0 => 'VALUE',
        1 => '轻烟呢绒',
        2 => 17021,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      342 => 
      array (
        0 => 'VALUE',
        1 => '轻烟玉石',
        2 => 17026,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      343 => 
      array (
        0 => 'VALUE',
        1 => '燕羽玄铁',
        2 => 17031,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      344 => 
      array (
        0 => 'VALUE',
        1 => '映水罗纱',
        2 => 17036,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      345 => 
      array (
        0 => 'VALUE',
        1 => '映水云锦',
        2 => 17041,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      346 => 
      array (
        0 => 'VALUE',
        1 => '映水绸缎',
        2 => 17046,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      347 => 
      array (
        0 => 'VALUE',
        1 => '映水呢绒',
        2 => 17051,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      348 => 
      array (
        0 => 'VALUE',
        1 => '映水玉石',
        2 => 17056,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      349 => 
      array (
        0 => 'VALUE',
        1 => '临渊枫木',
        2 => 17061,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      350 => 
      array (
        0 => 'VALUE',
        1 => '狼牙方钢',
        2 => 17066,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      351 => 
      array (
        0 => 'VALUE',
        1 => '凝霜蓝铜',
        2 => 17071,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      352 => 
      array (
        0 => 'VALUE',
        1 => '风痕罗纱',
        2 => 17076,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      353 => 
      array (
        0 => 'VALUE',
        1 => '风痕云锦',
        2 => 17081,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      354 => 
      array (
        0 => 'VALUE',
        1 => '风痕绸缎',
        2 => 17086,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      355 => 
      array (
        0 => 'VALUE',
        1 => '风痕呢绒',
        2 => 17091,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      356 => 
      array (
        0 => 'VALUE',
        1 => '风痕玉石',
        2 => 17096,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      357 => 
      array (
        0 => 'VALUE',
        1 => '乌曲柳木',
        2 => 17101,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      358 => 
      array (
        0 => 'VALUE',
        1 => '血鸢昆钢',
        2 => 17106,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      359 => 
      array (
        0 => 'VALUE',
        1 => '萃雨紫铜',
        2 => 17111,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      360 => 
      array (
        0 => 'VALUE',
        1 => '绛尘罗纱',
        2 => 17116,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      361 => 
      array (
        0 => 'VALUE',
        1 => '绛尘云锦',
        2 => 17121,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      362 => 
      array (
        0 => 'VALUE',
        1 => '绛尘绸缎',
        2 => 17126,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      363 => 
      array (
        0 => 'VALUE',
        1 => '绛尘呢绒',
        2 => 17131,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      364 => 
      array (
        0 => 'VALUE',
        1 => '绛尘玉石',
        2 => 17136,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      365 => 
      array (
        0 => 'VALUE',
        1 => '落碧红木',
        2 => 17141,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      366 => 
      array (
        0 => 'VALUE',
        1 => '碧浪焰钢',
        2 => 17146,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      367 => 
      array (
        0 => 'VALUE',
        1 => '火焕赤铜',
        2 => 17151,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      368 => 
      array (
        0 => 'VALUE',
        1 => '夜兰罗纱',
        2 => 17156,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      369 => 
      array (
        0 => 'VALUE',
        1 => '夜兰云锦',
        2 => 17161,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      370 => 
      array (
        0 => 'VALUE',
        1 => '夜兰绸缎',
        2 => 17166,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      371 => 
      array (
        0 => 'VALUE',
        1 => '夜兰呢绒',
        2 => 17171,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      372 => 
      array (
        0 => 'VALUE',
        1 => '夜兰玉石',
        2 => 17176,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      373 => 
      array (
        0 => 'VALUE',
        1 => '紫雪檀木',
        2 => 17181,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      374 => 
      array (
        0 => 'VALUE',
        1 => '鲛纹墨钢',
        2 => 17186,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      375 => 
      array (
        0 => 'VALUE',
        1 => '雷觉黄铜',
        2 => 17191,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      376 => 
      array (
        0 => 'VALUE',
        1 => '冰魄罗纱',
        2 => 17196,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      377 => 
      array (
        0 => 'VALUE',
        1 => '冰魄云锦',
        2 => 17201,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      378 => 
      array (
        0 => 'VALUE',
        1 => '冰魄绸缎',
        2 => 17206,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      379 => 
      array (
        0 => 'VALUE',
        1 => '冰魄呢绒',
        2 => 17211,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      380 => 
      array (
        0 => 'VALUE',
        1 => '冰魄玉石',
        2 => 17216,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      381 => 
      array (
        0 => 'VALUE',
        1 => '金丝楠木',
        2 => 17221,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      382 => 
      array (
        0 => 'VALUE',
        1 => '凰炎冥钢',
        2 => 17226,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      383 => 
      array (
        0 => 'VALUE',
        1 => '碎星青铜',
        2 => 17231,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      384 => 
      array (
        0 => 'VALUE',
        1 => '彩翼罗纱',
        2 => 17236,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      385 => 
      array (
        0 => 'VALUE',
        1 => '彩翼云锦',
        2 => 17241,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      386 => 
      array (
        0 => 'VALUE',
        1 => '彩翼绸缎',
        2 => 17246,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      387 => 
      array (
        0 => 'VALUE',
        1 => '彩翼呢绒',
        2 => 17251,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      388 => 
      array (
        0 => 'VALUE',
        1 => '彩翼玉石',
        2 => 17256,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      389 => 
      array (
        0 => 'VALUE',
        1 => '玉香黎木',
        2 => 17261,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      390 => 
      array (
        0 => 'VALUE',
        1 => '溢泉辉钢',
        2 => 17266,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      391 => 
      array (
        0 => 'VALUE',
        1 => '炎韵白铜',
        2 => 17271,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      392 => 
      array (
        0 => 'VALUE',
        1 => '凫雁罗纱',
        2 => 17276,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      393 => 
      array (
        0 => 'VALUE',
        1 => '凫雁云锦',
        2 => 17281,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      394 => 
      array (
        0 => 'VALUE',
        1 => '凫雁绸缎',
        2 => 17286,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      395 => 
      array (
        0 => 'VALUE',
        1 => '凫雁呢绒',
        2 => 17291,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      396 => 
      array (
        0 => 'VALUE',
        1 => '岛雁玉石',
        2 => 17296,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      397 => 
      array (
        0 => 'VALUE',
        1 => '花梨影木',
        2 => 17301,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      398 => 
      array (
        0 => 'VALUE',
        1 => '苍螭湛钢',
        2 => 17306,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      399 => 
      array (
        0 => 'VALUE',
        1 => '竹蝶靛铜',
        2 => 17311,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      400 => 
      array (
        0 => 'VALUE',
        1 => '潋滟罗纱',
        2 => 17316,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      401 => 
      array (
        0 => 'VALUE',
        1 => '潋滟云锦',
        2 => 17321,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      402 => 
      array (
        0 => 'VALUE',
        1 => '潋滟绸缎',
        2 => 17326,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      403 => 
      array (
        0 => 'VALUE',
        1 => '潋滟呢绒',
        2 => 17331,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      404 => 
      array (
        0 => 'VALUE',
        1 => '潋滟玉石',
        2 => 17336,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      405 => 
      array (
        0 => 'VALUE',
        1 => '流云苏木',
        2 => 17341,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      406 => 
      array (
        0 => 'VALUE',
        1 => '万刃鑫钢',
        2 => 17346,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      407 => 
      array (
        0 => 'VALUE',
        1 => '焰日红铜',
        2 => 17351,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      408 => 
      array (
        0 => 'VALUE',
        1 => '沉隐罗纱',
        2 => 17356,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      409 => 
      array (
        0 => 'VALUE',
        1 => '沉隐云锦',
        2 => 17361,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      410 => 
      array (
        0 => 'VALUE',
        1 => '沉隐绸缎',
        2 => 17366,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      411 => 
      array (
        0 => 'VALUE',
        1 => '沉隐呢绒',
        2 => 17371,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      412 => 
      array (
        0 => 'VALUE',
        1 => '沉隐玉石',
        2 => 17376,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      413 => 
      array (
        0 => 'VALUE',
        1 => '翔鹤沉木',
        2 => 17381,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      414 => 
      array (
        0 => 'VALUE',
        1 => '断寒殷钢',
        2 => 17386,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      415 => 
      array (
        0 => 'VALUE',
        1 => '胧月灰铜',
        2 => 17391,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      416 => 
      array (
        0 => 'VALUE',
        1 => '血薇罗纱',
        2 => 17396,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      417 => 
      array (
        0 => 'VALUE',
        1 => '血薇云锦',
        2 => 17401,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      418 => 
      array (
        0 => 'VALUE',
        1 => '血薇绸缎',
        2 => 17406,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      419 => 
      array (
        0 => 'VALUE',
        1 => '血薇呢绒',
        2 => 17411,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      420 => 
      array (
        0 => 'VALUE',
        1 => '血薇玉石',
        2 => 17416,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      421 => 
      array (
        0 => 'VALUE',
        1 => '毓紫椿木',
        2 => 17421,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      422 => 
      array (
        0 => 'VALUE',
        1 => '景斓烟钢',
        2 => 17426,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      423 => 
      array (
        0 => 'VALUE',
        1 => '雨夜玫铜',
        2 => 17431,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      424 => 
      array (
        0 => 'VALUE',
        1 => '暗殇罗纱',
        2 => 17436,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      425 => 
      array (
        0 => 'VALUE',
        1 => '暗殇云锦',
        2 => 17441,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      426 => 
      array (
        0 => 'VALUE',
        1 => '暗殇绸缎',
        2 => 17446,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      427 => 
      array (
        0 => 'VALUE',
        1 => '暗殇呢绒',
        2 => 17451,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      428 => 
      array (
        0 => 'VALUE',
        1 => '暗殇玉石',
        2 => 17456,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      429 => 
      array (
        0 => 'VALUE',
        1 => '鸣蝉栎木',
        2 => 17461,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      430 => 
      array (
        0 => 'VALUE',
        1 => '莹华泊钢',
        2 => 17466,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      431 => 
      array (
        0 => 'VALUE',
        1 => '水云墨铜',
        2 => 17471,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      432 => 
      array (
        0 => 'VALUE',
        1 => '沁寒罗纱',
        2 => 17476,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      433 => 
      array (
        0 => 'VALUE',
        1 => '沁寒云锦',
        2 => 17481,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      434 => 
      array (
        0 => 'VALUE',
        1 => '沁寒绸缎',
        2 => 17486,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      435 => 
      array (
        0 => 'VALUE',
        1 => '沁寒呢绒',
        2 => 17491,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      436 => 
      array (
        0 => 'VALUE',
        1 => '沁寒玉石',
        2 => 17496,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      437 => 
      array (
        0 => 'VALUE',
        1 => '傲雪杨木',
        2 => 17501,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      438 => 
      array (
        0 => 'VALUE',
        1 => '幽真钰钢',
        2 => 17506,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      439 => 
      array (
        0 => 'VALUE',
        1 => '凝冰银铜',
        2 => 17511,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      440 => 
      array (
        0 => 'VALUE',
        1 => '瑶清罗纱',
        2 => 17516,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      441 => 
      array (
        0 => 'VALUE',
        1 => '瑶清云锦',
        2 => 17521,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      442 => 
      array (
        0 => 'VALUE',
        1 => '瑶清绸缎',
        2 => 17526,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      443 => 
      array (
        0 => 'VALUE',
        1 => '瑶清呢绒',
        2 => 17531,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      444 => 
      array (
        0 => 'VALUE',
        1 => '瑶清玉石',
        2 => 17536,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      445 => 
      array (
        0 => 'VALUE',
        1 => '祥云乌木',
        2 => 17541,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      446 => 
      array (
        0 => 'VALUE',
        1 => '蓝鲷炫钢',
        2 => 17546,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      447 => 
      array (
        0 => 'VALUE',
        1 => '逸灵碧铜',
        2 => 17551,
        3 => 4,
        4 => 91,
        5 => '材料/装备材料',
        6 => NULL,
      ),
      448 => 
      array (
        0 => 'VALUE',
        1 => '青龙圣鳞',
        2 => 18301,
        3 => 4,
        4 => 91,
        5 => '材料/法宝材料',
        6 => NULL,
      ),
      449 => 
      array (
        0 => 'VALUE',
        1 => '玄武灵甲',
        2 => 18306,
        3 => 4,
        4 => 91,
        5 => '材料/法宝材料',
        6 => NULL,
      ),
      450 => 
      array (
        0 => 'VALUE',
        1 => '白虎符纹',
        2 => 18311,
        3 => 4,
        4 => 91,
        5 => '材料/法宝材料',
        6 => NULL,
      ),
      451 => 
      array (
        0 => 'VALUE',
        1 => '朱雀火羽',
        2 => 18316,
        3 => 4,
        4 => 91,
        5 => '材料/法宝材料',
        6 => NULL,
      ),
      452 => 
      array (
        0 => 'VALUE',
        1 => '鲲鹏翅骨',
        2 => 18321,
        3 => 4,
        4 => 91,
        5 => '材料/法宝材料',
        6 => NULL,
      ),
      453 => 
      array (
        0 => 'VALUE',
        1 => '麒麟犄角',
        2 => 18326,
        3 => 4,
        4 => 91,
        5 => '材料/法宝材料',
        6 => NULL,
      ),
      454 => 
      array (
        0 => 'VALUE',
        1 => '法宝升星石',
        2 => 18331,
        3 => 4,
        4 => 91,
        5 => '材料/法宝材料',
        6 => NULL,
      ),
      455 => 
      array (
        0 => 'VALUE',
        1 => '灵柔砂',
        2 => 18501,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      456 => 
      array (
        0 => 'VALUE',
        1 => '雨花石',
        2 => 18506,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      457 => 
      array (
        0 => 'VALUE',
        1 => '雪鸳钻',
        2 => 18511,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      458 => 
      array (
        0 => 'VALUE',
        1 => '雪鸳珠',
        2 => 18516,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      459 => 
      array (
        0 => 'VALUE',
        1 => '雪鸳玉',
        2 => 18521,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      460 => 
      array (
        0 => 'VALUE',
        1 => '真元雪鸳钻',
        2 => 18526,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      461 => 
      array (
        0 => 'VALUE',
        1 => '真元雪鸳珠',
        2 => 18531,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      462 => 
      array (
        0 => 'VALUE',
        1 => '真元雪鸳玉',
        2 => 18536,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      463 => 
      array (
        0 => 'VALUE',
        1 => '风凌石',
        2 => 18541,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      464 => 
      array (
        0 => 'VALUE',
        1 => '碧鸾钻',
        2 => 18546,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      465 => 
      array (
        0 => 'VALUE',
        1 => '碧鸾珠',
        2 => 18551,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      466 => 
      array (
        0 => 'VALUE',
        1 => '碧鸾玉',
        2 => 18556,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      467 => 
      array (
        0 => 'VALUE',
        1 => '真元碧鸾钻',
        2 => 18561,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      468 => 
      array (
        0 => 'VALUE',
        1 => '真元碧鸾珠',
        2 => 18566,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      469 => 
      array (
        0 => 'VALUE',
        1 => '真元碧鸾玉',
        2 => 18571,
        3 => 4,
        4 => 91,
        5 => '材料/首饰材料',
        6 => NULL,
      ),
      470 => 
      array (
        0 => 'VALUE',
        1 => '1级力量灵珠',
        2 => 20001,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      471 => 
      array (
        0 => 'VALUE',
        1 => '2级力量灵珠',
        2 => 20021,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      472 => 
      array (
        0 => 'VALUE',
        1 => '3级力量灵珠',
        2 => 20041,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      473 => 
      array (
        0 => 'VALUE',
        1 => '4级力量灵珠',
        2 => 20061,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      474 => 
      array (
        0 => 'VALUE',
        1 => '5级力量灵珠',
        2 => 20081,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      475 => 
      array (
        0 => 'VALUE',
        1 => '6级力量灵珠',
        2 => 20101,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      476 => 
      array (
        0 => 'VALUE',
        1 => '7级力量灵珠',
        2 => 20121,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      477 => 
      array (
        0 => 'VALUE',
        1 => '8级力量灵珠',
        2 => 20141,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      478 => 
      array (
        0 => 'VALUE',
        1 => '9级力量灵珠',
        2 => 20161,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      479 => 
      array (
        0 => 'VALUE',
        1 => '10级力量灵珠',
        2 => 20181,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      480 => 
      array (
        0 => 'VALUE',
        1 => '11级力量灵珠',
        2 => 20201,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      481 => 
      array (
        0 => 'VALUE',
        1 => '12级力量灵珠',
        2 => 20221,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      482 => 
      array (
        0 => 'VALUE',
        1 => '13级力量灵珠',
        2 => 20241,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      483 => 
      array (
        0 => 'VALUE',
        1 => '14级力量灵珠',
        2 => 20261,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      484 => 
      array (
        0 => 'VALUE',
        1 => '15级力量灵珠',
        2 => 20281,
        3 => 5,
        4 => 111,
        5 => '灵珠/力量灵珠',
        6 => NULL,
      ),
      485 => 
      array (
        0 => 'VALUE',
        1 => '1级灵力灵珠',
        2 => 21001,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      486 => 
      array (
        0 => 'VALUE',
        1 => '2级灵力灵珠',
        2 => 21021,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      487 => 
      array (
        0 => 'VALUE',
        1 => '3级灵力灵珠',
        2 => 21041,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      488 => 
      array (
        0 => 'VALUE',
        1 => '4级灵力灵珠',
        2 => 21061,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      489 => 
      array (
        0 => 'VALUE',
        1 => '5级灵力灵珠',
        2 => 21081,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      490 => 
      array (
        0 => 'VALUE',
        1 => '6级灵力灵珠',
        2 => 21101,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      491 => 
      array (
        0 => 'VALUE',
        1 => '7级灵力灵珠',
        2 => 21121,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      492 => 
      array (
        0 => 'VALUE',
        1 => '8级灵力灵珠',
        2 => 21141,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      493 => 
      array (
        0 => 'VALUE',
        1 => '9级灵力灵珠',
        2 => 21161,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      494 => 
      array (
        0 => 'VALUE',
        1 => '10级灵力灵珠',
        2 => 21181,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      495 => 
      array (
        0 => 'VALUE',
        1 => '11级灵力灵珠',
        2 => 21201,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      496 => 
      array (
        0 => 'VALUE',
        1 => '12级灵力灵珠',
        2 => 21221,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      497 => 
      array (
        0 => 'VALUE',
        1 => '13级灵力灵珠',
        2 => 21241,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      498 => 
      array (
        0 => 'VALUE',
        1 => '14级灵力灵珠',
        2 => 21261,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      499 => 
      array (
        0 => 'VALUE',
        1 => '15级灵力灵珠',
        2 => 21281,
        3 => 5,
        4 => 112,
        5 => '灵珠/灵力灵珠',
        6 => NULL,
      ),
      500 => 
      array (
        0 => 'VALUE',
        1 => '1级气血灵珠',
        2 => 22001,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      501 => 
      array (
        0 => 'VALUE',
        1 => '2级气血灵珠',
        2 => 22021,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      502 => 
      array (
        0 => 'VALUE',
        1 => '3级气血灵珠',
        2 => 22041,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      503 => 
      array (
        0 => 'VALUE',
        1 => '4级气血灵珠',
        2 => 22061,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      504 => 
      array (
        0 => 'VALUE',
        1 => '5级气血灵珠',
        2 => 22081,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      505 => 
      array (
        0 => 'VALUE',
        1 => '6级气血灵珠',
        2 => 22101,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      506 => 
      array (
        0 => 'VALUE',
        1 => '7级气血灵珠',
        2 => 22121,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      507 => 
      array (
        0 => 'VALUE',
        1 => '8级气血灵珠',
        2 => 22141,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      508 => 
      array (
        0 => 'VALUE',
        1 => '9级气血灵珠',
        2 => 22161,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      509 => 
      array (
        0 => 'VALUE',
        1 => '10级气血灵珠',
        2 => 22181,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      510 => 
      array (
        0 => 'VALUE',
        1 => '11级气血灵珠',
        2 => 22201,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      511 => 
      array (
        0 => 'VALUE',
        1 => '12级气血灵珠',
        2 => 22221,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      512 => 
      array (
        0 => 'VALUE',
        1 => '13级气血灵珠',
        2 => 22241,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      513 => 
      array (
        0 => 'VALUE',
        1 => '14级气血灵珠',
        2 => 22261,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      514 => 
      array (
        0 => 'VALUE',
        1 => '15级气血灵珠',
        2 => 22281,
        3 => 5,
        4 => 113,
        5 => '灵珠/气血灵珠',
        6 => NULL,
      ),
      515 => 
      array (
        0 => 'VALUE',
        1 => '1级速度灵珠',
        2 => 23001,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      516 => 
      array (
        0 => 'VALUE',
        1 => '2级速度灵珠',
        2 => 23021,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      517 => 
      array (
        0 => 'VALUE',
        1 => '3级速度灵珠',
        2 => 23041,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      518 => 
      array (
        0 => 'VALUE',
        1 => '4级速度灵珠',
        2 => 23061,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      519 => 
      array (
        0 => 'VALUE',
        1 => '5级速度灵珠',
        2 => 23081,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      520 => 
      array (
        0 => 'VALUE',
        1 => '6级速度灵珠',
        2 => 23101,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      521 => 
      array (
        0 => 'VALUE',
        1 => '7级速度灵珠',
        2 => 23121,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      522 => 
      array (
        0 => 'VALUE',
        1 => '8级速度灵珠',
        2 => 23141,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      523 => 
      array (
        0 => 'VALUE',
        1 => '9级速度灵珠',
        2 => 23161,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      524 => 
      array (
        0 => 'VALUE',
        1 => '10级速度灵珠',
        2 => 23181,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      525 => 
      array (
        0 => 'VALUE',
        1 => '11级速度灵珠',
        2 => 23201,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      526 => 
      array (
        0 => 'VALUE',
        1 => '12级速度灵珠',
        2 => 23221,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      527 => 
      array (
        0 => 'VALUE',
        1 => '13级速度灵珠',
        2 => 23241,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      528 => 
      array (
        0 => 'VALUE',
        1 => '14级速度灵珠',
        2 => 23261,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      529 => 
      array (
        0 => 'VALUE',
        1 => '15级速度灵珠',
        2 => 23281,
        3 => 5,
        4 => 114,
        5 => '灵珠/速度灵珠',
        6 => NULL,
      ),
      530 => 
      array (
        0 => 'VALUE',
        1 => '1级暴击灵珠',
        2 => 24001,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      531 => 
      array (
        0 => 'VALUE',
        1 => '2级暴击灵珠',
        2 => 24021,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      532 => 
      array (
        0 => 'VALUE',
        1 => '3级暴击灵珠',
        2 => 24041,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      533 => 
      array (
        0 => 'VALUE',
        1 => '4级暴击灵珠',
        2 => 24061,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      534 => 
      array (
        0 => 'VALUE',
        1 => '5级暴击灵珠',
        2 => 24081,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      535 => 
      array (
        0 => 'VALUE',
        1 => '6级暴击灵珠',
        2 => 24101,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      536 => 
      array (
        0 => 'VALUE',
        1 => '7级暴击灵珠',
        2 => 24121,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      537 => 
      array (
        0 => 'VALUE',
        1 => '8级暴击灵珠',
        2 => 24141,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      538 => 
      array (
        0 => 'VALUE',
        1 => '9级暴击灵珠',
        2 => 24161,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      539 => 
      array (
        0 => 'VALUE',
        1 => '10级暴击灵珠',
        2 => 24181,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      540 => 
      array (
        0 => 'VALUE',
        1 => '11级暴击灵珠',
        2 => 24201,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      541 => 
      array (
        0 => 'VALUE',
        1 => '12级暴击灵珠',
        2 => 24221,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      542 => 
      array (
        0 => 'VALUE',
        1 => '13级暴击灵珠',
        2 => 24241,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      543 => 
      array (
        0 => 'VALUE',
        1 => '14级暴击灵珠',
        2 => 24261,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      544 => 
      array (
        0 => 'VALUE',
        1 => '15级暴击灵珠',
        2 => 24281,
        3 => 5,
        4 => 115,
        5 => '灵珠/暴击灵珠',
        6 => NULL,
      ),
      545 => 
      array (
        0 => 'VALUE',
        1 => '1级抗暴灵珠',
        2 => 25001,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      546 => 
      array (
        0 => 'VALUE',
        1 => '2级抗暴灵珠',
        2 => 25021,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      547 => 
      array (
        0 => 'VALUE',
        1 => '3级抗暴灵珠',
        2 => 25041,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      548 => 
      array (
        0 => 'VALUE',
        1 => '4级抗暴灵珠',
        2 => 25061,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      549 => 
      array (
        0 => 'VALUE',
        1 => '5级抗暴灵珠',
        2 => 25081,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      550 => 
      array (
        0 => 'VALUE',
        1 => '6级抗暴灵珠',
        2 => 25101,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      551 => 
      array (
        0 => 'VALUE',
        1 => '7级抗暴灵珠',
        2 => 25121,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      552 => 
      array (
        0 => 'VALUE',
        1 => '8级抗暴灵珠',
        2 => 25141,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      553 => 
      array (
        0 => 'VALUE',
        1 => '9级抗暴灵珠',
        2 => 25161,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      554 => 
      array (
        0 => 'VALUE',
        1 => '10级抗暴灵珠',
        2 => 25181,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      555 => 
      array (
        0 => 'VALUE',
        1 => '11级抗暴灵珠',
        2 => 25201,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      556 => 
      array (
        0 => 'VALUE',
        1 => '12级抗暴灵珠',
        2 => 25221,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      557 => 
      array (
        0 => 'VALUE',
        1 => '13级抗暴灵珠',
        2 => 25241,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      558 => 
      array (
        0 => 'VALUE',
        1 => '14级抗暴灵珠',
        2 => 25261,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      559 => 
      array (
        0 => 'VALUE',
        1 => '15级抗暴灵珠',
        2 => 25281,
        3 => 5,
        4 => 116,
        5 => '灵珠/抗暴灵珠',
        6 => NULL,
      ),
      560 => 
      array (
        0 => 'VALUE',
        1 => '1级命中灵珠',
        2 => 26001,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      561 => 
      array (
        0 => 'VALUE',
        1 => '2级命中灵珠',
        2 => 26021,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      562 => 
      array (
        0 => 'VALUE',
        1 => '3级命中灵珠',
        2 => 26041,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      563 => 
      array (
        0 => 'VALUE',
        1 => '4级命中灵珠',
        2 => 26061,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      564 => 
      array (
        0 => 'VALUE',
        1 => '5级命中灵珠',
        2 => 26081,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      565 => 
      array (
        0 => 'VALUE',
        1 => '6级命中灵珠',
        2 => 26101,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      566 => 
      array (
        0 => 'VALUE',
        1 => '7级命中灵珠',
        2 => 26121,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      567 => 
      array (
        0 => 'VALUE',
        1 => '8级命中灵珠',
        2 => 26141,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      568 => 
      array (
        0 => 'VALUE',
        1 => '9级命中灵珠',
        2 => 26161,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      569 => 
      array (
        0 => 'VALUE',
        1 => '10级命中灵珠',
        2 => 26181,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      570 => 
      array (
        0 => 'VALUE',
        1 => '11级命中灵珠',
        2 => 26201,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      571 => 
      array (
        0 => 'VALUE',
        1 => '12级命中灵珠',
        2 => 26221,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      572 => 
      array (
        0 => 'VALUE',
        1 => '13级命中灵珠',
        2 => 26241,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      573 => 
      array (
        0 => 'VALUE',
        1 => '14级命中灵珠',
        2 => 26261,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      574 => 
      array (
        0 => 'VALUE',
        1 => '15级命中灵珠',
        2 => 26281,
        3 => 5,
        4 => 117,
        5 => '灵珠/命中灵珠',
        6 => NULL,
      ),
      575 => 
      array (
        0 => 'VALUE',
        1 => '1级躲避灵珠',
        2 => 27001,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      576 => 
      array (
        0 => 'VALUE',
        1 => '2级躲避灵珠',
        2 => 27021,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      577 => 
      array (
        0 => 'VALUE',
        1 => '3级躲避灵珠',
        2 => 27041,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      578 => 
      array (
        0 => 'VALUE',
        1 => '4级躲避灵珠',
        2 => 27061,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      579 => 
      array (
        0 => 'VALUE',
        1 => '5级躲避灵珠',
        2 => 27081,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      580 => 
      array (
        0 => 'VALUE',
        1 => '6级躲避灵珠',
        2 => 27101,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      581 => 
      array (
        0 => 'VALUE',
        1 => '7级躲避灵珠',
        2 => 27121,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      582 => 
      array (
        0 => 'VALUE',
        1 => '8级躲避灵珠',
        2 => 27141,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      583 => 
      array (
        0 => 'VALUE',
        1 => '9级躲避灵珠',
        2 => 27161,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      584 => 
      array (
        0 => 'VALUE',
        1 => '10级躲避灵珠',
        2 => 27181,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      585 => 
      array (
        0 => 'VALUE',
        1 => '11级躲避灵珠',
        2 => 27201,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      586 => 
      array (
        0 => 'VALUE',
        1 => '12级躲避灵珠',
        2 => 27221,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      587 => 
      array (
        0 => 'VALUE',
        1 => '13级躲避灵珠',
        2 => 27241,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      588 => 
      array (
        0 => 'VALUE',
        1 => '14级躲避灵珠',
        2 => 27261,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      589 => 
      array (
        0 => 'VALUE',
        1 => '15级躲避灵珠',
        2 => 27281,
        3 => 5,
        4 => 118,
        5 => '灵珠/躲避灵珠',
        6 => NULL,
      ),
      590 => 
      array (
        0 => 'VALUE',
        1 => '1级破击灵珠',
        2 => 28001,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      591 => 
      array (
        0 => 'VALUE',
        1 => '2级破击灵珠',
        2 => 28021,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      592 => 
      array (
        0 => 'VALUE',
        1 => '3级破击灵珠',
        2 => 28041,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      593 => 
      array (
        0 => 'VALUE',
        1 => '4级破击灵珠',
        2 => 28061,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      594 => 
      array (
        0 => 'VALUE',
        1 => '5级破击灵珠',
        2 => 28081,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      595 => 
      array (
        0 => 'VALUE',
        1 => '6级破击灵珠',
        2 => 28101,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      596 => 
      array (
        0 => 'VALUE',
        1 => '7级破击灵珠',
        2 => 28121,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      597 => 
      array (
        0 => 'VALUE',
        1 => '8级破击灵珠',
        2 => 28141,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      598 => 
      array (
        0 => 'VALUE',
        1 => '9级破击灵珠',
        2 => 28161,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      599 => 
      array (
        0 => 'VALUE',
        1 => '10级破击灵珠',
        2 => 28181,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      600 => 
      array (
        0 => 'VALUE',
        1 => '11级破击灵珠',
        2 => 28201,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      601 => 
      array (
        0 => 'VALUE',
        1 => '12级破击灵珠',
        2 => 28221,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      602 => 
      array (
        0 => 'VALUE',
        1 => '13级破击灵珠',
        2 => 28241,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      603 => 
      array (
        0 => 'VALUE',
        1 => '14级破击灵珠',
        2 => 28261,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      604 => 
      array (
        0 => 'VALUE',
        1 => '15级破击灵珠',
        2 => 28281,
        3 => 5,
        4 => 119,
        5 => '灵珠/破击灵珠',
        6 => NULL,
      ),
      605 => 
      array (
        0 => 'VALUE',
        1 => '1级格挡灵珠',
        2 => 29001,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      606 => 
      array (
        0 => 'VALUE',
        1 => '2级格挡灵珠',
        2 => 29021,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      607 => 
      array (
        0 => 'VALUE',
        1 => '3级格挡灵珠',
        2 => 29041,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      608 => 
      array (
        0 => 'VALUE',
        1 => '4级格挡灵珠',
        2 => 29061,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      609 => 
      array (
        0 => 'VALUE',
        1 => '5级格挡灵珠',
        2 => 29081,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      610 => 
      array (
        0 => 'VALUE',
        1 => '6级格挡灵珠',
        2 => 29101,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      611 => 
      array (
        0 => 'VALUE',
        1 => '7级格挡灵珠',
        2 => 29121,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      612 => 
      array (
        0 => 'VALUE',
        1 => '8级格挡灵珠',
        2 => 29141,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      613 => 
      array (
        0 => 'VALUE',
        1 => '9级格挡灵珠',
        2 => 29161,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      614 => 
      array (
        0 => 'VALUE',
        1 => '10级格挡灵珠',
        2 => 29181,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      615 => 
      array (
        0 => 'VALUE',
        1 => '11级格挡灵珠',
        2 => 29201,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      616 => 
      array (
        0 => 'VALUE',
        1 => '12级格挡灵珠',
        2 => 29221,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      617 => 
      array (
        0 => 'VALUE',
        1 => '13级格挡灵珠',
        2 => 29241,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      618 => 
      array (
        0 => 'VALUE',
        1 => '14级格挡灵珠',
        2 => 29261,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      619 => 
      array (
        0 => 'VALUE',
        1 => '15级格挡灵珠',
        2 => 29281,
        3 => 5,
        4 => 120,
        5 => '灵珠/格挡灵珠',
        6 => NULL,
      ),
      620 => 
      array (
        0 => 'VALUE',
        1 => '初级士气灵珠',
        2 => 30001,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      621 => 
      array (
        0 => 'VALUE',
        1 => '中级士气灵珠',
        2 => 30021,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      622 => 
      array (
        0 => 'VALUE',
        1 => '高级士气灵珠',
        2 => 30041,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      623 => 
      array (
        0 => 'VALUE',
        1 => '王者士气灵珠',
        2 => 30061,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      624 => 
      array (
        0 => 'VALUE',
        1 => '史诗士气灵珠',
        2 => 30081,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      625 => 
      array (
        0 => 'VALUE',
        1 => '至尊士气灵珠',
        2 => 30101,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      626 => 
      array (
        0 => 'VALUE',
        1 => '天芒士气灵珠',
        2 => 30121,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      627 => 
      array (
        0 => 'VALUE',
        1 => '神级士气灵珠',
        2 => 30141,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      628 => 
      array (
        0 => 'VALUE',
        1 => '9级士气灵珠',
        2 => 30161,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      629 => 
      array (
        0 => 'VALUE',
        1 => '10级士气灵珠',
        2 => 30181,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      630 => 
      array (
        0 => 'VALUE',
        1 => '11级士气灵珠',
        2 => 30201,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      631 => 
      array (
        0 => 'VALUE',
        1 => '12级士气灵珠',
        2 => 30221,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      632 => 
      array (
        0 => 'VALUE',
        1 => '13级士气灵珠',
        2 => 30241,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      633 => 
      array (
        0 => 'VALUE',
        1 => '14级士气灵珠',
        2 => 30261,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      634 => 
      array (
        0 => 'VALUE',
        1 => '15级士气灵珠',
        2 => 30281,
        3 => 5,
        4 => 121,
        5 => '灵珠/士气灵珠',
        6 => NULL,
      ),
      635 => 
      array (
        0 => 'VALUE',
        1 => '10级礼包',
        2 => 40001,
        3 => 6,
        4 => 131,
        5 => '杂项/礼包',
        6 => NULL,
      ),
      636 => 
      array (
        0 => 'VALUE',
        1 => '1分钟礼包',
        2 => 40036,
        3 => 6,
        4 => 131,
        5 => '杂项/礼包',
        6 => NULL,
      ),
      637 => 
      array (
        0 => 'VALUE',
        1 => '百宝箱',
        2 => 41001,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      638 => 
      array (
        0 => 'VALUE',
        1 => '帮派材料箱',
        2 => 41006,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      639 => 
      array (
        0 => 'VALUE',
        1 => '普通材料箱',
        2 => 41011,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      640 => 
      array (
        0 => 'VALUE',
        1 => '特殊材料箱',
        2 => 41016,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      641 => 
      array (
        0 => 'VALUE',
        1 => '岚玥材料箱',
        2 => 41021,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      642 => 
      array (
        0 => 'VALUE',
        1 => '炫影材料箱',
        2 => 41026,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      643 => 
      array (
        0 => 'VALUE',
        1 => '焰赤材料箱',
        2 => 41031,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      644 => 
      array (
        0 => 'VALUE',
        1 => '逸辰材料箱',
        2 => 41036,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      645 => 
      array (
        0 => 'VALUE',
        1 => '虎魄材料箱',
        2 => 41041,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      646 => 
      array (
        0 => 'VALUE',
        1 => '凤阙材料箱',
        2 => 41046,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      647 => 
      array (
        0 => 'VALUE',
        1 => '1级灵珠盒',
        2 => 41066,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      648 => 
      array (
        0 => 'VALUE',
        1 => '2级灵珠盒',
        2 => 41071,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      649 => 
      array (
        0 => 'VALUE',
        1 => '3级灵珠盒',
        2 => 41076,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      650 => 
      array (
        0 => 'VALUE',
        1 => '4级灵珠盒',
        2 => 41081,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      651 => 
      array (
        0 => 'VALUE',
        1 => '5级灵珠盒',
        2 => 41086,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      652 => 
      array (
        0 => 'VALUE',
        1 => '6级灵珠盒',
        2 => 41091,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      653 => 
      array (
        0 => 'VALUE',
        1 => '7级灵珠盒',
        2 => 41096,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      654 => 
      array (
        0 => 'VALUE',
        1 => '8级灵珠盒',
        2 => 41101,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      655 => 
      array (
        0 => 'VALUE',
        1 => '9级灵珠盒',
        2 => 41106,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      656 => 
      array (
        0 => 'VALUE',
        1 => '10级灵珠盒',
        2 => 41111,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      657 => 
      array (
        0 => 'VALUE',
        1 => '初级星魂盒',
        2 => 41116,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      658 => 
      array (
        0 => 'VALUE',
        1 => '初级声望盒',
        2 => 41121,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      659 => 
      array (
        0 => 'VALUE',
        1 => 'VIP签到宝箱',
        2 => 41126,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      660 => 
      array (
        0 => 'VALUE',
        1 => '1级灵珠礼盒',
        2 => 41151,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      661 => 
      array (
        0 => 'VALUE',
        1 => '3级灵珠礼盒',
        2 => 41156,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      662 => 
      array (
        0 => 'VALUE',
        1 => '4级灵珠礼盒',
        2 => 41161,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      663 => 
      array (
        0 => 'VALUE',
        1 => '玉清大礼包',
        2 => 41181,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      664 => 
      array (
        0 => 'VALUE',
        1 => '豪华玉清大礼包',
        2 => 41186,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      665 => 
      array (
        0 => 'VALUE',
        1 => '神秘卡片',
        2 => 41226,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      666 => 
      array (
        0 => 'VALUE',
        1 => '缤纷卡片',
        2 => 41231,
        3 => 6,
        4 => 132,
        5 => '杂项/宝盒',
        6 => NULL,
      ),
      667 => 
      array (
        0 => 'VALUE',
        1 => '驭兽铃铛',
        2 => 42001,
        3 => 6,
        4 => 133,
        5 => '杂项/铃铛',
        6 => NULL,
      ),
      668 => 
      array (
        0 => 'VALUE',
        1 => '六号钱袋',
        2 => 43001,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      669 => 
      array (
        0 => 'VALUE',
        1 => '九号钱袋',
        2 => 43061,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      670 => 
      array (
        0 => 'VALUE',
        1 => '一号钱袋',
        2 => 43101,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      671 => 
      array (
        0 => 'VALUE',
        1 => '四号钱袋',
        2 => 43161,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      672 => 
      array (
        0 => 'VALUE',
        1 => '一号金元包',
        2 => 43191,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      673 => 
      array (
        0 => 'VALUE',
        1 => '二号金元包',
        2 => 43201,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      674 => 
      array (
        0 => 'VALUE',
        1 => '三号金元包',
        2 => 43221,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      675 => 
      array (
        0 => 'VALUE',
        1 => '四号金元包',
        2 => 43241,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      676 => 
      array (
        0 => 'VALUE',
        1 => '五号金元包',
        2 => 43261,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      677 => 
      array (
        0 => 'VALUE',
        1 => '六号金元包',
        2 => 43281,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      678 => 
      array (
        0 => 'VALUE',
        1 => '初级声望盒',
        2 => 43301,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      679 => 
      array (
        0 => 'VALUE',
        1 => '中级声望盒',
        2 => 43321,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      680 => 
      array (
        0 => 'VALUE',
        1 => '高级声望盒',
        2 => 43341,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      681 => 
      array (
        0 => 'VALUE',
        1 => '超级声望盒',
        2 => 43361,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      682 => 
      array (
        0 => 'VALUE',
        1 => '顶级声望盒',
        2 => 43381,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      683 => 
      array (
        0 => 'VALUE',
        1 => '初品精力果',
        2 => 43391,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      684 => 
      array (
        0 => 'VALUE',
        1 => '良品精力果',
        2 => 43401,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      685 => 
      array (
        0 => 'VALUE',
        1 => '优品精力果',
        2 => 43421,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      686 => 
      array (
        0 => 'VALUE',
        1 => '极品精力果',
        2 => 43441,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      687 => 
      array (
        0 => 'VALUE',
        1 => '仙品精力果',
        2 => 43461,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      688 => 
      array (
        0 => 'VALUE',
        1 => '圣品精力丹',
        2 => 43481,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      689 => 
      array (
        0 => 'VALUE',
        1 => '初级星魂盒',
        2 => 43501,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      690 => 
      array (
        0 => 'VALUE',
        1 => '中级星魂盒',
        2 => 43521,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      691 => 
      array (
        0 => 'VALUE',
        1 => '高级星魂盒',
        2 => 43541,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      692 => 
      array (
        0 => 'VALUE',
        1 => '超级星魂盒',
        2 => 43561,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      693 => 
      array (
        0 => 'VALUE',
        1 => '顶级星魂盒',
        2 => 43581,
        3 => 6,
        4 => 134,
        5 => '杂项/钱袋',
        6 => NULL,
      ),
      694 => 
      array (
        0 => 'VALUE',
        1 => '初级经验丹',
        2 => 44001,
        3 => 6,
        4 => 135,
        5 => '杂项/伙伴经验丹',
        6 => '',
      ),
      695 => 
      array (
        0 => 'VALUE',
        1 => '中级经验丹',
        2 => 44006,
        3 => 6,
        4 => 135,
        5 => '杂项/伙伴经验丹',
        6 => '',
      ),
      696 => 
      array (
        0 => 'VALUE',
        1 => '高级经验丹',
        2 => 44011,
        3 => 6,
        4 => 135,
        5 => '杂项/伙伴经验丹',
        6 => '',
      ),
      697 => 
      array (
        0 => 'VALUE',
        1 => '超级经验丹',
        2 => 44016,
        3 => 6,
        4 => 135,
        5 => '杂项/伙伴经验丹',
        6 => '',
      ),
      698 => 
      array (
        0 => 'VALUE',
        1 => '顶级经验丹',
        2 => 44021,
        3 => 6,
        4 => 135,
        5 => '杂项/伙伴经验丹',
        6 => '',
      ),
      699 => 
      array (
        0 => 'VALUE',
        1 => '圣级经验丹',
        2 => 44026,
        3 => 6,
        4 => 135,
        5 => '杂项/伙伴经验丹',
        6 => '',
      ),
      700 => 
      array (
        0 => 'VALUE',
        1 => '乾坤密钥',
        2 => 45001,
        3 => 6,
        4 => 136,
        5 => '杂项/乾坤秘钥',
        6 => NULL,
      ),
      701 => 
      array (
        0 => 'VALUE',
        1 => '3星夫诸力量果',
        2 => 46001,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      702 => 
      array (
        0 => 'VALUE',
        1 => '5星夫诸力量果',
        2 => 46006,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      703 => 
      array (
        0 => 'VALUE',
        1 => '7星夫诸力量果',
        2 => 46011,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      704 => 
      array (
        0 => 'VALUE',
        1 => '9星夫诸力量果',
        2 => 46016,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      705 => 
      array (
        0 => 'VALUE',
        1 => '3星夫诸灵力果',
        2 => 46021,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      706 => 
      array (
        0 => 'VALUE',
        1 => '5星夫诸灵力果',
        2 => 46026,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      707 => 
      array (
        0 => 'VALUE',
        1 => '7星夫诸灵力果',
        2 => 46031,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      708 => 
      array (
        0 => 'VALUE',
        1 => '9星夫诸灵力果',
        2 => 46036,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      709 => 
      array (
        0 => 'VALUE',
        1 => '3星夫诸敏捷果',
        2 => 46041,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      710 => 
      array (
        0 => 'VALUE',
        1 => '5星夫诸敏捷果',
        2 => 46046,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      711 => 
      array (
        0 => 'VALUE',
        1 => '7星夫诸敏捷果',
        2 => 46051,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      712 => 
      array (
        0 => 'VALUE',
        1 => '9星夫诸敏捷果',
        2 => 46056,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      713 => 
      array (
        0 => 'VALUE',
        1 => '3星夫诸气血果',
        2 => 46061,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      714 => 
      array (
        0 => 'VALUE',
        1 => '5星夫诸气血果',
        2 => 46066,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      715 => 
      array (
        0 => 'VALUE',
        1 => '7星夫诸气血果',
        2 => 46071,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      716 => 
      array (
        0 => 'VALUE',
        1 => '9星夫诸气血果',
        2 => 46076,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      717 => 
      array (
        0 => 'VALUE',
        1 => '3星角端力量果',
        2 => 46081,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      718 => 
      array (
        0 => 'VALUE',
        1 => '5星角端力量果',
        2 => 46086,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      719 => 
      array (
        0 => 'VALUE',
        1 => '7星角端力量果',
        2 => 46091,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      720 => 
      array (
        0 => 'VALUE',
        1 => '9星角端力量果',
        2 => 46096,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      721 => 
      array (
        0 => 'VALUE',
        1 => '3星角端灵力果',
        2 => 46101,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      722 => 
      array (
        0 => 'VALUE',
        1 => '5星角端灵力果',
        2 => 46106,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      723 => 
      array (
        0 => 'VALUE',
        1 => '7星角端灵力果',
        2 => 46111,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      724 => 
      array (
        0 => 'VALUE',
        1 => '9星角端灵力果',
        2 => 46116,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      725 => 
      array (
        0 => 'VALUE',
        1 => '3星角端敏捷果',
        2 => 46121,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      726 => 
      array (
        0 => 'VALUE',
        1 => '5星角端敏捷果',
        2 => 46126,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      727 => 
      array (
        0 => 'VALUE',
        1 => '7星角端敏捷果',
        2 => 46131,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      728 => 
      array (
        0 => 'VALUE',
        1 => '9星角端敏捷果',
        2 => 46136,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      729 => 
      array (
        0 => 'VALUE',
        1 => '3星角端气血果',
        2 => 46141,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      730 => 
      array (
        0 => 'VALUE',
        1 => '5星角端气血果',
        2 => 46146,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      731 => 
      array (
        0 => 'VALUE',
        1 => '7星角端气血果',
        2 => 46151,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      732 => 
      array (
        0 => 'VALUE',
        1 => '9星角端气血果',
        2 => 46156,
        3 => 6,
        4 => 137,
        5 => '杂项/仙果',
        6 => NULL,
      ),
      733 => 
      array (
        0 => 'VALUE',
        1 => '太上令',
        2 => 47001,
        3 => 6,
        4 => 138,
        5 => '杂项/活动道具',
        6 => NULL,
      ),
      734 => 
      array (
        0 => 'VALUE',
        1 => '龙宫令',
        2 => 47006,
        3 => 6,
        4 => 138,
        5 => '杂项/活动道具',
        6 => NULL,
      ),
      735 => 
      array (
        0 => 'VALUE',
        1 => '玉清符',
        2 => 47011,
        3 => 6,
        4 => 138,
        5 => '杂项/活动道具',
        6 => NULL,
      ),
      736 => 
      array (
        0 => 'VALUE',
        1 => '仙袂金蝉伙伴卡',
        2 => 48001,
        3 => 6,
        4 => 139,
        5 => '杂项/伙伴卡',
        6 => NULL,
      ),
      737 => 
      array (
        0 => 'VALUE',
        1 => '武媚才人伙伴卡',
        2 => 48016,
        3 => 6,
        4 => 139,
        5 => '杂项/伙伴卡',
        6 => NULL,
      ),
      738 => 
      array (
        0 => 'VALUE',
        1 => '紫色精魄盒',
        2 => 49001,
        3 => 6,
        4 => 140,
        5 => '杂项/精魄盒',
        6 => NULL,
      ),
      739 => 
      array (
        0 => 'VALUE',
        1 => '金色精魄盒',
        2 => 49006,
        3 => 6,
        4 => 140,
        5 => '杂项/精魄盒',
        6 => NULL,
      ),
      740 => 
      array (
        0 => 'VALUE',
        1 => '橙色精魄盒',
        2 => 49011,
        3 => 6,
        4 => 140,
        5 => '杂项/精魄盒',
        6 => NULL,
      ),
      741 => 
      array (
        0 => 'VALUE',
        1 => '蓝色精魄盒',
        2 => 49016,
        3 => 6,
        4 => 140,
        5 => '杂项/精魄盒',
        6 => NULL,
      ),
      742 => 
      array (
        0 => 'VALUE',
        1 => '攻击天香丸',
        2 => 50001,
        3 => 6,
        4 => 141,
        5 => '杂项/大力丸',
        6 => NULL,
      ),
      743 => 
      array (
        0 => 'VALUE',
        1 => '防御天香丸',
        2 => 50006,
        3 => 6,
        4 => 141,
        5 => '杂项/大力丸',
        6 => NULL,
      ),
      744 => 
      array (
        0 => 'VALUE',
        1 => '速度天香丸',
        2 => 50011,
        3 => 6,
        4 => 141,
        5 => '杂项/大力丸',
        6 => NULL,
      ),
      745 => 
      array (
        0 => 'VALUE',
        1 => '生命天香丸',
        2 => 50016,
        3 => 6,
        4 => 141,
        5 => '杂项/大力丸',
        6 => NULL,
      ),
      746 => 
      array (
        0 => 'VALUE',
        1 => '超级天香丸',
        2 => 50021,
        3 => 6,
        4 => 141,
        5 => '杂项/大力丸',
        6 => NULL,
      ),
      747 => 
      array (
        0 => 'VALUE',
        1 => '攻击玉露丸',
        2 => 50026,
        3 => 6,
        4 => 141,
        5 => '杂项/大力丸',
        6 => NULL,
      ),
      748 => 
      array (
        0 => 'VALUE',
        1 => '防御玉露丸',
        2 => 50031,
        3 => 6,
        4 => 141,
        5 => '杂项/大力丸',
        6 => NULL,
      ),
      749 => 
      array (
        0 => 'VALUE',
        1 => '速度玉露丸',
        2 => 50036,
        3 => 6,
        4 => 141,
        5 => '杂项/大力丸',
        6 => NULL,
      ),
      750 => 
      array (
        0 => 'VALUE',
        1 => '生命玉露丸',
        2 => 50041,
        3 => 6,
        4 => 141,
        5 => '杂项/大力丸',
        6 => NULL,
      ),
      751 => 
      array (
        0 => 'VALUE',
        1 => '超级玉露丸',
        2 => 50046,
        3 => 6,
        4 => 141,
        5 => '杂项/大力丸',
        6 => NULL,
      ),
      752 => 
      array (
        0 => 'VALUE',
        1 => '银元',
        2 => 51001,
        3 => 6,
        4 => 142,
        5 => '杂项/虚拟',
        6 => NULL,
      ),
      753 => 
      array (
        0 => 'VALUE',
        1 => '金元',
        2 => 51101,
        3 => 6,
        4 => 142,
        5 => '杂项/虚拟',
        6 => NULL,
      ),
      754 => 
      array (
        0 => 'VALUE',
        1 => '声望',
        2 => 51301,
        3 => 6,
        4 => 142,
        5 => '杂项/虚拟',
        6 => NULL,
      ),
      755 => 
      array (
        0 => 'VALUE',
        1 => '精力',
        2 => 51401,
        3 => 6,
        4 => 142,
        5 => '杂项/虚拟',
        6 => NULL,
      ),
      756 => 
      array (
        0 => 'VALUE',
        1 => '星魂',
        2 => 51501,
        3 => 6,
        4 => 142,
        5 => '杂项/虚拟',
        6 => NULL,
      ),
      757 => 
      array (
        0 => 'VALUE',
        1 => '蓝色精魄',
        2 => 51601,
        3 => 6,
        4 => 142,
        5 => '杂项/虚拟',
        6 => NULL,
      ),
      758 => 
      array (
        0 => 'VALUE',
        1 => '紫色精魄',
        2 => 51701,
        3 => 6,
        4 => 142,
        5 => '杂项/虚拟',
        6 => NULL,
      ),
      759 => 
      array (
        0 => 'VALUE',
        1 => '金色精魄',
        2 => 51801,
        3 => 6,
        4 => 142,
        5 => '杂项/虚拟',
        6 => NULL,
      ),
      760 => 
      array (
        0 => 'VALUE',
        1 => '帮派材料箱',
        2 => 53001,
        3 => 6,
        4 => 143,
        5 => '杂项/帮派宝箱类',
        6 => NULL,
      ),
      761 => 
      array (
        0 => 'VALUE',
        1 => '特殊材料箱',
        2 => 53006,
        3 => 6,
        4 => 143,
        5 => '杂项/帮派宝箱类',
        6 => NULL,
      ),
      762 => 
      array (
        0 => 'VALUE',
        1 => '玉清匣',
        2 => 53021,
        3 => 6,
        4 => 143,
        5 => '杂项/帮派宝箱类',
        6 => NULL,
      ),
      763 => 
      array (
        0 => 'VALUE',
        1 => 'VIP体验礼卡',
        2 => 55001,
        3 => 6,
        4 => 145,
        5 => '杂项/VIP体验',
        6 => NULL,
      ),
      764 => 
      array (
        0 => 'VALUE',
        1 => '节节高',
        2 => 56001,
        3 => 6,
        4 => 146,
        5 => '杂项/次数物品类',
        6 => NULL,
      ),
      765 => 
      array (
        0 => 'VALUE',
        1 => '红烧炮',
        2 => 56006,
        3 => 6,
        4 => 146,
        5 => '杂项/次数物品类',
        6 => NULL,
      ),
      766 => 
      array (
        0 => 'VALUE',
        1 => '幸运汤圆',
        2 => 57001,
        3 => 6,
        4 => 147,
        5 => '杂项/轮盘物品类',
        6 => NULL,
      ),
      767 => 
      array (
        0 => 'VALUE',
        1 => '祭祖乳猪',
        2 => 57006,
        3 => 6,
        4 => 147,
        5 => '杂项/轮盘物品类',
        6 => NULL,
      ),
      768 => 
      array (
        0 => 'VALUE',
        1 => '唐僧',
        2 => 58001,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      769 => 
      array (
        0 => 'VALUE',
        1 => '孙悟空',
        2 => 58006,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      770 => 
      array (
        0 => 'VALUE',
        1 => '观音菩萨',
        2 => 58011,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      771 => 
      array (
        0 => 'VALUE',
        1 => '沙僧',
        2 => 58016,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      772 => 
      array (
        0 => 'VALUE',
        1 => '猪八戒',
        2 => 58021,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      773 => 
      array (
        0 => 'VALUE',
        1 => '小白龙',
        2 => 58026,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      774 => 
      array (
        0 => 'VALUE',
        1 => '红孩儿',
        2 => 58031,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      775 => 
      array (
        0 => 'VALUE',
        1 => '黄风怪',
        2 => 58036,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      776 => 
      array (
        0 => 'VALUE',
        1 => '金翅雕',
        2 => 58041,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      777 => 
      array (
        0 => 'VALUE',
        1 => '蜘蛛精',
        2 => 58046,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      778 => 
      array (
        0 => 'VALUE',
        1 => '玉面狐',
        2 => 58051,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      779 => 
      array (
        0 => 'VALUE',
        1 => '嫦娥',
        2 => 58056,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      780 => 
      array (
        0 => 'VALUE',
        1 => '黑熊精',
        2 => 58061,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      781 => 
      array (
        0 => 'VALUE',
        1 => '百花羞',
        2 => 58066,
        3 => 6,
        4 => 148,
        5 => '杂项/卡片类',
        6 => NULL,
      ),
      782 => 
      array (
        0 => 'VALUE',
        1 => '初级经验丹',
        2 => 59001,
        3 => 6,
        4 => 149,
        5 => '杂项/主角经验丹类',
        6 => NULL,
      ),
      783 => 
      array (
        0 => 'VALUE',
        1 => '中级经验丹',
        2 => 59006,
        3 => 6,
        4 => 149,
        5 => '杂项/主角经验丹类',
        6 => NULL,
      ),
      784 => 
      array (
        0 => 'VALUE',
        1 => '高级经验丹',
        2 => 59011,
        3 => 6,
        4 => 149,
        5 => '杂项/主角经验丹类',
        6 => NULL,
      ),
      785 => 
      array (
        0 => 'VALUE',
        1 => '超级经验丹',
        2 => 59016,
        3 => 6,
        4 => 149,
        5 => '杂项/主角经验丹类',
        6 => NULL,
      ),
      786 => 
      array (
        0 => 'VALUE',
        1 => '顶级经验丹',
        2 => 59021,
        3 => 6,
        4 => 149,
        5 => '杂项/主角经验丹类',
        6 => NULL,
      ),
      787 => 
      array (
        0 => 'VALUE',
        1 => '圣级经验丹',
        2 => 59026,
        3 => 6,
        4 => 149,
        5 => '杂项/主角经验丹类',
        6 => NULL,
      ),
      788 => 
      array (
        0 => 'VALUE',
        1 => '重置星魂丹',
        2 => 60001,
        3 => 6,
        4 => 150,
        5 => '杂项/重置星魂类',
        6 => NULL,
      ),
    ),
  ),
);?>