<?php  $sheets = array (
  0 => 
  array (
    'title' => 'Sheet2',
    'data' => 
    array (
      0 => 
      array (
        0 => NULL,
        1 => '',
        2 => NULL,
        3 => NULL,
      ),
      1 => 
      array (
        0 => NULL,
        1 => '',
        2 => NULL,
        3 => NULL,
      ),
      2 => 
      array (
        0 => NULL,
        1 => '',
        2 => NULL,
        3 => NULL,
      ),
      3 => 
      array (
        0 => NULL,
        1 => '',
        2 => NULL,
        3 => NULL,
      ),
      4 => 
      array (
        0 => '-',
        1 => '“-”开头为注',
        2 => NULL,
        3 => NULL,
      ),
      5 => 
      array (
        0 => 'REM',
        1 => 'NPC功能',
        2 => NULL,
        3 => NULL,
      ),
      6 => 
      array (
        0 => NULL,
        1 => '',
        2 => NULL,
        3 => NULL,
      ),
      7 => 
      array (
        0 => NULL,
        1 => '',
        2 => NULL,
        3 => NULL,
      ),
      8 => 
      array (
        0 => 'FIELDS',
        1 => 'funs_name',
        2 => 'funs_id',
        3 => 'funs_remark',
      ),
      9 => 
      array (
        0 => 'NAME',
        1 => '功能名',
        2 => '功能ID',
        3 => '功能说明',
      ),
      10 => 
      array (
        0 => 'VALUE',
        1 => '打开仓库（无效）',
        2 => 1,
        3 => '打开仓库（无此功能）',
      ),
      11 => 
      array (
        0 => 'VALUE',
        1 => '打开商店',
        2 => 2,
        3 => '商店',
      ),
      12 => 
      array (
        0 => 'VALUE',
        1 => '加入阵营（无效）',
        2 => 3,
        3 => '加入阵营（无此功能）',
      ),
      13 => 
      array (
        0 => 'VALUE',
        1 => '进入副本（无效）',
        2 => 4,
        3 => '进入副本（无此功能）',
      ),
      14 => 
      array (
        0 => 'VALUE',
        1 => '领取家族福利（无效）',
        2 => 5,
        3 => '领取家族福利（无此功能）',
      ),
      15 => 
      array (
        0 => 'VALUE',
        1 => '进入拍卖行（无效）',
        2 => 6,
        3 => '进入拍卖行（无此功能）',
      ),
      16 => 
      array (
        0 => 'VALUE',
        1 => '查看坐骑（无效）',
        2 => 7,
        3 => '打开坐骑界面（无此功能）',
      ),
      17 => 
      array (
        0 => 'VALUE',
        1 => '组队',
        2 => 8,
        3 => '打开组队界面',
      ),
      18 => 
      array (
        0 => 'VALUE',
        1 => '破阵（无效）',
        2 => 9,
        3 => '打开破阵玩法（无此功能）',
      ),
      19 => 
      array (
        0 => 'VALUE',
        1 => '试练活动（无效）',
        2 => 10,
        3 => '打开家族试练活动（无此功能）',
      ),
      20 => 
      array (
        0 => 'VALUE',
        1 => '终极试练活动（无效）',
        2 => 11,
        3 => '打开终极试练活动（无此功能）',
      ),
      21 => 
      array (
        0 => 'VALUE',
        1 => '家族宠物（无效）',
        2 => 12,
        3 => '打开家族宠物界面（无此功能）',
      ),
      22 => 
      array (
        0 => 'VALUE',
        1 => '进入家族领地（无效）',
        2 => 13,
        3 => '进入家族领地（无此功能）',
      ),
      23 => 
      array (
        0 => 'VALUE',
        1 => '参加中忍竞技活动（无效）',
        2 => 14,
        3 => '参加中忍竞技活动（无此功能）',
      ),
      24 => 
      array (
        0 => 'VALUE',
        1 => '灵珠镶嵌',
        2 => 15,
        3 => '打开灵珠镶嵌界面',
      ),
      25 => 
      array (
        0 => 'VALUE',
        1 => '商城',
        2 => 16,
        3 => '打开商城界面',
      ),
      26 => 
      array (
        0 => 'VALUE',
        1 => '客栈',
        2 => 17,
        3 => '打开客栈界面',
      ),
      27 => 
      array (
        0 => 'VALUE',
        1 => '年兽',
        2 => 18,
        3 => '打开年兽功能',
      ),
    ),
  ),
);?>