<?php  $sheets = array (
  0 => 
  array (
    'title' => 'Sheet1',
    'data' => 
    array (
      0 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
        3 => '',
      ),
      1 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
        3 => '',
      ),
      2 => 
      array (
        0 => '-',
        1 => '“-”开头为注',
        2 => '',
        3 => '',
      ),
      3 => 
      array (
        0 => 'REM',
        1 => '场景背景音效',
        2 => '',
        3 => '',
      ),
      4 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
        3 => '',
      ),
      5 => 
      array (
        0 => 'FIELDS',
        1 => 'sound_name',
        2 => 'sound_type',
        3 => 'sound_id',
      ),
      6 => 
      array (
        0 => 'NAME',
        1 => '背景音效名称',
        2 => '音效类型',
        3 => '背景音效ID',
      ),
      7 => 
      array (
        0 => 'VALUE',
        1 => '河芳村',
        2 => 1,
        3 => 1010,
      ),
      8 => 
      array (
        0 => 'VALUE',
        1 => '云修国',
        2 => 1,
        3 => 1020,
      ),
      9 => 
      array (
        0 => 'VALUE',
        1 => '陈田郡',
        2 => 1,
        3 => 1030,
      ),
      10 => 
      array (
        0 => 'VALUE',
        1 => '莲花寨',
        2 => 1,
        3 => 1040,
      ),
      11 => 
      array (
        0 => 'VALUE',
        1 => '六步关 ',
        2 => 1,
        3 => 1050,
      ),
      12 => 
      array (
        0 => 'VALUE',
        1 => '东华山',
        2 => 1,
        3 => 1060,
      ),
      13 => 
      array (
        0 => 'VALUE',
        1 => '大明寺',
        2 => 1,
        3 => 1070,
      ),
      14 => 
      array (
        0 => 'VALUE',
        1 => '高老庄',
        2 => 1,
        3 => 1080,
      ),
      15 => 
      array (
        0 => 'VALUE',
        1 => '雪域冰川 ',
        2 => 1,
        3 => 1090,
      ),
      16 => 
      array (
        0 => 'VALUE',
        1 => '蓬莱仙岛',
        2 => 1,
        3 => 1100,
      ),
      17 => 
      array (
        0 => 'VALUE',
        1 => '锁妖塔',
        2 => 1,
        3 => 1110,
      ),
      18 => 
      array (
        0 => 'VALUE',
        1 => '世界BOSS',
        2 => 1,
        3 => 1120,
      ),
      19 => 
      array (
        0 => 'VALUE',
        1 => '保卫经书',
        2 => 1,
        3 => 1130,
      ),
      20 => 
      array (
        0 => 'VALUE',
        1 => '天宫之战',
        2 => 1,
        3 => 1140,
      ),
      21 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      22 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      23 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      24 => 
      array (
        0 => 'REM',
        1 => '战斗(技能)音效',
        2 => '',
        3 => NULL,
      ),
      25 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
        3 => NULL,
      ),
      26 => 
      array (
        0 => 'REM',
        1 => 'sound_name',
        2 => 'sound_type',
        3 => 'sound_id',
      ),
      27 => 
      array (
        0 => 'REM',
        1 => '背景音效名称',
        2 => '音效类型',
        3 => '背景音效ID',
      ),
      28 => 
      array (
        0 => 'VALUE',
        1 => '玄冥护甲',
        2 => 2,
        3 => 2010,
      ),
      29 => 
      array (
        0 => 'VALUE',
        1 => '斗魂惊云',
        2 => 2,
        3 => 2020,
      ),
      30 => 
      array (
        0 => 'VALUE',
        1 => '天火神罩',
        2 => 2,
        3 => 2030,
      ),
      31 => 
      array (
        0 => 'VALUE',
        1 => '乘风破浪',
        2 => 2,
        3 => 2040,
      ),
      32 => 
      array (
        0 => 'VALUE',
        1 => '迅杀',
        2 => 2,
        3 => 2050,
      ),
      33 => 
      array (
        0 => 'VALUE',
        1 => '血色沸腾',
        2 => 2,
        3 => 2060,
      ),
      34 => 
      array (
        0 => 'VALUE',
        1 => '春之圣疗',
        2 => 2,
        3 => 2070,
      ),
      35 => 
      array (
        0 => 'VALUE',
        1 => '突袭',
        2 => 2,
        3 => 2080,
      ),
      36 => 
      array (
        0 => 'VALUE',
        1 => '星光护翼',
        2 => 2,
        3 => 2090,
      ),
      37 => 
      array (
        0 => 'VALUE',
        1 => '斗破苍穹',
        2 => 2,
        3 => 2100,
      ),
      38 => 
      array (
        0 => 'VALUE',
        1 => '浩气震天',
        2 => 2,
        3 => 2110,
      ),
      39 => 
      array (
        0 => 'VALUE',
        1 => '破甲',
        2 => 2,
        3 => 2120,
      ),
      40 => 
      array (
        0 => 'VALUE',
        1 => '妙手回春',
        2 => 2,
        3 => 2130,
      ),
      41 => 
      array (
        0 => 'VALUE',
        1 => '碎风飞箭',
        2 => 2,
        3 => 2140,
      ),
      42 => 
      array (
        0 => 'VALUE',
        1 => '幻影迷踪',
        2 => 2,
        3 => 2150,
      ),
      43 => 
      array (
        0 => 'VALUE',
        1 => '凌波微步',
        2 => 2,
        3 => 2160,
      ),
      44 => 
      array (
        0 => 'VALUE',
        1 => '迎风千刃',
        2 => 2,
        3 => 2170,
      ),
      45 => 
      array (
        0 => 'VALUE',
        1 => '雷云啸',
        2 => 2,
        3 => 2180,
      ),
      46 => 
      array (
        0 => 'VALUE',
        1 => '原形毕露',
        2 => 2,
        3 => 2190,
      ),
      47 => 
      array (
        0 => 'VALUE',
        1 => '天颜威怒',
        2 => 2,
        3 => 2200,
      ),
      48 => 
      array (
        0 => 'VALUE',
        1 => '回旋劲刺',
        2 => 2,
        3 => 2210,
      ),
      49 => 
      array (
        0 => 'VALUE',
        1 => '玉步轻影',
        2 => 2,
        3 => 2220,
      ),
      50 => 
      array (
        0 => 'VALUE',
        1 => '陨石飞雨',
        2 => 2,
        3 => 2230,
      ),
      51 => 
      array (
        0 => 'VALUE',
        1 => '天神怒吼',
        2 => 2,
        3 => 2240,
      ),
      52 => 
      array (
        0 => 'VALUE',
        1 => '无所遁形',
        2 => 2,
        3 => 2250,
      ),
      53 => 
      array (
        0 => 'VALUE',
        1 => '百花齐放',
        2 => 2,
        3 => 2260,
      ),
      54 => 
      array (
        0 => 'VALUE',
        1 => '霸气侧漏',
        2 => 2,
        3 => 2270,
      ),
      55 => 
      array (
        0 => 'VALUE',
        1 => '痛苦之源',
        2 => 2,
        3 => 2280,
      ),
      56 => 
      array (
        0 => 'VALUE',
        1 => '仙灵附体',
        2 => 2,
        3 => 2290,
      ),
      57 => 
      array (
        0 => 'VALUE',
        1 => '天音爆破',
        2 => 2,
        3 => 2300,
      ),
      58 => 
      array (
        0 => 'VALUE',
        1 => '驭剑焚天',
        2 => 2,
        3 => 2310,
      ),
      59 => 
      array (
        0 => 'VALUE',
        1 => '叶叶飘零',
        2 => 2,
        3 => 2320,
      ),
      60 => 
      array (
        0 => 'VALUE',
        1 => '上善若水',
        2 => 2,
        3 => 2330,
      ),
      61 => 
      array (
        0 => 'VALUE',
        1 => '黯夜迷香',
        2 => 2,
        3 => 2340,
      ),
      62 => 
      array (
        0 => 'VALUE',
        1 => '空谷幽兰',
        2 => 2,
        3 => 2350,
      ),
      63 => 
      array (
        0 => 'VALUE',
        1 => '冰蓝音波',
        2 => 2,
        3 => 2360,
      ),
      64 => 
      array (
        0 => 'VALUE',
        1 => '玉净术',
        2 => 2,
        3 => 2370,
      ),
      65 => 
      array (
        0 => 'VALUE',
        1 => '狮王破吼',
        2 => 2,
        3 => 2380,
      ),
      66 => 
      array (
        0 => 'VALUE',
        1 => '恐惧波动',
        2 => 2,
        3 => 2390,
      ),
      67 => 
      array (
        0 => 'VALUE',
        1 => '焰火离心',
        2 => 2,
        3 => 2400,
      ),
      68 => 
      array (
        0 => 'VALUE',
        1 => '双重禁锢',
        2 => 2,
        3 => 2410,
      ),
      69 => 
      array (
        0 => 'VALUE',
        1 => '冷月迷音',
        2 => 2,
        3 => 2420,
      ),
      70 => 
      array (
        0 => 'VALUE',
        1 => '勇气同心',
        2 => 2,
        3 => 2430,
      ),
      71 => 
      array (
        0 => 'VALUE',
        1 => '琴瑟和鸣',
        2 => 2,
        3 => 2440,
      ),
      72 => 
      array (
        0 => 'VALUE',
        1 => '移星换日',
        2 => 2,
        3 => 2450,
      ),
      73 => 
      array (
        0 => 'VALUE',
        1 => '淬火之力',
        2 => 2,
        3 => 2460,
      ),
      74 => 
      array (
        0 => 'VALUE',
        1 => '弹尽粮绝',
        2 => 2,
        3 => 2470,
      ),
      75 => 
      array (
        0 => 'VALUE',
        1 => '流云飞矢',
        2 => 2,
        3 => 2480,
      ),
      76 => 
      array (
        0 => 'VALUE',
        1 => '凌空箭火',
        2 => 2,
        3 => 2490,
      ),
      77 => 
      array (
        0 => 'VALUE',
        1 => '圣灵之光',
        2 => 2,
        3 => 2500,
      ),
      78 => 
      array (
        0 => 'VALUE',
        1 => '合击',
        2 => 2,
        3 => 2510,
      ),
      79 => 
      array (
        0 => 'VALUE',
        1 => '乾坤斗转',
        2 => 2,
        3 => 2520,
      ),
      80 => 
      array (
        0 => 'VALUE',
        1 => '星魔斩',
        2 => 2,
        3 => 2530,
      ),
      81 => 
      array (
        0 => 'VALUE',
        1 => '追风箭',
        2 => 2,
        3 => 2540,
      ),
      82 => 
      array (
        0 => 'VALUE',
        1 => '天芒',
        2 => 2,
        3 => 2550,
      ),
      83 => 
      array (
        0 => 'VALUE',
        1 => '傲气',
        2 => 2,
        3 => 2560,
      ),
      84 => 
      array (
        0 => 'VALUE',
        1 => '续命',
        2 => 2,
        3 => 2570,
      ),
      85 => 
      array (
        0 => 'VALUE',
        1 => '压制',
        2 => 2,
        3 => 2580,
      ),
      86 => 
      array (
        0 => 'VALUE',
        1 => '撒旦',
        2 => 2,
        3 => 2590,
      ),
      87 => 
      array (
        0 => 'VALUE',
        1 => '坚韧',
        2 => 2,
        3 => 2600,
      ),
      88 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      89 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      90 => 
      array (
        0 => 'REM',
        1 => '战斗背景音效',
        2 => '',
        3 => NULL,
      ),
      91 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => NULL,
      ),
      92 => 
      array (
        0 => 'REM',
        1 => 'sound_name',
        2 => 'sound_type',
        3 => 'sound_id',
      ),
      93 => 
      array (
        0 => 'REM',
        1 => '背景音效名称',
        2 => '音效类型',
        3 => '背景音效ID',
      ),
      94 => 
      array (
        0 => 'VALUE',
        1 => '战斗背景音效 1号',
        2 => 3,
        3 => 3010,
      ),
      95 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
      ),
      96 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
      ),
      97 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
      ),
      98 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
      ),
      99 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
      ),
      100 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      101 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      102 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      103 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
      ),
      104 => 
      array (
        0 => 'REM',
        1 => '系统(如强化,背包)',
        2 => '',
        3 => NULL,
      ),
      105 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => NULL,
      ),
      106 => 
      array (
        0 => 'FIELDS',
        1 => 'sound_name',
        2 => 'sound_type',
        3 => 'sound_id',
      ),
      107 => 
      array (
        0 => 'NAME',
        1 => '背景音效名称',
        2 => '音效类型',
        3 => '音效命名(不含扩展名)',
      ),
      108 => 
      array (
        0 => 'VALUE',
        1 => '点击',
        2 => 9,
        3 => 'sys_click',
      ),
      109 => 
      array (
        0 => 'VALUE',
        1 => '不可点击',
        2 => 9,
        3 => 'sys_click_off',
      ),
      110 => 
      array (
        0 => 'VALUE',
        1 => '客栈-斗法胜利',
        2 => 9,
        3 => 'match_win',
      ),
      111 => 
      array (
        0 => 'VALUE',
        1 => '客栈-斗法失败',
        2 => 9,
        3 => 'match_lose',
      ),
      112 => 
      array (
        0 => 'VALUE',
        1 => '客栈-切水果',
        2 => 9,
        3 => 'match_cut_fruit',
      ),
      113 => 
      array (
        0 => 'VALUE',
        1 => '人物-人物升级',
        2 => 9,
        3 => 'role_upgrade',
      ),
      114 => 
      array (
        0 => 'VALUE',
        1 => '人物-技能升级',
        2 => 9,
        3 => 'skill_upgrade',
      ),
      115 => 
      array (
        0 => 'VALUE',
        1 => '人物-品质升级',
        2 => 9,
        3 => 'quality_upgrade',
      ),
      116 => 
      array (
        0 => 'VALUE',
        1 => '人物-声望升级',
        2 => 9,
        3 => 'renown_upgrade',
      ),
      117 => 
      array (
        0 => 'VALUE',
        1 => '人物-战力升级',
        2 => 9,
        3 => 'energy_upgrade',
      ),
      118 => 
      array (
        0 => 'VALUE',
        1 => '财神-招财',
        2 => 9,
        3 => 'wealth_money',
      ),
      119 => 
      array (
        0 => 'VALUE',
        1 => '仙旅奇缘-扔骰子',
        2 => 9,
        3 => 'tour_dice',
      ),
    ),
  ),
);?>