<?php  $sheets = array (
  0 => 
  array (
    'title' => 'Sheet1',
    'data' => 
    array (
      0 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
        4 => NULL,
      ),
      1 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
        4 => NULL,
      ),
      2 => 
      array (
        0 => '-',
        1 => '“-”开头为注',
        2 => NULL,
        3 => NULL,
        4 => NULL,
      ),
      3 => 
      array (
        0 => 'REM',
        1 => '城镇（区域）数据',
        2 => NULL,
        3 => NULL,
        4 => NULL,
      ),
      4 => 
      array (
        0 => 'REM',
        1 => '阵营：1 => \'人\' , 2 => \'仙\'，3 => \'魔\'',
        2 => NULL,
        3 => NULL,
        4 => NULL,
      ),
      5 => 
      array (
        0 => 'REM',
        1 => '城镇（区域）ID   人间:1XX  仙界:2XX  魔界:3XX',
        2 => NULL,
        3 => NULL,
        4 => NULL,
      ),
      6 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
        4 => NULL,
      ),
      7 => 
      array (
        0 => NULL,
        1 => NULL,
        2 => NULL,
        3 => NULL,
        4 => NULL,
      ),
      8 => 
      array (
        0 => 'FIELDS',
        1 => 'country_name',
        2 => 'country_id',
        3 => 'city_name',
        4 => 'city_id',
      ),
      9 => 
      array (
        0 => 'NAME',
        1 => '国家',
        2 => '国家ID',
        3 => '城镇（区域）名称',
        4 => '城镇（区域）ID 不可重复',
      ),
      10 => 
      array (
        0 => 'VALUE',
        1 => '中立区',
        2 => 0,
        3 => '新手村',
        4 => 801,
      ),
      11 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      12 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      13 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      14 => 
      array (
        0 => '-',
        1 => '国家',
        2 => '国家ID',
        3 => '城镇（区域）名称',
        4 => '城镇（区域）ID 不可重复',
      ),
      15 => 
      array (
        0 => 'VALUE',
        1 => '中立区',
        2 => 0,
        3 => '边郊',
        4 => 401,
      ),
      16 => 
      array (
        0 => 'VALUE',
        1 => '中立区',
        2 => 0,
        3 => '中心城',
        4 => 402,
      ),
      17 => 
      array (
        0 => 'VALUE',
        1 => '中立区',
        2 => 0,
        3 => '咒泉乡',
        4 => 403,
      ),
      18 => 
      array (
        0 => 'VALUE',
        1 => '中立区',
        2 => 0,
        3 => '龙九重',
        4 => 404,
      ),
      19 => 
      array (
        0 => 'VALUE',
        1 => '中立区',
        2 => 0,
        3 => '海之角',
        4 => 405,
      ),
      20 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      21 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      22 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      23 => 
      array (
        0 => '-',
        1 => '国家',
        2 => '国家ID',
        3 => '城镇（区域）名称',
        4 => '城镇（区域）ID 不可重复',
      ),
      24 => 
      array (
        0 => 'VALUE',
        1 => '中立区',
        2 => 0,
        3 => '副本',
        4 => 508,
      ),
      25 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      26 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      27 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      28 => 
      array (
        0 => '-',
        1 => '国家',
        2 => '国家ID',
        3 => '城镇（区域）名称',
        4 => '城镇（区域）ID 不可重复',
      ),
      29 => 
      array (
        0 => 'VALUE',
        1 => '人间',
        2 => 1,
        3 => '沙阔界',
        4 => 101,
      ),
      30 => 
      array (
        0 => 'VALUE',
        1 => '人间',
        2 => 1,
        3 => '极昼村',
        4 => 102,
      ),
      31 => 
      array (
        0 => 'VALUE',
        1 => '人间',
        2 => 1,
        3 => '副本',
        4 => 188,
      ),
      32 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      33 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      34 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      35 => 
      array (
        0 => '-',
        1 => '国家',
        2 => '国家ID',
        3 => '城镇（区域）名称',
        4 => '城镇（区域）ID 不可重复',
      ),
      36 => 
      array (
        0 => 'VALUE',
        1 => '仙界',
        2 => 2,
        3 => '火宙界',
        4 => 201,
      ),
      37 => 
      array (
        0 => 'VALUE',
        1 => '仙界',
        2 => 2,
        3 => '封兽台',
        4 => 202,
      ),
      38 => 
      array (
        0 => 'VALUE',
        1 => '仙界',
        2 => 2,
        3 => '副本',
        4 => 288,
      ),
      39 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      40 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      41 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      42 => 
      array (
        0 => '-',
        1 => '国家',
        2 => '国家ID',
        3 => '城镇（区域）名称',
        4 => '城镇（区域）ID 不可重复',
      ),
      43 => 
      array (
        0 => 'VALUE',
        1 => '魔界',
        2 => 3,
        3 => '水源界',
        4 => 301,
      ),
      44 => 
      array (
        0 => 'VALUE',
        1 => '魔界',
        2 => 3,
        3 => '落樱湖',
        4 => 302,
      ),
      45 => 
      array (
        0 => 'VALUE',
        1 => '魔界',
        2 => 3,
        3 => '副本',
        4 => 388,
      ),
      46 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      47 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
      48 => 
      array (
        0 => '',
        1 => '',
        2 => '',
        3 => '',
        4 => '',
      ),
    ),
  ),
);?>