<?php  $sheets = array (
  0 => 
  array (
    'title' => 'Sheet1',
    'data' => 
    array (
      0 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
      ),
      1 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
      ),
      2 => 
      array (
        0 => '-',
        1 => '“-”开头为注',
        2 => '',
      ),
      3 => 
      array (
        0 => 'REM',
        1 => '技能图标',
        2 => '',
      ),
      4 => 
      array (
        0 => NULL,
        1 => '',
        2 => '',
      ),
      5 => 
      array (
        0 => 'FIELDS',
        1 => 'icon_name',
        2 => 'icon_id',
      ),
      6 => 
      array (
        0 => 'NAME',
        1 => '图标名称',
        2 => '图标ID',
      ),
      7 => 
      array (
        0 => 'VALUE',
        1 => '玄冥护甲',
        2 => 101,
      ),
      8 => 
      array (
        0 => 'VALUE',
        1 => '斗魂惊云',
        2 => 202,
      ),
      9 => 
      array (
        0 => 'VALUE',
        1 => '天火神罩',
        2 => 103,
      ),
      10 => 
      array (
        0 => 'VALUE',
        1 => '乘风破浪',
        2 => 215,
      ),
      11 => 
      array (
        0 => 'VALUE',
        1 => '迅杀',
        2 => 227,
      ),
      12 => 
      array (
        0 => 'VALUE',
        1 => '血色沸腾',
        2 => 232,
      ),
      13 => 
      array (
        0 => 'VALUE',
        1 => '春之圣疗',
        2 => 212,
      ),
      14 => 
      array (
        0 => 'VALUE',
        1 => '突袭',
        2 => 217,
      ),
      15 => 
      array (
        0 => 'VALUE',
        1 => '星光护翼',
        2 => 204,
      ),
      16 => 
      array (
        0 => 'VALUE',
        1 => '斗破苍穹',
        2 => 232,
      ),
      17 => 
      array (
        0 => 'VALUE',
        1 => '浩气震天',
        2 => 233,
      ),
      18 => 
      array (
        0 => 'VALUE',
        1 => '破甲',
        2 => 108,
      ),
      19 => 
      array (
        0 => 'VALUE',
        1 => '妙手回春',
        2 => 212,
      ),
      20 => 
      array (
        0 => 'VALUE',
        1 => '碎风飞箭',
        2 => 215,
      ),
      21 => 
      array (
        0 => 'VALUE',
        1 => '幻影迷踪',
        2 => 206,
      ),
      22 => 
      array (
        0 => 'VALUE',
        1 => '凌波微步',
        2 => 223,
      ),
      23 => 
      array (
        0 => 'VALUE',
        1 => '迎风千刃',
        2 => 217,
      ),
      24 => 
      array (
        0 => 'VALUE',
        1 => '雷云啸',
        2 => 228,
      ),
      25 => 
      array (
        0 => 'VALUE',
        1 => '原形毕露',
        2 => 205,
      ),
      26 => 
      array (
        0 => 'VALUE',
        1 => '天颜威怒',
        2 => 233,
      ),
      27 => 
      array (
        0 => 'VALUE',
        1 => '回旋劲刺',
        2 => 216,
      ),
      28 => 
      array (
        0 => 'VALUE',
        1 => '玉步轻影',
        2 => 222,
      ),
      29 => 
      array (
        0 => 'VALUE',
        1 => '兽王箭',
        2 => 227,
      ),
      30 => 
      array (
        0 => 'VALUE',
        1 => '天神怒吼',
        2 => 112,
      ),
      31 => 
      array (
        0 => 'VALUE',
        1 => '无所遁形',
        2 => 228,
      ),
      32 => 
      array (
        0 => 'VALUE',
        1 => '贼眉鼠眼',
        2 => 213,
      ),
      33 => 
      array (
        0 => 'VALUE',
        1 => '霸气侧漏',
        2 => 114,
      ),
      34 => 
      array (
        0 => 'VALUE',
        1 => '痛苦之源',
        2 => 222,
      ),
      35 => 
      array (
        0 => 'VALUE',
        1 => '仙灵附体',
        2 => 115,
      ),
      36 => 
      array (
        0 => 'VALUE',
        1 => '天音爆破',
        2 => 233,
      ),
      37 => 
      array (
        0 => 'VALUE',
        1 => '驭剑焚天',
        2 => 232,
      ),
      38 => 
      array (
        0 => 'VALUE',
        1 => '叶叶飘零',
        2 => 214,
      ),
      39 => 
      array (
        0 => 'VALUE',
        1 => '上善若水',
        2 => 212,
      ),
      40 => 
      array (
        0 => 'VALUE',
        1 => '黯夜迷香',
        2 => 206,
      ),
      41 => 
      array (
        0 => 'VALUE',
        1 => '空谷幽兰',
        2 => 103,
      ),
      42 => 
      array (
        0 => 'VALUE',
        1 => '冰蓝音波',
        2 => 210,
      ),
      43 => 
      array (
        0 => 'VALUE',
        1 => '色即是空',
        2 => 223,
      ),
      44 => 
      array (
        0 => 'VALUE',
        1 => '反击',
        2 => 215,
      ),
      45 => 
      array (
        0 => 'VALUE',
        1 => '岩盾',
        2 => 208,
      ),
      46 => 
      array (
        0 => 'VALUE',
        1 => '铁布衫',
        2 => 109,
      ),
      47 => 
      array (
        0 => 'VALUE',
        1 => '金甲护体',
        2 => 208,
      ),
      48 => 
      array (
        0 => 'VALUE',
        1 => '阴阳盾',
        2 => 214,
      ),
      49 => 
      array (
        0 => 'VALUE',
        1 => '风遁',
        2 => 228,
      ),
      50 => 
      array (
        0 => 'VALUE',
        1 => '迷踪',
        2 => 204,
      ),
      51 => 
      array (
        0 => 'VALUE',
        1 => '影之箭',
        2 => 113,
      ),
      52 => 
      array (
        0 => 'VALUE',
        1 => '迷闪烁',
        2 => 104,
      ),
      53 => 
      array (
        0 => 'VALUE',
        1 => '石化',
        2 => 106,
      ),
      54 => 
      array (
        0 => 'VALUE',
        1 => '岩盾',
        2 => 205,
      ),
      55 => 
      array (
        0 => 'VALUE',
        1 => '百步杀',
        2 => 202,
      ),
      56 => 
      array (
        0 => 'VALUE',
        1 => '风暴锤',
        2 => 227,
      ),
      57 => 
      array (
        0 => 'VALUE',
        1 => '强击',
        2 => 224,
      ),
      58 => 
      array (
        0 => 'VALUE',
        1 => '惊雷术',
        2 => 230,
      ),
      59 => 
      array (
        0 => 'VALUE',
        1 => '霹雳斩',
        2 => 102,
      ),
      60 => 
      array (
        0 => 'VALUE',
        1 => '血祀',
        2 => 107,
      ),
      61 => 
      array (
        0 => 'VALUE',
        1 => '惊雷术',
        2 => 230,
      ),
      62 => 
      array (
        0 => 'VALUE',
        1 => '聚灵',
        2 => 219,
      ),
      63 => 
      array (
        0 => 'VALUE',
        1 => '突刺',
        2 => 209,
      ),
      64 => 
      array (
        0 => 'VALUE',
        1 => '刚箭',
        2 => 110,
      ),
      65 => 
      array (
        0 => 'VALUE',
        1 => '苍羽箭',
        2 => 111,
      ),
      66 => 
      array (
        0 => 'VALUE',
        1 => '水云箭',
        2 => 113,
      ),
      67 => 
      array (
        0 => 'VALUE',
        1 => '龙牙箭',
        2 => 217,
      ),
      68 => 
      array (
        0 => 'VALUE',
        1 => '愤怒一击',
        2 => 104,
      ),
      69 => 
      array (
        0 => 'VALUE',
        1 => '狂野',
        2 => 105,
      ),
      70 => 
      array (
        0 => 'VALUE',
        1 => '鬼神之怒',
        2 => 216,
      ),
      71 => 
      array (
        0 => 'VALUE',
        1 => '零式',
        2 => 217,
      ),
      72 => 
      array (
        0 => 'VALUE',
        1 => '赤月杀',
        2 => 209,
      ),
      73 => 
      array (
        0 => 'VALUE',
        1 => '会心一击',
        2 => 215,
      ),
      74 => 
      array (
        0 => 'VALUE',
        1 => '排山击',
        2 => 208,
      ),
      75 => 
      array (
        0 => 'VALUE',
        1 => '苍痕术',
        2 => 204,
      ),
      76 => 
      array (
        0 => 'VALUE',
        1 => '琉璃波',
        2 => 224,
      ),
      77 => 
      array (
        0 => 'VALUE',
        1 => '裂甲',
        2 => 108,
      ),
      78 => 
      array (
        0 => 'VALUE',
        1 => '破竹',
        2 => 113,
      ),
      79 => 
      array (
        0 => 'VALUE',
        1 => '沉醉',
        2 => 213,
      ),
      80 => 
      array (
        0 => 'VALUE',
        1 => '迷梦',
        2 => 109,
      ),
      81 => 
      array (
        0 => 'VALUE',
        1 => '昏睡',
        2 => 114,
      ),
      82 => 
      array (
        0 => 'VALUE',
        1 => '火燎',
        2 => 106,
      ),
      83 => 
      array (
        0 => 'VALUE',
        1 => '治愈术',
        2 => 212,
      ),
      84 => 
      array (
        0 => 'VALUE',
        1 => '回春术',
        2 => 212,
      ),
      85 => 
      array (
        0 => 'VALUE',
        1 => '滋养',
        2 => 212,
      ),
      86 => 
      array (
        0 => 'VALUE',
        1 => '续命术',
        2 => 212,
      ),
      87 => 
      array (
        0 => 'VALUE',
        1 => '大地怒吼',
        2 => 115,
      ),
      88 => 
      array (
        0 => 'VALUE',
        1 => '疯狂连斩',
        2 => 210,
      ),
      89 => 
      array (
        0 => 'VALUE',
        1 => '漫天飞雨',
        2 => 228,
      ),
      90 => 
      array (
        0 => 'VALUE',
        1 => '流星落',
        2 => 227,
      ),
      91 => 
      array (
        0 => 'VALUE',
        1 => '飞空摘星',
        2 => 233,
      ),
      92 => 
      array (
        0 => 'VALUE',
        1 => '惊涛海岸',
        2 => 111,
      ),
      93 => 
      array (
        0 => 'VALUE',
        1 => '恐惧流',
        2 => 112,
      ),
      94 => 
      array (
        0 => 'VALUE',
        1 => '毁天灭地',
        2 => 230,
      ),
      95 => 
      array (
        0 => 'VALUE',
        1 => '箭雨流星',
        2 => 217,
      ),
      96 => 
      array (
        0 => 'VALUE',
        1 => '万箭齐发',
        2 => 214,
      ),
      97 => 
      array (
        0 => 'VALUE',
        1 => '燕南归',
        2 => 206,
      ),
      98 => 
      array (
        0 => 'VALUE',
        1 => '鹰击长空',
        2 => 105,
      ),
      99 => 
      array (
        0 => 'VALUE',
        1 => '破阵子',
        2 => 102,
      ),
      100 => 
      array (
        0 => 'VALUE',
        1 => '势如破竹',
        2 => 113,
      ),
      101 => 
      array (
        0 => 'VALUE',
        1 => '寂灭破 ',
        2 => 213,
      ),
      102 => 
      array (
        0 => 'VALUE',
        1 => '九幽烈焰',
        2 => 115,
      ),
      103 => 
      array (
        0 => 'VALUE',
        1 => '次元杀',
        2 => 108,
      ),
      104 => 
      array (
        0 => 'VALUE',
        1 => '暴风空间',
        2 => 223,
      ),
      105 => 
      array (
        0 => 'VALUE',
        1 => '五气归元',
        2 => 207,
      ),
      106 => 
      array (
        0 => 'VALUE',
        1 => '定风波',
        2 => 109,
      ),
      107 => 
      array (
        0 => 'VALUE',
        1 => '天机算',
        2 => 205,
      ),
      108 => 
      array (
        0 => 'VALUE',
        1 => '碧空星落',
        2 => 101,
      ),
      109 => 
      array (
        0 => 'VALUE',
        1 => '残风引月',
        2 => 102,
      ),
      110 => 
      array (
        0 => 'VALUE',
        1 => '未雨绸缪',
        2 => 217,
      ),
      111 => 
      array (
        0 => 'VALUE',
        1 => '抽刀断水',
        2 => 104,
      ),
      112 => 
      array (
        0 => 'VALUE',
        1 => '平沙落雁',
        2 => 105,
      ),
      113 => 
      array (
        0 => 'VALUE',
        1 => '玉璧珠联',
        2 => 111,
      ),
      114 => 
      array (
        0 => 'VALUE',
        1 => '一呼百应',
        2 => 107,
      ),
      115 => 
      array (
        0 => 'VALUE',
        1 => '以退为进',
        2 => 108,
      ),
      116 => 
      array (
        0 => 'VALUE',
        1 => '绝杀',
        2 => 109,
      ),
      117 => 
      array (
        0 => 'VALUE',
        1 => '络灵印',
        2 => 110,
      ),
      118 => 
      array (
        0 => 'VALUE',
        1 => '混元轰',
        2 => 204,
      ),
      119 => 
      array (
        0 => 'VALUE',
        1 => '灵冰诀',
        2 => 114,
      ),
      120 => 
      array (
        0 => 'VALUE',
        1 => '烈火归元',
        2 => 113,
      ),
      121 => 
      array (
        0 => 'VALUE',
        1 => '捕风捉影',
        2 => 206,
      ),
      122 => 
      array (
        0 => 'VALUE',
        1 => '玄机变',
        2 => 233,
      ),
      123 => 
      array (
        0 => 'VALUE',
        1 => '过河拆桥',
        2 => 202,
      ),
      124 => 
      array (
        0 => 'VALUE',
        1 => '惊雷闪',
        2 => 115,
      ),
      125 => 
      array (
        0 => 'VALUE',
        1 => '天机幻',
        2 => 213,
      ),
      126 => 
      array (
        0 => 'VALUE',
        1 => '天蚕术',
        2 => 222,
      ),
      127 => 
      array (
        0 => 'VALUE',
        1 => '春风化雨',
        2 => 219,
      ),
      128 => 
      array (
        0 => 'VALUE',
        1 => '元始梵咒',
        2 => 230,
      ),
      129 => 
      array (
        0 => 'VALUE',
        1 => '海底捞月',
        2 => 208,
      ),
      130 => 
      array (
        0 => 'VALUE',
        1 => '防不胜防',
        2 => 232,
      ),
      131 => 
      array (
        0 => 'VALUE',
        1 => '惊世迷音',
        2 => 224,
      ),
      132 => 
      array (
        0 => 'VALUE',
        1 => '泰山压顶',
        2 => 112,
      ),
      133 => 
      array (
        0 => 'VALUE',
        1 => '峰回路转',
        2 => 215,
      ),
      134 => 
      array (
        0 => 'VALUE',
        1 => '迦蓝圣焰',
        2 => 216,
      ),
      135 => 
      array (
        0 => 'VALUE',
        1 => '擎天破',
        2 => 215,
      ),
      136 => 
      array (
        0 => 'VALUE',
        1 => '暗影星象',
        2 => 115,
      ),
      137 => 
      array (
        0 => 'VALUE',
        1 => '十方俱灭',
        2 => 103,
      ),
      138 => 
      array (
        0 => 'VALUE',
        1 => '殊途同归',
        2 => 106,
      ),
      139 => 
      array (
        0 => 'VALUE',
        1 => '偷天换日',
        2 => 206,
      ),
      140 => 
      array (
        0 => 'VALUE',
        1 => '天逆',
        2 => 216,
      ),
      141 => 
      array (
        0 => 'VALUE',
        1 => '厚积薄发',
        2 => 205,
      ),
      142 => 
      array (
        0 => 'VALUE',
        1 => '丹阳圣术',
        2 => 219,
      ),
      143 => 
      array (
        0 => 'VALUE',
        1 => '幻影无双',
        2 => 209,
      ),
      144 => 
      array (
        0 => 'VALUE',
        1 => '天火流星',
        2 => 227,
      ),
      145 => 
      array (
        0 => 'VALUE',
        1 => '醉春风',
        2 => 228,
      ),
      146 => 
      array (
        0 => 'VALUE',
        1 => '落风回雪',
        2 => 216,
      ),
      147 => 
      array (
        0 => 'VALUE',
        1 => '真元咒',
        2 => 234,
      ),
      148 => 
      array (
        0 => 'VALUE',
        1 => '推波助澜',
        2 => 212,
      ),
      149 => 
      array (
        0 => 'VALUE',
        1 => '化茧破蝶',
        2 => 222,
      ),
      150 => 
      array (
        0 => 'VALUE',
        1 => '焚天音波',
        2 => 233,
      ),
      151 => 
      array (
        0 => 'VALUE',
        1 => '阳春白雪',
        2 => 219,
      ),
      152 => 
      array (
        0 => 'VALUE',
        1 => '梦之迷光',
        2 => 230,
      ),
      153 => 
      array (
        0 => 'VALUE',
        1 => '冥音净化',
        2 => 213,
      ),
      154 => 
      array (
        0 => 'VALUE',
        1 => '星沉地动',
        2 => 228,
      ),
      155 => 
      array (
        0 => 'VALUE',
        1 => '排山倒海',
        2 => 111,
      ),
      156 => 
      array (
        0 => 'VALUE',
        1 => '天芒',
        2 => 220,
      ),
      157 => 
      array (
        0 => 'VALUE',
        1 => '傲气',
        2 => 106,
      ),
      158 => 
      array (
        0 => 'VALUE',
        1 => '续命',
        2 => 202,
      ),
      159 => 
      array (
        0 => 'VALUE',
        1 => '压制',
        2 => 108,
      ),
      160 => 
      array (
        0 => 'VALUE',
        1 => '撒旦',
        2 => 105,
      ),
      161 => 
      array (
        0 => 'VALUE',
        1 => '坚韧',
        2 => 216,
      ),
      162 => 
      array (
        0 => 'VALUE',
        1 => '弹指神通',
        2 => 208,
      ),
      163 => 
      array (
        0 => 'VALUE',
        1 => '水漫金山',
        2 => 215,
      ),
      164 => 
      array (
        0 => 'VALUE',
        1 => '一斧当关',
        2 => 210,
      ),
      165 => 
      array (
        0 => 'VALUE',
        1 => '入梦伏龙',
        2 => 110,
      ),
      166 => 
      array (
        0 => 'VALUE',
        1 => '焚心刀法',
        2 => 232,
      ),
      167 => 
      array (
        0 => 'VALUE',
        1 => '三味神风',
        2 => 228,
      ),
      168 => 
      array (
        0 => 'VALUE',
        1 => '枯木逢春',
        2 => 212,
      ),
      169 => 
      array (
        0 => 'VALUE',
        1 => '未卜先知',
        2 => 223,
      ),
      170 => 
      array (
        0 => 'VALUE',
        1 => '黑面赤胆',
        2 => 233,
      ),
      171 => 
      array (
        0 => 'VALUE',
        1 => '闹海降龙',
        2 => 110,
      ),
      172 => 
      array (
        0 => 'VALUE',
        1 => '撒手锏',
        2 => 233,
      ),
      173 => 
      array (
        0 => 'VALUE',
        1 => '大鹏展翅',
        2 => 103,
      ),
      174 => 
      array (
        0 => 'VALUE',
        1 => '潜灵养性',
        2 => 212,
      ),
      175 => 
      array (
        0 => 'VALUE',
        1 => '天罗地网',
        2 => 205,
      ),
      176 => 
      array (
        0 => 'VALUE',
        1 => '魂飞魄散',
        2 => 224,
      ),
      177 => 
      array (
        0 => 'VALUE',
        1 => '隐仙术',
        2 => 222,
      ),
      178 => 
      array (
        0 => 'VALUE',
        1 => '飞箭兰香',
        2 => 214,
      ),
      179 => 
      array (
        0 => 'VALUE',
        1 => '紫铃生烟',
        2 => 219,
      ),
      180 => 
      array (
        0 => 'VALUE',
        1 => '飞蛾扑火',
        2 => 216,
      ),
      181 => 
      array (
        0 => 'VALUE',
        1 => '功成身退',
        2 => 204,
      ),
      182 => 
      array (
        0 => 'VALUE',
        1 => '天罡三斧',
        2 => 106,
      ),
      183 => 
      array (
        0 => 'VALUE',
        1 => '追魂夺命',
        2 => 202,
      ),
      184 => 
      array (
        0 => 'VALUE',
        1 => '趁火打劫',
        2 => 107,
      ),
      185 => 
      array (
        0 => 'VALUE',
        1 => '快刀斩麻',
        2 => 216,
      ),
      186 => 
      array (
        0 => 'VALUE',
        1 => '轻云蔽月',
        2 => 101,
      ),
      187 => 
      array (
        0 => 'VALUE',
        1 => '闭月羞花',
        2 => 222,
      ),
      188 => 
      array (
        0 => 'VALUE',
        1 => '一锤定音',
        2 => 102,
      ),
      189 => 
      array (
        0 => 'VALUE',
        1 => '狐颜媚色',
        2 => 115,
      ),
      190 => 
      array (
        0 => 'VALUE',
        1 => '流沙狂潮',
        2 => 204,
      ),
      191 => 
      array (
        0 => 'VALUE',
        1 => '剑走偏锋',
        2 => 113,
      ),
      192 => 
      array (
        0 => 'VALUE',
        1 => '法天象地',
        2 => 109,
      ),
      193 => 
      array (
        0 => 'VALUE',
        1 => '九转玄功',
        2 => 108,
      ),
      194 => 
      array (
        0 => 'VALUE',
        1 => '倒打一耙',
        2 => 112,
      ),
      195 => 
      array (
        0 => 'VALUE',
        1 => '三昧真火',
        2 => 232,
      ),
      196 => 
      array (
        0 => 'VALUE',
        1 => '三尸化身',
        2 => 115,
      ),
      197 => 
      array (
        0 => 'VALUE',
        1 => '九天揽月',
        2 => 213,
      ),
      198 => 
      array (
        0 => 'VALUE',
        1 => '开元盛世',
        2 => 111,
      ),
      199 => 
      array (
        0 => 'VALUE',
        1 => '偷龙转凤',
        2 => 104,
      ),
      200 => 
      array (
        0 => 'VALUE',
        1 => '金蝉脱壳',
        2 => 114,
      ),
      201 => 
      array (
        0 => 'VALUE',
        1 => '七十二变',
        2 => 234,
      ),
      202 => 
      array (
        0 => 'VALUE',
        1 => '战灵女普通攻击',
        2 => 501,
      ),
      203 => 
      array (
        0 => 'VALUE',
        1 => '战灵男普通攻击',
        2 => 502,
      ),
      204 => 
      array (
        0 => 'VALUE',
        1 => '神策普通攻击',
        2 => 503,
      ),
      205 => 
      array (
        0 => 'VALUE',
        1 => '箭羽普通攻击',
        2 => 504,
      ),
      206 => 
      array (
        0 => 'VALUE',
        1 => '白烟',
        2 => 401,
      ),
      207 => 
      array (
        0 => 'VALUE',
        1 => '黑烟',
        2 => 402,
      ),
      208 => 
      array (
        0 => 'VALUE',
        1 => '加攻击',
        2 => 203,
      ),
      209 => 
      array (
        0 => 'VALUE',
        1 => '加防御',
        2 => 231,
      ),
      210 => 
      array (
        0 => 'VALUE',
        1 => '加速度',
        2 => 211,
      ),
      211 => 
      array (
        0 => 'VALUE',
        1 => '加暴击',
        2 => 218,
      ),
      212 => 
      array (
        0 => 'VALUE',
        1 => '加命中',
        2 => 201,
      ),
      213 => 
      array (
        0 => 'VALUE',
        1 => '加闪避',
        2 => 207,
      ),
      214 => 
      array (
        0 => 'VALUE',
        1 => '加格挡',
        2 => 225,
      ),
      215 => 
      array (
        0 => 'VALUE',
        1 => '加破击',
        2 => 226,
      ),
      216 => 
      array (
        0 => 'VALUE',
        1 => '免疫',
        2 => 229,
      ),
      217 => 
      array (
        0 => 'VALUE',
        1 => '加血',
        2 => 212,
      ),
      218 => 
      array (
        0 => 'VALUE',
        1 => '加士气',
        2 => 220,
      ),
      219 => 
      array (
        0 => 'VALUE',
        1 => '换位置',
        2 => 221,
      ),
      220 => 
      array (
        0 => 'VALUE',
        1 => '雷塔封咒',
        2 => 106,
      ),
      221 => 
      array (
        0 => 'VALUE',
        1 => '乘风破浪',
        2 => 214,
      ),
      222 => 
      array (
        0 => 'VALUE',
        1 => '暗影留香',
        2 => 219,
      ),
      223 => 
      array (
        0 => 'VALUE',
        1 => '九九归一',
        2 => 209,
      ),
      224 => 
      array (
        0 => 'VALUE',
        1 => '七十二变',
        2 => 234,
      ),
      225 => 
      array (
        0 => 'VALUE',
        1 => '煽风点火',
        2 => 216,
      ),
      226 => 
      array (
        0 => 'VALUE',
        1 => '青莲仙术',
        2 => 204,
      ),
      227 => 
      array (
        0 => 'VALUE',
        1 => '灭世战佛',
        2 => 225,
      ),
      228 => 
      array (
        0 => 'VALUE',
        1 => '通天净坛',
        2 => 221,
      ),
      229 => 
      array (
        0 => 'VALUE',
        1 => '菩提金身',
        2 => 107,
      ),
      230 => 
      array (
        0 => 'VALUE',
        1 => '牛气冲天',
        2 => 208,
      ),
      231 => 
      array (
        0 => 'VALUE',
        1 => '无法无天',
        2 => 112,
      ),
      232 => 
      array (
        0 => 'VALUE',
        1 => '赏善罚恶',
        2 => 209,
      ),
      233 => 
      array (
        0 => 'VALUE',
        1 => '以和服人',
        2 => 231,
      ),
      234 => 
      array (
        0 => 'VALUE',
        1 => '贵妃醉酒',
        2 => 221,
      ),
    ),
  ),
);?>