<?php 
$rs=array (
  1 => 
  array (
    11 => '帽子',
    12 => '衣服',
    13 => '披风',
    14 => '腰带',
    15 => '鞋子',
  ),
  2 => 
  array (
    31 => '长枪',
    32 => '弓箭',
    33 => '法杖',
    34 => '剑',
    35 => '枪',
    36 => '棍',
  ),
  3 => 
  array (
    51 => '翅膀',
    52 => '炎书',
    53 => '风书',
    54 => '光书',
    55 => '暗书',
    56 => '雷书',
  ),
  4 => 
  array (
    70 => '材料',
    71 => '神器材料-祝福油',
    72 => '神器材料-保护符',
    73 => '神器材料-幸运星',
    74 => '神器材料-勋章',
    75 => '神器材料-碎片',
  ),
  5 => 
  array (
    111 => '红宝石',
    112 => '黄宝石',
    113 => '钻石',
    114 => '绿宝石',
    115 => '紫宝石',
    116 => '橙宝石',
    117 => '青绿石',
    118 => '虎眼石',
    119 => '月光石',
    120 => '黑曜石',
    121 => '怒气石',
    122 => '宝石卷轴',
  ),
  6 => 
  array (
    131 => '礼包',
    132 => '宝盒',
    133 => '钱袋',
    134 => '主角经验丹',
    135 => '伙伴经验丹',
    136 => '坐骑经验丹',
    137 => '虚拟物品',
    138 => '伙伴卡',
    139 => '重置技能卡',
    140 => 'VIP体验类',
    141 => '转盘物品类',
    142 => '等级物品类',
    143 => '宠物卡片类',
  ),
);
?>